// Гарант+ Килипенко 23.10.2024 [F00229783] Отражение начислений в разрезе л/с ++
#Область ПереопределениеСтандартныхФункций

&ИзменениеИКонтроль("ПодготовитьПараметрыПроведения")
Функция ГП_ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ)

    ПараметрыПроведения = Новый Структура;

    Запрос = Новый Запрос;

    Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
    Запрос.Текст =
    "ВЫБРАТЬ
    |	Реквизиты.Ссылка,
    |	Реквизиты.Номер,
    |	Реквизиты.Дата,
    |	Реквизиты.Организация,
    |	Реквизиты.Услуга,
    |	Реквизиты.Объект,
    |	Реквизиты.ВидОперации,
    |	Реквизиты.КоличествоДнейНачисления,
    |	Реквизиты.Комментарий,
    |	Реквизиты.Ответственный,
    |	Реквизиты.НовыйДокумент,
    |	Реквизиты.РасходПоОбщедомовымУслугам,
    |	Реквизиты.СуммаДокумента
    |ИЗ
    |	Документ.КВП_НачислениеУслуг КАК Реквизиты
    |ГДЕ
    |	Реквизиты.Ссылка = &Ссылка";

    Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий();

    Реквизиты = Новый Структура("Ссылка,Номер,Дата,Организация,Услуга,Объект,
    |ВидОперации,КоличествоДнейНачисления,Комментарий,Ответственный,
    |НовыйДокумент,РасходПоОбщедомовымУслугам,СуммаДокумента");

    ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);

    мНастройкиУчетнойПолитикиТСЖ = УПЖКХ_ОбщегоНазначенияСервер.ПолучитьПараметрыУчетнойПолитикиЖКХ(Реквизиты.Дата, Реквизиты.Организация, Отказ);

    РазделУчета                 = Перечисления.УПЖКХ_РазделыУчета.НачислениеУслуг;
    ВидНачисленияНаЛицевыеСчета = Перечисления.УПЖКХ_ВидыНачислений.Начисление;

    Если Реквизиты.ВидОперации = Перечисления.КВП_ВидыОперацийНачисленияУслуг.НачислениеНаЛицевыеСчета
        ИЛИ Реквизиты.ВидОперации = Перечисления.КВП_ВидыОперацийНачисленияУслуг.НачислениеДобровольногоСтрахования Тогда
        РазделУчета = Перечисления.УПЖКХ_РазделыУчета.НачислениеУслуг;

    ИначеЕсли Реквизиты.ВидОперации = Перечисления.КВП_ВидыОперацийНачисленияУслуг.НачисленияПоПоказаниямПУ Тогда
        РазделУчета = Перечисления.УПЖКХ_РазделыУчета.НачислениеПоПУ;

    ИначеЕсли Реквизиты.ВидОперации = Перечисления.КВП_ВидыОперацийНачисленияУслуг.КомиссияБанка Тогда
        РазделУчета = Перечисления.УПЖКХ_РазделыУчета.КомиссияБанка;

    КонецЕсли;

    Реквизиты.Вставить("РазделУчета",                 РазделУчета);
    Реквизиты.Вставить("ВидНачисленияНаЛицевыеСчета", ВидНачисленияНаЛицевыеСчета);

    // Дополним структуру реквизитов настройкой варианта изменения задолженности в сторнировках начислений.
    Реквизиты.Вставить("ВариантИзмененияЗадолженностиВКорректировкахНачислений", 
    Константы.УПЖКХ_ВариантИзмененияЗадолженностиВКорректировкахНачислений.Получить());

    ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);

    Возврат ПараметрыПроведения;

КонецФункции

#КонецОбласти // ПереопределениеСтандартныхФункций
// Гарант+ Килипенко 23.10.2024 [F00229783] Отражение начислений в разрезе л/с ++

// Гарант+ Килипенко 15.10.2024 [F00229738] ПФ Начисления услуг ++
#Область СлужебныеПроцедурыИФункции

&После("ДобавитьКомандыПечати")
Процедура ГП_ДобавитьКомандыПечати(КомандыПечати)
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Обработка.ГП_ПечатьНачисленийУслуг";
    КомандаПечати.Идентификатор = "ГП_НачислениеУслуг";
    КомандаПечати.Представление = НСтр("ru = 'Начисления'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
    КомандаПечати.Порядок = 10;
    
    КомандаПечати.Картинка = БиблиотекаКартинок.Печать;
КонецПроцедуры

#КонецОбласти // ПодсистемаПечать
// Гарант+ Килипенко 15.10.2024 [F00229738] ПФ Начисления услуг --
