// Гарант+ Килипенко 15.10.2024 [F00229738] ПФ Начисления услуг ++
#Область СлужебныеПроцедурыИФункции

&После("ДобавитьКомандыПечати")
Процедура ГП_ДобавитьКомандыПечати(КомандыПечати)
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Обработка.ГП_ПечатьНачисленийУслуг";
    КомандаПечати.Идентификатор = "ГП_НачислениеУслуг";
    КомандаПечати.Представление = НСтр("ru = 'Начисления'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
    КомандаПечати.Порядок = 10;
    
    КомандаПечати.Картинка = БиблиотекаКартинок.Печать;
КонецПроцедуры

#КонецОбласти // ПодсистемаПечать
// Гарант+ Килипенко 15.10.2024 [F00229738] ПФ Начисления услуг --
