// Гарант+ Килипенко 16.09.2024 [F00227727] Доработать заполнение документа начисление по приборам учета ++
#Область ОбработчикиСобытий
	
&После("ОбработкаПроверкиЗаполнения")
Процедура ГП_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    // Отмена проверки реквизита Объект - т.к. ТЧ Список объектов заполняется из документа Ввод показаний счетчика
    Если  ЭтотОбъект.ВидОперации = Перечисления.КВП_ВидыОперацийНачисленияУслуг.НачисленияПоПоказаниямПУ 
        И ЭтотОбъект.УслугиПоПоказаниямПУ.Количество() > 0 Тогда
        ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПроверяемыеРеквизиты, "Объект");
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
// Гарант+ Килипенко 16.09.2024 [F00227727] Доработать заполнение документа начисление по приборам учета --
