// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете ++
#Область СлужебныеПроцедурыИФункции

#Область ПереопределениеСтандартныхФункций

// Переход на использование макета ГП_ПФ_MXL_СчетФактура534 для внесения изменений в ПФ
&ИзменениеИКонтроль("ПечатьСчетовФактур534")
Функция ГП_ПечатьСчетовФактур534(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПоСчетамФактурам, ПараметрыПечати)

    УстановитьПривилегированныйРежим(Истина);

    ТабДокумент = Новый ТабличныйДокумент;
    ТабДокумент.АвтоМасштаб = Истина;
    ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
    ТабДокумент.ЭкземпляровНаСтранице = 1;

    ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактураВыданный_СчетФактура534";

    УстановкаМинимальныхПолейДляПечати(ТабДокумент);

    #Удаление // Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете
    Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетФактура534");
    #КонецУдаления
    #Вставка
    // Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете ++
    Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ГП_ПФ_MXL_СчетФактура534");
    // Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете --
    #КонецВставки

    Возврат ТабличныйДокументСчетаФактуры1137(
    Макет, МассивОбъектов, ОбъектыПечати, ТабДокумент, ТекстЗапросаПоСчетамФактурам, ПараметрыПечати);

КонецФункции

#КонецОбласти // ПереопределениеСтандартныхФункций

#КонецОбласти // СлужебныеПроцедурыИФункции