
&ИзменениеИКонтроль("РасшифровкаПлатежаДоговорКонтрагентаПриИзмененииНаСервере")
Процедура ГП_РасшифровкаПлатежаДоговорКонтрагентаПриИзмененииНаСервере(Форма, СтрокаПлатеж)

    Объект = Форма.Объект;

    ПараметрыОбъекта = ПриходныйКассовыйОрдерФормыКлиентСервер.ТекущиеПараметрыОбъекта(Форма);
    ПараметрыОбъекта.ДоговорКонтрагента = СтрокаПлатеж.ДоговорКонтрагента;
    Форма.СвойстваПлатежа  = ПриходныйКассовыйОрдерФормыКлиентСервер.СвойстваСтрокРасшифровкиПлатежа(ПараметрыОбъекта, Ложь);
    #Вставка // Гарант+ Килипенко 22.01.2025 Сохранение ставки НДС при изменении Договора ++
    
    Если Форма.СвойстваПлатежа.Свойство("СтавкаНДС") И Форма.СвойстваПлатежа.СтавкаНДС <> СтрокаПлатеж.СтавкаНДС Тогда
        Форма.СвойстваПлатежа.СтавкаНДС = СтрокаПлатеж.СтавкаНДС; // Сохраняем исходную ставку НДС
        ОбщегоНазначения.СообщитьПользователю("Внимание! Ставка НДС осталась без изменений");
    КонецЕсли;
    
    #КонецВставки // Гарант+ Килипенко 22.01.2025 Сохранение ставки НДС при изменении Договора --
    ЗаполнитьЗначенияСвойств(СтрокаПлатеж, Форма.СвойстваПлатежа);

    Если ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента) Тогда
        Если ЗначениеЗаполнено(СтрокаПлатеж.СчетНаОплату) Тогда
            ДоговорСчетаПокупателю = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПлатеж.СчетНаОплату, "ДоговорКонтрагента");
            Если ЗначениеЗаполнено(ДоговорСчетаПокупателю)
                И ДоговорСчетаПокупателю <> СтрокаПлатеж.ДоговорКонтрагента Тогда
                СтрокаПлатеж.СчетНаОплату = Неопределено;
            КонецЕсли;
        КонецЕсли;
        Форма.ПредлагатьНовыйДоговор = Ложь;
    КонецЕсли;

    ПараметрыЗаполненияСчетовУчета = ПриходныйКассовыйОрдерФормыКлиентСервер.НачатьЗаполнениеСчетовУчета(
    "РасшифровкаПлатежа.ДоговорКонтрагента",
    Объект,
    СтрокаПлатеж);
    Изменения = СчетаУчетаВДокументах.ЗаполнитьРеквизитыПриИзменении(
    Документы.ПриходныйКассовыйОрдер,
    ПараметрыЗаполненияСчетовУчета.КЗаполнению,
    Объект,
    "РасшифровкаПлатежа",
    СтрокаПлатеж);
    ЗаполнитьЗначенияСвойств(Форма.СвойстваПлатежа, Изменения);
    ЗаполнитьЗначенияСвойств(СтрокаПлатеж,    Изменения);

    Если Форма.ПрименениеУСН Тогда
        ПриходныйКассовыйОрдерФормыКлиентСервер.ЗаполнитьОтражениеСтрокиВУСН(СтрокаПлатеж, Форма);
    КонецЕсли;

    ЗаполнитьЗначенияСвойств(СтрокаПлатеж, Форма.СвойстваПлатежа);

    ПриходныйКассовыйОрдерФормыКлиентСервер.ПересчитатьСуммуНДС(СтрокаПлатеж);
    ПриходныйКассовыйОрдерФормыКлиентСервер.РассчитатьСуммуВзаиморасчетов(СтрокаПлатеж, Форма);

    Если ПриходныйКассовыйОрдерФормыКлиентСервер.ФормаДокументаОднострочная(Форма) Тогда
        Если ЗначениеЗаполнено(Форма.РасшифровкаПлатежаДоговорКонтрагента) Тогда
            Форма.ЕстьРасчетыВУсловныхЕдиницах = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
            Форма.РасшифровкаПлатежаДоговорКонтрагента, "РасчетыВУсловныхЕдиницах");
        Иначе
            Форма.ЕстьРасчетыВУсловныхЕдиницах = Ложь;
        КонецЕсли;
    Иначе
        Форма.ЕстьРасчетыВУсловныхЕдиницах = Форма.ЕстьРасчетыВУсловныхЕдиницах ИЛИ СтрокаПлатеж.ДоговорКонтрагентаРасчетыВУсловныхЕдиницах;
    КонецЕсли;

    Если Не ПриходныйКассовыйОрдерФормыКлиентСервер.ФормаДокументаОднострочная(Форма) Тогда
        ПриходныйКассовыйОрдерФормыКлиентСервер.ЗаполнитьНадписиВРасшифровке(СтрокаПлатеж);
    КонецЕсли;

    УправлениеФормой(Форма); // возможно нужно отобразить реквизиты курсов валюты

КонецПроцедуры
