// Гарант+ Килипенко 31.01.2025 ++
#Область ОбработчикиСобытий
	
&После("ПередЗаписью")
Процедура ГП_ПередЗаписью(Отказ, Замещение)
    Если Отказ = Истина ИЛИ ЭтотОбъект.ОбменДанными.Загрузка = Истина Тогда
        Возврат;
    КонецЕсли;
    
    // Проверка заполненности полей ЛицевойСчет
    Если ЭтотОбъект.Количество() > 0 Тогда
        СтрокиСНезаполненнымЛицевымСчетом = Новый Массив;
        
        Для Каждого СтркаНабора Из ЭтотОбъект Цикл
            Если ЗначениеЗаполнено(СтркаНабора.ГП_ЛицевойСчет) = Ложь Тогда
                СтрокиСНезаполненнымЛицевымСчетом.Добавить(СтркаНабора);
            КонецЕсли;
        КонецЦикла;
        
        ТекстСообщения = Неопределено;
        Если СтрокиСНезаполненнымЛицевымСчетом.Количество() > 0 Тогда
            Если СтрокиСНезаполненнымЛицевымСчетом.Количество() = ЭтотОбъект.Количество() Тогда
                ТекстСообщения =
                    "ВНИМАНИЕ!!! Записи регистра ""Начисление для отражения в регл учете"" не содержат значений лицевых счетов";
            Иначе
                ТекстСообщения =
                    "ВНИМАНИЕ!!! Не все строки записей регистра ""Начисление для отражения в регл учете"" содержат значение лицевого счета";
            КонецЕсли;            
        КонецЕсли;
        
        Если ТекстСообщения <> Неопределено Тогда
            ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
            
            ДанныеРегистратора = ЭтотОбъект.Отбор.Регистратор;
            ТекстСообщения = СтрШаблон("%1%2%3", ТекстСообщения, Символы.ПС, Строка(ДанныеРегистратора));
            
            ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
                "Ошибка заполнения регистра ""Начисление для отражения в регл учете""",
                УровеньЖурналаРегистрации.Ошибка, 
                Метаданные.РегистрыНакопления.КВП_НачислениеДляОтраженияВРеглУчете, 
                ,
                ТекстСообщения);
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
// Гарант+ Килипенко 31.01.2025 --
