#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - СправочникСсылка.БанковскиеСчета, Неопределено
Функция ПолучитьБанковскийСчетКонтрагентаДляРасчета(Знач Контрагент, Знач ДатаАктуальности = Неопределено) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
        |   СчетаДляОплат.БанковскийСчет КАК БанковскийСчет
        |ИЗ
        |   РегистрСведений.ГП_СчетаДляОплат.СрезПоследних(&ДатаАктуальности) КАК СчетаДляОплат
        |ГДЕ
        |   СчетаДляОплат.Контрагент = &Контрагент
        |";

    Запрос.УстановитьПараметр("Контрагент", Контрагент);
    Если ДатаАктуальности = Неопределено Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаАктуальности", "");
    Иначе
        Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
    КонецЕсли;

    РезультатЗапроса = Запрос.Выполнить();
    Если РезультатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    Выборка = РезультатЗапроса.Выбрать();
    Выборка.Следующий();
    Возврат Выборка.БанковскийСчет;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
