// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете ++
#Область СлужебныйПрограммныйИнтерфейс

// Получает данные начислений для отражения в разрезе л/с
// Параметры:
//  ДокументОтраженияОбъект - ДокументОбъект.КВП_ОтражениеНачисленийВРеглУчете
//  СтруктураНастроекКапРемонта - Структура
//  ВыводитьСообщения - Булево - Если Истина, будут выводится сообщения для строк непрошедших контроль по остаткам к отражению
// Возвращаемое значение:
//  - ТаблицаЗначений
Функция ПолучитьДанныеДляЗаполненияОтраженияПоЛицевымСчетам(
        Знач ДокументОтраженияОбъект, Знач СтруктураНастроекКапРемонта, Знач ВыводитьСообщения = Истина) Экспорт

    МВТ = Новый МенеджерВременныхТаблиц;
    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МВТ;
    СтруктураТекстаЗапроса = ПолучитьТекстЗапросаДанныхОтраженияПоЛицевымСетам();
    Запрос.Текст = СтруктураТекстаЗапроса.ВременныеТаблицы;

    ТекстДопУсловия = "ИСТИНА";
    Если ЗначениеЗаполнено(ДокументОтраженияОбъект.Контрагент) Тогда
        Если ДокументОтраженияОбъект.Контрагент.ЭтоГруппа Тогда
            ТекстДопУсловия = ТекстДопУсловия + " И ДоговорКонтрагента.Владелец В ИЕРАРХИИ (&Контрагент)";
        Иначе
            ТекстДопУсловия = ТекстДопУсловия + " И ДоговорКонтрагента.Владелец = &Контрагент";
        КонецЕсли;
    КонецЕсли;

    Если ЗначениеЗаполнено(ДокументОтраженияОбъект.Номенклатура) Тогда
        Если ДокументОтраженияОбъект.Номенклатура.ЭтоГруппа Тогда
            ТекстДопУсловия = ТекстДопУсловия + " И Номенклатура В ИЕРАРХИИ (&Номенклатура)";
        Иначе
            ТекстДопУсловия = ТекстДопУсловия + " И Номенклатура = &Номенклатура";
        КонецЕсли;
        Запрос.УстановитьПараметр("Номенклатура", ДокументОтраженияОбъект.Номенклатура);
    КонецЕсли;

    Если ЗначениеЗаполнено(ДокументОтраженияОбъект.НоменклатурнаяГруппа) Тогда
        Если ДокументОтраженияОбъект.НоменклатурнаяГруппа.ЭтоГруппа Тогда
            ТекстДопУсловия = ТекстДопУсловия + " И НоменклатурнаяГруппа В ИЕРАРХИИ (&НоменклатурнаяГруппа)";
        Иначе
            ТекстДопУсловия = ТекстДопУсловия + " И НоменклатурнаяГруппа = &НоменклатурнаяГруппа";
        КонецЕсли;
        Запрос.УстановитьПараметр("НоменклатурнаяГруппа", ДокументОтраженияОбъект.НоменклатурнаяГруппа);
    КонецЕсли;

    Если ЗначениеЗаполнено(ДокументОтраженияОбъект.Взаиморасчеты) Тогда
        Если ДокументОтраженияОбъект.Взаиморасчеты = 1 Тогда
            ТекстДопУсловия = ТекстДопУсловия + " И НЕ ЭтоЛьгота И НЕ ЭтоПени";
        ИначеЕсли ДокументОтраженияОбъект.Взаиморасчеты = 2 Тогда
            ТекстДопУсловия = ТекстДопУсловия + " И ЭтоЛьгота";
        ИначеЕсли ДокументОтраженияОбъект.Взаиморасчеты = 3 Тогда
            ТекстДопУсловия = ТекстДопУсловия + " И ЭтоПени";
        КонецЕсли;
    КонецЕсли;

    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстДопУсловия", ТекстДопУсловия);

    ДатаСреза = Новый Граница(КонецДня(ДокументОтраженияОбъект.Дата), ВидГраницы.Включая);
    Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
    Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДокументОтраженияОбъект.Дата));
    Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДокументОтраженияОбъект.Дата));
    Запрос.УстановитьПараметр("Контрагент", ДокументОтраженияОбъект.Контрагент);
    Запрос.УстановитьПараметр("Организация", ДокументОтраженияОбъект.Организация);
    Запрос.УстановитьПараметр("ДокументОтражения", ДокументОтраженияОбъект.Ссылка);
    Запрос.УстановитьПараметр("ВедетсяРаздельныйУчетКапРемонта", СтруктураНастроекКапРемонта.ВедетсяРаздельныйУчет);
    Запрос.УстановитьПараметр("СписокНоменклатурыУслугКапРемонта", СтруктураНастроекКапРемонта.СписокНоменклатурыУслуг);

    // Формирование временных таблиц
    Запрос.Выполнить();

    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МВТ;
    Запрос.Текст = СтруктураТекстаЗапроса.ОсновнойЗапрос;
    РезультатПакета = Запрос.ВыполнитьПакет();

    ТаблицаКонтроля = РезультатПакета[1].Выгрузить();
    КонтрольОтраженияПройден = ТаблицаКонтроля.Количество() = 0;

    // Формирование таблицы контроля остатков отражения начислений
    ТаблицаРасшифровкиНеПройденногоКонтроля = Новый ТаблицаЗначений;
    ТаблицаРасшифровкиНеПройденногоКонтроля.Колонки.Добавить(
        "ДоговорКонтрагента", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
    ТаблицаРасшифровкиНеПройденногоКонтроля.Колонки.Добавить(
        "Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
    ТаблицаРасшифровкиНеПройденногоКонтроля.Колонки.Добавить(
        "СуммаОтражения", Новый ОписаниеТипов("Число"));

    // Контроль начислений для отражения по остаткам отражения
    Для Каждого СтрокаКонтроля Из ТаблицаКонтроля Цикл
        Если СтрокаКонтроля.СуммаОтражения > СтрокаКонтроля.КонтрольнаяСуммаОтражения Тогда
            КонтрольОтраженияПройден = Ложь;
            НоваяСтрока = ТаблицаРасшифровкиНеПройденногоКонтроля.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКонтроля, , "СуммаОтражения");

            Если ВыводитьСообщения Тогда
                ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
                        "Для номенклатуры: ""%1"" договора ""%2"" не пройден контроль остатков для отражения.
                        |Заполнение по л/с выполнить невозможно. Начисления для отражения превышают остатки на ""%3"".",
                        Строка(СтрокаКонтроля.Номенклатура), Строка(СтрокаКонтроля.ДоговорКонтрагента),
                        СтрокаКонтроля.СуммаОтражения - СтрокаКонтроля.КонтрольнаяСуммаОтражения));
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    ДанныеДляЗаполнения = РезультатПакета[0].Выгрузить();
    МВТ = Неопределено;

    // Устанавливаем Сумму к отражению = 0 для строк где сумма по группировке Номенклатура, Договор не соответствует остаткам к отражению
    Если КонтрольОтраженияПройден = Ложь Тогда
        ДанныеДляЗаполнения = ОчиститьТаблицуДанныхОтраженияПоЛицевымСетам(ДанныеДляЗаполнения, ТаблицаРасшифровкиНеПройденногоКонтроля);
    КонецЕсли;

    Возврат ДанныеДляЗаполнения;
КонецФункции

// Параметры:
//  СтруктураПараметровСтроки - Структура
// Возвращаемое значение:
//  - Строка
Функция СформироватьСодержаниеУслугиСУчетомЛС(Знач СтруктураПараметровСтроки) Экспорт
    НоменклатураРасшифровки = СтруктураПараметровСтроки.СтрокаРасшифровки.Номенклатура;
    НаименованиеУслугиРасшифровки = ?(ПустаяСтрока(НоменклатураРасшифровки.НаименованиеПолное),
            НоменклатураРасшифровки.Наименование, НоменклатураРасшифровки.НаименованиеПолное);

    // Замена наименования номенклатуры для содержания
    СинонимХолодногоВодоснабжения = "Водоснабжение";
    СинонимНегативногоВоздействия = "Водоотведение";
    Если СтрПодобнаПоРегулярномуВыражению(НаименованиеУслугиРасшифровки, "[Нн]егативное\s+[Вв]оздействие.*")
        ИЛИ СтрПодобнаПоРегулярномуВыражению(НаименованиеУслугиРасшифровки, "Канализация.*") Тогда

        НаименованиеУслугиРасшифровки = СинонимНегативногоВоздействия;
    ИначеЕсли СтрПодобнаПоРегулярномуВыражению(НаименованиеУслугиРасшифровки, "[Хх]олодное\s+[Вв]одоснабжение.*") Тогда
        НаименованиеУслугиРасшифровки = СинонимХолодногоВодоснабжения;
    КонецЕсли;

    // Добавление в содержание наименования л/с
    Если ЗначениеЗаполнено(СтруктураПараметровСтроки.СтрокаРасшифровки.lc_ЛицевойСчет) = Истина Тогда
        НаименованиеУслугиРасшифровки = СтрШаблон("%1, %2",
                НаименованиеУслугиРасшифровки, Строка(СтруктураПараметровСтроки.СтрокаРасшифровки.lc_ЛицевойСчет));
    КонецЕсли;

    // Формирование содержания с учетом периодичности
    РезультатФункции = РаботаСНоменклатуройКлиентСерверБП.СодержаниеУслуги(НаименованиеУслугиРасшифровки,
            СтруктураПараметровСтроки.СтрокаРасшифровки.Номенклатура.ПериодичностьУслуги,
            СтруктураПараметровСтроки.ДокументОбъект.Дата);

    // Дополнение содержания признаком ОтражениеПени
    Если СтруктураПараметровСтроки.Свойство("ОтражениеПени") И СтруктураПараметровСтроки.ОтражениеПени Тогда
        РезультатФункции = РезультатФункции + " (пени)";
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ДанныеДляЗаполнения - ТаблицаЗначений
//  ТаблицаРасшифровкиНеПройденногоКонтроля - ТаблицаЗначений
// Возвращаемое значение:
//  - ТаблицаЗначений
Функция ОчиститьТаблицуДанныхОтраженияПоЛицевымСетам(Знач ДанныеДляЗаполнения, Знач ТаблицаРасшифровкиНеПройденногоКонтроля) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |   ТаблицаРасшифровкиНеПройденногоКонтроля.ДоговорКонтрагента КАК ДоговорКонтрагента,
        |   ТаблицаРасшифровкиНеПройденногоКонтроля.Номенклатура КАК Номенклатура,
        |   ТаблицаРасшифровкиНеПройденногоКонтроля.СуммаОтражения КАК СуммаОтражения
        |ПОМЕСТИТЬ ВТ_ТаблицаРасшифровкиНеПройденногоКонтроля
        |ИЗ
        |   &ТаблицаРасшифровкиНеПройденногоКонтроля КАК ТаблицаРасшифровкиНеПройденногоКонтроля
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   *
        |ПОМЕСТИТЬ ВТ_ДанныеДляЗаполнения
        |ИЗ
        |   &ДанныеДляЗаполнения КАК ДанныеДляЗаполнения
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ВТ_ДанныеДляЗаполнения.Контрагент КАК Контрагент,
        |	ВТ_ДанныеДляЗаполнения.ДоговорКонтрагента КАК ДоговорКонтрагента,
        |	ВТ_ДанныеДляЗаполнения.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |	ВТ_ДанныеДляЗаполнения.Номенклатура КАК Номенклатура,
        |	ВТ_ДанныеДляЗаполнения.ЛицевойСчет КАК ЛицевойСчет,
        |	ВТ_ДанныеДляЗаполнения.ЭтоЛьгота КАК ЭтоЛьгота,
        |	ВТ_ДанныеДляЗаполнения.ЭтоПени КАК ЭтоПени,
        |	ВТ_ДанныеДляЗаполнения.ВариантПоставкиУслуг КАК ВариантПоставкиУслуг,
        |	ВТ_ДанныеДляЗаполнения.ДоговорПоставщикаУслуг КАК ДоговорПоставщикаУслуг,
        |	ВТ_ДанныеДляЗаполнения.ЭтоКапРемонт КАК ЭтоКапРемонт,
        |   ВЫБОР
        |       КОГДА ВТ_ТаблицаРасшифровкиНеПройденногоКонтроля.Номенклатура ЕСТЬ NULL
        |           ТОГДА ВТ_ДанныеДляЗаполнения.СуммаОтражения
        |       ИНАЧЕ ЕСТЬNULL(ВТ_ТаблицаРасшифровкиНеПройденногоКонтроля.СуммаОтражения, 0)
        |   КОНЕЦ КАК СуммаОтражения,
        |	ВТ_ДанныеДляЗаполнения.Тариф КАК Тариф,
        |	ВТ_ДанныеДляЗаполнения.Количество КАК Количество,
        |	ВТ_ДанныеДляЗаполнения.ЭтоРеализация КАК ЭтоРеализация
        |ИЗ
        |   ВТ_ДанныеДляЗаполнения КАК ВТ_ДанныеДляЗаполнения
        |   ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРасшифровкиНеПройденногоКонтроля КАК ВТ_ТаблицаРасшифровкиНеПройденногоКонтроля
        |       ПО ВТ_ДанныеДляЗаполнения.ДоговорКонтрагента = ВТ_ТаблицаРасшифровкиНеПройденногоКонтроля.ДоговорКонтрагента
        |       И ВТ_ДанныеДляЗаполнения.Номенклатура = ВТ_ТаблицаРасшифровкиНеПройденногоКонтроля.Номенклатура
        |";

    Запрос.УстановитьПараметр("ТаблицаРасшифровкиНеПройденногоКонтроля", ТаблицаРасшифровкиНеПройденногоКонтроля);
    Запрос.УстановитьПараметр("ДанныеДляЗаполнения", ДанныеДляЗаполнения);

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();
    Возврат РезультатФункции;
КонецФункции

// Возвращаемое значение:
//  - Структура
//      * ВременныеТаблицы - Строка
//      * ОсновнойЗапрос - Строка
Функция ПолучитьТекстЗапросаДанныхОтраженияПоЛицевымСетам() Экспорт
    РезультатФункции = Новый Структура("ВременныеТаблицы, ОсновнойЗапрос");

    РезультатФункции.ВременныеТаблицы =
        "ВЫБРАТЬ
        |	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
        |	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
        |	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.Номенклатура КАК Номенклатура,
        |	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ЭтоЛьгота КАК ЭтоЛьгота,
        |	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ЭтоПени КАК ЭтоПени,
        |	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ВариантПоставкиУслуг КАК ВариантПоставкиУслуг,
        |	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.ДоговорПоставщикаУслуг КАК ДоговорПоставщикаУслуг,
        |	КВП_НачислениеДляОтраженияВРеглУчетеОстатки.СуммаОстаток КАК СуммаОтражения
        |ПОМЕСТИТЬ ВТ_ТаблицаОстатков
        |ИЗ
        |	РегистрНакопления.КВП_НачислениеДляОтраженияВРеглУчете.Остатки(
        |			&ДатаСреза,
        |			Организация = &Организация
        |				И &ТекстДопУсловия) КАК КВП_НачислениеДляОтраженияВРеглУчетеОстатки
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ДвиженияДокумента.ДоговорКонтрагента.Владелец КАК Контрагент,
        |	ДвиженияДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
        |	ДвиженияДокумента.Номенклатура КАК Номенклатура,
        |	ДвиженияДокумента.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |	ДвиженияДокумента.ЭтоЛьгота КАК ЭтоЛьгота,
        |	ДвиженияДокумента.ЭтоПени КАК ЭтоПени,
        |	ДвиженияДокумента.ВариантПоставкиУслуг КАК ВариантПоставкиУслуг,
        |	ДвиженияДокумента.ДоговорПоставщикаУслуг КАК ДоговорПоставщикаУслуг,
        |	СУММА(ДвиженияДокумента.Сумма) КАК СуммаОтражения
        |ПОМЕСТИТЬ ВТ_ТаблицаДвиженийДокумента
        |ИЗ
        |	РегистрНакопления.КВП_НачислениеДляОтраженияВРеглУчете КАК ДвиженияДокумента
        |ГДЕ
        |	ДвиженияДокумента.Регистратор = &ДокументОтражения
        |	И &ТекстДопУсловия
        |
        |СГРУППИРОВАТЬ ПО
        |	ДвиженияДокумента.ДоговорКонтрагента.Владелец,
        |	ДвиженияДокумента.ДоговорКонтрагента,
        |	ДвиженияДокумента.Номенклатура,
        |	ДвиженияДокумента.НоменклатурнаяГруппа,
        |	ДвиженияДокумента.ЭтоЛьгота,
        |	ДвиженияДокумента.ЭтоПени,
        |	ДвиженияДокумента.ВариантПоставкиУслуг,
        |	ДвиженияДокумента.ДоговорПоставщикаУслуг
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ЕСТЬNULL(ТаблицаОстатков.Контрагент, ТаблицаДвиженийДокумента.Контрагент) КАК Контрагент,
        |	ЕСТЬNULL(ТаблицаОстатков.ДоговорКонтрагента, ТаблицаДвиженийДокумента.ДоговорКонтрагента) КАК ДоговорКонтрагента,
        |	ЕСТЬNULL(ТаблицаОстатков.Номенклатура, ТаблицаДвиженийДокумента.Номенклатура) КАК Номенклатура,
        |	ЕСТЬNULL(ТаблицаОстатков.НоменклатурнаяГруппа, ТаблицаДвиженийДокумента.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа,
        |	ЕСТЬNULL(ТаблицаОстатков.ЭтоЛьгота, ТаблицаДвиженийДокумента.ЭтоЛьгота) КАК ЭтоЛьгота,
        |	ЕСТЬNULL(ТаблицаОстатков.ЭтоПени, ТаблицаДвиженийДокумента.ЭтоПени) КАК ЭтоПени,
        |	ЕСТЬNULL(ТаблицаОстатков.ВариантПоставкиУслуг, ТаблицаДвиженийДокумента.ВариантПоставкиУслуг) КАК ВариантПоставкиУслуг,
        |	ЕСТЬNULL(ТаблицаОстатков.ДоговорПоставщикаУслуг, ТаблицаДвиженийДокумента.ДоговорПоставщикаУслуг) КАК ДоговорПоставщикаУслуг,
        |	ЕСТЬNULL(ТаблицаОстатков.СуммаОтражения, 0) + ЕСТЬNULL(ТаблицаДвиженийДокумента.СуммаОтражения, 0) КАК СуммаОтражения,
        |	ЛОЖЬ КАК ЭтоКапРемонт
        |ПОМЕСТИТЬ ВТ_ДанныеОтражения
        |ИЗ
        |	ВТ_ТаблицаОстатков КАК ТаблицаОстатков
        |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДвиженийДокумента КАК ТаблицаДвиженийДокумента
        |		ПО (ТаблицаДвиженийДокумента.Контрагент = ТаблицаОстатков.Контрагент)
        |			И (ТаблицаДвиженийДокумента.ДоговорКонтрагента = ТаблицаОстатков.ДоговорКонтрагента)
        |			И (ТаблицаДвиженийДокумента.Номенклатура = ТаблицаОстатков.Номенклатура)
        |			И (ТаблицаДвиженийДокумента.НоменклатурнаяГруппа = ТаблицаОстатков.НоменклатурнаяГруппа)
        |			И (ТаблицаДвиженийДокумента.ЭтоЛьгота = ТаблицаОстатков.ЭтоЛьгота)
        |			И (ТаблицаДвиженийДокумента.ЭтоПени = ТаблицаОстатков.ЭтоПени)
        |			И (ТаблицаДвиженийДокумента.ВариантПоставкиУслуг = ТаблицаОстатков.ВариантПоставкиУслуг)
        |			И (ТаблицаДвиженийДокумента.ДоговорПоставщикаУслуг = ТаблицаОстатков.ДоговорПоставщикаУслуг)
        |ГДЕ
        |	ИСТИНА
        |	И ЕСТЬNULL(ТаблицаОстатков.СуммаОтражения, 0) + ЕСТЬNULL(ТаблицаДвиженийДокумента.СуммаОтражения, 0) > 0
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ВТ_ДанныеОтражения.ДоговорКонтрагента КАК ДоговорКонтрагента,
        |	ВТ_ДанныеОтражения.Номенклатура КАК Номенклатура,
        |	СУММА(ВТ_ДанныеОтражения.СуммаОтражения) КАК СуммаОтражения
        |ПОМЕСТИТЬ ВТ_КонтрольОтраженияПоНоменклатуре
        |ИЗ
        |	ВТ_ДанныеОтражения КАК ВТ_ДанныеОтражения
        |
        |СГРУППИРОВАТЬ ПО
        |	ВТ_ДанныеОтражения.ДоговорКонтрагента,
        |	ВТ_ДанныеОтражения.Номенклатура
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	ДанныеОтражения.Контрагент КАК Контрагент,
        |	ДанныеОтражения.ДоговорКонтрагента КАК ДоговорКонтрагента,
        |	ДанныеОтражения.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |	ДанныеОтражения.Номенклатура КАК Номенклатура,
        |	УПЖКХ_НачисленияОбороты.ЛицевойСчет КАК ЛицевойСчет,
        |	ДанныеОтражения.ЭтоЛьгота КАК ЭтоЛьгота,
        |	ДанныеОтражения.ЭтоПени КАК ЭтоПени,
        |	ДанныеОтражения.ВариантПоставкиУслуг КАК ВариантПоставкиУслуг,
        |	ДанныеОтражения.ДоговорПоставщикаУслуг КАК ДоговорПоставщикаУслуг,
        |	ВТ_КонтрольОтраженияПоНоменклатуре.СуммаОтражения КАК КонтрольнаяСуммаОтражения,
        |	ДанныеОтражения.ЭтоКапРемонт КАК ЭтоКапРемонт,
        |	ЕСТЬNULL(УПЖКХ_НачисленияОбороты.СуммаНачисленияОборот, 0) КАК СуммаОтражения,
        |	ЕСТЬNULL(УПЖКХ_НачисленияОбороты.Тариф, 0) КАК Тариф,
        |	ЕСТЬNULL(УПЖКХ_НачисленияОбороты.Количество, 0) КАК Количество,
        |	ЛОЖЬ КАК ЭтоРеализация
        |ПОМЕСТИТЬ ВТ_Результат
        |ИЗ
        |	ВТ_ДанныеОтражения КАК ДанныеОтражения
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КонтрольОтраженияПоНоменклатуре КАК ВТ_КонтрольОтраженияПоНоменклатуре
        |		ПО ДанныеОтражения.Номенклатура = ВТ_КонтрольОтраженияПоНоменклатуре.Номенклатура
        |			И ДанныеОтражения.ДоговорКонтрагента = ВТ_КонтрольОтраженияПоНоменклатуре.ДоговорКонтрагента
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УПЖКХ_Начисления.Обороты(
        |				&НачалоПериода,
        |				&КонецПериода,
        |				Авто,
        |				Договор В
        |					(ВЫБРАТЬ
        |						ВТ_ДанныеОтражения.ДоговорКонтрагента
        |					ИЗ
        |						ВТ_ДанныеОтражения)) КАК УПЖКХ_НачисленияОбороты
        |		ПО ДанныеОтражения.ДоговорКонтрагента = УПЖКХ_НачисленияОбороты.Договор
        |			И ДанныеОтражения.Номенклатура = УПЖКХ_НачисленияОбороты.Услуга.Услуга
        |			И ДанныеОтражения.НоменклатурнаяГруппа = УПЖКХ_НачисленияОбороты.Услуга.Услуга.НоменклатурнаяГруппа
        |ГДЕ
        |	(УПЖКХ_НачисленияОбороты.Регистратор ССЫЛКА Документ.КВП_НачислениеУслуг
        |			ИЛИ УПЖКХ_НачисленияОбороты.Регистратор ССЫЛКА Документ.КВП_РазовоеНачислениеУслуг
        |			ИЛИ УПЖКХ_НачисленияОбороты.Регистратор ССЫЛКА Документ.УПЖКХ_НачислениеУслугВСтороннейПрограмме)
        |;";

    РезультатФункции.ОсновнойЗапрос =
        "
        |////////////////////////////////////////////////////////////////////////////////
        |// Результат[0] Данные для отражения
        |ВЫБРАТЬ
        |	ВТ_Результат.Контрагент КАК Контрагент,
        |	ВТ_Результат.ДоговорКонтрагента КАК ДоговорКонтрагента,
        |	ВТ_Результат.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
        |	ВТ_Результат.Номенклатура КАК Номенклатура,
        |	ВТ_Результат.ЛицевойСчет КАК ЛицевойСчет,
        |	ВТ_Результат.ЭтоЛьгота КАК ЭтоЛьгота,
        |	ВТ_Результат.ЭтоПени КАК ЭтоПени,
        |	ВТ_Результат.ВариантПоставкиУслуг КАК ВариантПоставкиУслуг,
        |	ВТ_Результат.ДоговорПоставщикаУслуг КАК ДоговорПоставщикаУслуг,
        |	ВТ_Результат.КонтрольнаяСуммаОтражения КАК КонтрольнаяСуммаОтражения,
        |	ВТ_Результат.ЭтоКапРемонт КАК ЭтоКапРемонт,
        |	ВТ_Результат.СуммаОтражения КАК СуммаОтражения,
        |	ВТ_Результат.Тариф КАК Тариф,
        |	ВТ_Результат.Количество КАК Количество,
        |	ВТ_Результат.ЭтоРеализация КАК ЭтоРеализация
        |ИЗ
        |	ВТ_Результат КАК ВТ_Результат
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |// Результат[1] Таблица контроля
        |ВЫБРАТЬ
        |	ВТ_Результат.ДоговорКонтрагента КАК ДоговорКонтрагента,
        |	ВТ_Результат.Номенклатура КАК Номенклатура,
        |	СУММА(ВТ_Результат.СуммаОтражения) КАК СуммаОтражения,
        |	МАКСИМУМ(ВТ_Результат.КонтрольнаяСуммаОтражения) КАК КонтрольнаяСуммаОтражения
        |ИЗ
        |	ВТ_Результат КАК ВТ_Результат
        |
        |СГРУППИРОВАТЬ ПО
        |	ВТ_Результат.ДоговорКонтрагента,
        |	ВТ_Результат.Номенклатура
        |;";

    Возврат РезультатФункции;
КонецФункции

// Гарант+ Килипенко 23.09.2024 [F00228749] Формирование счета на оплату ++
//
// Параметры:
//  ДокументРеализацииОбъект - ДокументОбъект.РеализацияТоваровИУслуг
// Возвращаемое значение:
//  - ДокументСсылка.СчетНаОплатуПокупателю
Функция СформироватьСчетНаОплатуДокументаРеализации(Знач ДокументРеализацииОбъект) Экспорт
    СчетНаОплатуОбъект = Неопределено;
    Если ДокументРеализацииОбъект.СчетНаОплатуПокупателю.Пустая() = Ложь Тогда
        СчетНаОплатуОбъект = ДокументРеализацииОбъект.СчетНаОплатуПокупателю.ПолучитьОбъект();
        Если СчетНаОплатуОбъект.ПометкаУдаления Тогда
            СчетНаОплатуОбъект.УстановитьПометкуУдаления(Ложь);
        КонецЕсли;
        СчетНаОплатуОбъект.Товары.Очистить();
    Иначе
        СчетНаОплатуОбъект = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
    КонецЕсли;

    СчетНаОплатуОбъект.Заполнить(ДокументРеализацииОбъект.Ссылка);
    СчетНаОплатуОбъект.Дата = ДокументРеализацииОбъект.Дата;
    СчетНаОплатуОбъект.Записать(РежимЗаписиДокумента.Запись);
    ДокументРеализацииОбъект.СчетНаОплатуПокупателю = СчетНаОплатуОбъект.Ссылка;

    Возврат ДокументРеализацииОбъект.СчетНаОплатуПокупателю.Ссылка;
КонецФункции // Гарант+ Килипенко 23.09.2024 [F00228749] Формирование счета на оплату ++

// Печать
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетЗаказ") Тогда
        Если МассивОбъектов.Количество() = 0 Тогда
            Возврат;
        КонецЕсли;
        
        МассивСчетовНаОплату = ПолучитьМассивСчетовНаОплатуДокументаОтражения(МассивОбъектов[0]);

        Обработки.ПечатьСчетаНаОплату.Печать(
            МассивСчетовНаОплату,
            ПараметрыПечати,
            КоллекцияПечатныхФорм,
            ОбъектыПечати,
            ПараметрыВывода);
    КонецЕсли;
КонецПроцедуры

// Параметры:
//  ДокументСсылка - ДокументСсылка.КВП_ОтражениеНачисленийВРеглУчете
// Возвращаемое значение:
//  - Массив
Функция ПолучитьМассивСчетовНаОплатуДокументаОтражения(Знач ДокументСсылка) Экспорт
    МассивДокументовРеализации =
        Документы.КВП_ОтражениеНачисленийВРеглУчете.ПолучитьМассивДокументовРеализацияТоваровИУслуг(ДокументСсылка);

    РезультатФункции = Новый Массив;
    Для Каждого ДокументРеализацииСсылка Из МассивДокументовРеализации Цикл
        СчетНаОплатуПокупателюСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
                ДокументРеализацииСсылка, "СчетНаОплатуПокупателю");

        Если СчетНаОплатуПокупателюСсылка.Пустая() Тогда
            Продолжить;
        КонецЕсли;

        РезультатФункции.Добавить(СчетНаОплатуПокупателюСсылка);
    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете --
