#Область ПрограммныйИнтерфейс

// Параметры:
//  МассивЭлементов - Массив из Строка
//  Разделитель - Строка
// Возвращаемое значение:
//  - Строка
Функция МассивВСтроку(Знач МассивЭлементов, Знач Разделитель) Экспорт
    РезультатФункции = "";

    Для Каждого ТекущийЭлемент Из МассивЭлементов Цикл
        РезультатФункции = СтрШаблон("%2%1%3", Разделитель, РезультатФункции, Строка(ТекущийЭлемент));
    КонецЦикла;
    Если СтрДлина(РезультатФункции) > 0 Тогда
        РезультатФункции = Сред(РезультатФункции, СтрДлина(Разделитель) + 1);
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  Значение - Число
//  Разделитель - Строка
// Возвращаемое значение:
//  - Число
Функция АбсолютноеЗначение(Знач Значение) Экспорт
    Возврат Макс(Значение, -Значение);
КонецФункции


#КонецОбласти // ПрограммныйИнтерфейс
