#Область ПрограммныйИнтерфейс

// Параметры:
//  МассивЭлементов - Массив из Строка
//  Разделитель - Строка
// Возвращаемое значение:
//  - Строка
Функция МассивВСтроку(Знач МассивЭлементов, Знач Разделитель) Экспорт
    РезультатФункции = "";

    Для Каждого ТекущийЭлемент Из МассивЭлементов Цикл
        РезультатФункции = СтрШаблон("%1%3%2", РезультатФункции, Разделитель, Строка(ТекущийЭлемент));
    КонецЦикла;
    Если СтрДлина(РезультатФункции) > 0 Тогда
        РезультатФункции = Сред(РезультатФункции, СтрДлина(Разделитель) + 1);
    КонецЕсли;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
