// Гарант+ Килипенко 22.01.2025 Сохранение ставки НДС при изменении Договора ++
&ИзменениеИКонтроль("ДоговорКонтрагентаПриИзменении")
Процедура ГП_ДоговорКонтрагентаПриИзменении(Форма, СтрокаПлатеж)

    Объект = Форма.Объект;

    ПараметрыОбъекта = ОплатаПлатежнойКартойКлиентСервер.ТекущиеПараметрыОбъекта(Форма);
    ПараметрыОбъекта.ДоговорКонтрагента = СтрокаПлатеж.ДоговорКонтрагента;
    Форма.СвойстваПлатежа  = ОплатаПлатежнойКартойКлиентСервер.СвойстваСтрокРасшифровкиПлатежа(ПараметрыОбъекта, Ложь);
    #Вставка // Гарант+ Килипенко 22.01.2025 Сохранение ставки НДС при изменении Договора ++
    
    Если Форма.СвойстваПлатежа.Свойство("СтавкаНДС") И Форма.СвойстваПлатежа.СтавкаНДС <> СтрокаПлатеж.СтавкаНДС Тогда
        Форма.СвойстваПлатежа.СтавкаНДС = СтрокаПлатеж.СтавкаНДС; // Сохраняем исходную ставку НДС
        ОбщегоНазначения.СообщитьПользователю("Внимание! Ставка НДС осталась без изменений");
    КонецЕсли;
    
    #КонецВставки // Гарант+ Килипенко 22.01.2025 Сохранение ставки НДС при изменении Договора --
    
    ЗаполнитьЗначенияСвойств(СтрокаПлатеж, Форма.СвойстваПлатежа);

    ПерезаполнитьСчетаУчета(Форма, СтрокаПлатеж);

    Если Форма.ПрименениеУСН Тогда
        ЗаполнитьОтражениеВУСН(Форма);
    КонецЕсли;

    ЗаполнитьЗначенияСвойств(СтрокаПлатеж, Форма.СвойстваПлатежа);

    Если ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента) Тогда
        Если ЗначениеЗаполнено(СтрокаПлатеж.СчетНаОплату) Тогда
            ДоговорСчетаПокупателю = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПлатеж.СчетНаОплату, "ДоговорКонтрагента");
            Если ЗначениеЗаполнено(ДоговорСчетаПокупателю)
                И ДоговорСчетаПокупателю <> СтрокаПлатеж.ДоговорКонтрагента Тогда
                СтрокаПлатеж.СчетНаОплату = Неопределено;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;

    ЗаполнитьДобавленныеКолонкиТаблиц(Форма);
    Если ОплатаПлатежнойКартойКлиентСервер.ФормаРасшифровкиПлатежа(Форма) Тогда
        ОплатаПлатежнойКартойКлиентСервер.ЗаполнитьНадписиВРасшифровке(СтрокаПлатеж);
    Иначе
        ОплатаПлатежнойКартойКлиентСервер.УправлениеФормой(Форма);
    КонецЕсли;

КонецПроцедуры
// Гарант+ Килипенко 22.01.2025 Сохранение ставки НДС при изменении Договора --
