// Гарант+ Килипенко 11.12.2024 [F00231508] Создание ПФ "Договор подряда" и "Акт выполненных работ к договору подряда" ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
    ГП_СоздатьДополнительныеЭлементыФормыНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 11.12.2024 [F00231508] Создание ПФ "Договор подряда" и "Акт выполненных работ к договору подряда" --

// Гарант+ Килипенко 11.12.2024 [F00231508] Создание ПФ "Договор подряда" и "Акт выполненных работ к договору подряда" ++
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ГП_СоздатьДополнительныеЭлементыФормыНаСервере()
    ГП_СоздатьПолеВидОснованияКонтрагентаНаСервере();
    ГП_СоздатьГруппуЭлементовПериодаРаботНаСервере();
    ГП_СоздатьПолеПредоплатаКонтрагентаНаСервере();
КонецПроцедуры

&НаСервере
Функция ГП_СоздатьПолеВидОснованияКонтрагентаНаСервере()
    РезультатФункции = Новый Структура("Элемент");

    // Создание элемента формы
    ИмяСоздаваемогоПоля = "ГП_ВидОснованияКонтрагента";
    ПараметрыПоля = Новый Структура("ПутьКДанным, Видимость");
    ПараметрыПоля.ПутьКДанным = "Объект." + ИмяСоздаваемогоПоля;
    ПараметрыПоля.Видимость = Истина;

    РезультатФункции.Элемент = ГП_РаботаСФормамиКлиентСервер.СоздатьПолеФормы(ИмяСоздаваемогоПоля, ПараметрыПоля, ЭтотОбъект,
            "ГруппаПодвал", "ГруппаИтоги");

    Возврат РезультатФункции;
КонецФункции

&НаСервере
Функция ГП_СоздатьГруппуЭлементовПериодаРаботНаСервере()
    РезультатФункции = Новый Структура("Группа, НачалоПериодаРабот, КонецПериодаРабот");

    // Создание группы
    ИмяСоздаваемогоЭлемента = "ГП_ГруппаПериодРабот";
    ПараметрыЭлемента = Новый Структура("Заголовок, Видимость");
    ПараметрыЭлемента.Заголовок = "Срок выполнения";
    ПараметрыЭлемента.Видимость = Истина;

    РезультатФункции.Группа = ГП_РаботаСФормамиКлиентСервер.СоздатьГруппуФормы(
            ИмяСоздаваемогоЭлемента, ПараметрыЭлемента, ЭтотОбъект,
            "ГруппаШапкаПравая", Неопределено);

    // Создание поля НачалоПериодаРабот
    ИмяСоздаваемогоЭлемента = "ГП_НачалоПериодаРабот";
    ПараметрыЭлемента = Новый Структура("Заголовок, ПутьКДанным, Видимость");
    ПараметрыЭлемента.Заголовок = "с";
    ПараметрыЭлемента.ПутьКДанным = "Объект." + ИмяСоздаваемогоЭлемента;
    ПараметрыЭлемента.Видимость = Истина;

    РезультатФункции.НачалоПериодаРабот = ГП_РаботаСФормамиКлиентСервер.СоздатьПолеФормы(
            ИмяСоздаваемогоЭлемента, ПараметрыЭлемента, ЭтотОбъект,
            РезультатФункции.Группа.Имя, Неопределено);

    // Создание поля КонецПериодаРабот
    ИмяСоздаваемогоЭлемента = "ГП_КонецПериодаРабот";
    ПараметрыЭлемента.Заголовок = "по";
    ПараметрыЭлемента.ПутьКДанным = "Объект." + ИмяСоздаваемогоЭлемента;

    РезультатФункции.КонецПериодаРабот = ГП_РаботаСФормамиКлиентСервер.СоздатьПолеФормы(
            ИмяСоздаваемогоЭлемента, ПараметрыЭлемента, ЭтотОбъект,
            РезультатФункции.Группа.Имя, Неопределено);

    Возврат РезультатФункции;
КонецФункции

&НаСервере
Функция ГП_СоздатьПолеПредоплатаКонтрагентаНаСервере()
    РезультатФункции = Новый Структура("Элемент");

    // Создание элемента формы
    ИмяСоздаваемогоПоля = "ГП_Предоплата";
    ПараметрыПоля = Новый Структура("ПутьКДанным, Видимость");
    ПараметрыПоля.ПутьКДанным = "Объект." + ИмяСоздаваемогоПоля;
    ПараметрыПоля.Видимость = Истина;

    РезультатФункции.Элемент = ГП_РаботаСФормамиКлиентСервер.СоздатьПолеФормы(ИмяСоздаваемогоПоля, ПараметрыПоля, ЭтотОбъект,
            "ГруппаШапкаПравая", "ГП_ГруппаПериодРабот");

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 11.12.2024 [F00231508] Создание ПФ "Договор подряда" и "Акт выполненных работ к договору подряда" --
