// Гарант+ Килипенко 11.12.2024 [F00231508] Создание ПФ "Договор подряда" и "Акт выполненных работ к договору подряда" ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
    ГП_СоздатьПолеВидОснованияКонтрагентаНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 11.12.2024 [F00231508] Создание ПФ "Договор подряда" и "Акт выполненных работ к договору подряда" --

// Гарант+ Килипенко 11.12.2024 [F00231508] Создание ПФ "Договор подряда" и "Акт выполненных работ к договору подряда" ++
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ГП_СоздатьПолеВидОснованияКонтрагентаНаСервере()
    РезультатФункции = Новый Структура("Элемент");

    // Создание элемента формы
    ИмяСоздаваемогоПоля = "ГП_ВидОснованияКонтрагента";
    ПараметрыПоля = Новый Структура("ПутьКДанным, Видимость");
    ПараметрыПоля.ПутьКДанным = "Объект." + ИмяСоздаваемогоПоля;
    ПараметрыПоля.Видимость = Истина;

    РезультатФункции.Элемент = ГП_РаботаСФормамиКлиентСервер.СоздатьПолеФормы(ИмяСоздаваемогоПоля, ПараметрыПоля, ЭтотОбъект,
            "ГруппаПодвал", "ГруппаИтоги");

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 11.12.2024 [F00231508] Создание ПФ "Договор подряда" и "Акт выполненных работ к договору подряда" --
