// Гарант+ Килипенко 21.11.2024 [F00231299] создание документа установка счетчика из л/с ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
    ЭтоСозданиеНаОснованииДанныхЛС = ЭтотОбъект.Объект.Ссылка.Пустая() = Истина
        И ЭтотОбъект.Параметры.Свойство("ГП_ДанныеУстановки")
        И ЭтотОбъект.Параметры.ГП_ДанныеУстановки.Свойство("Объект");

    // Заполняем данные установки счетчика значением объекта (л/с)
    Если ЭтоСозданиеНаОснованииДанныхЛС Тогда
        ЭтотОбъект.Объект.ВидОперации = Перечисления.УПЖКХ_ВидыОперацийУстановкаСчетчика.ВключитьСчетчик;

        ЭтотОбъект.Объект.Главная.Очистить();
        НоваяСтрокаГлавная = ЭтотОбъект.Объект.Главная.Добавить();
        НоваяСтрокаГлавная.Объект = ЭтотОбъект.Параметры.ГП_ДанныеУстановки.Объект;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 21.11.2024 [F00231299] создание документа установка счетчика из л/с --
