// Гарант+ Килипенко 01.11.2024 [F00230427] Создание регистрации оплаты на основании поступления ++
#Область ПрограммныйИнтерфейс

// Параметры:
//  ИмяЭлемента - Строка
//  ТипЭлемента - Тип
//  Форма - ФормаКлиентскогоПриложения
//  Родитель - Строка, Неопределено - Имя родительского элемента
//  ЭлементВставки - Строка, Неопределено
Функция СоздатьЭлементыФормы(
        Знач ИмяЭлемента, Знач ТипЭлемента, Знач Форма, Знач Родитель = Неопределено, Знач ЭлементВставки = Неопределено) Экспорт

    РезультатФункции = Неопределено;

    Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Элементы, ИмяЭлемента) = Истина Тогда
        РезультатФункции = Форма.Элементы[ИмяЭлемента];
        Возврат РезультатФункции; // Элемент уже существует
    КонецЕсли;

    Если ЭлементВставки = Неопределено Тогда
        РезультатФункции = Форма.Элементы.Добавить(
                ИмяЭлемента,
                ТипЭлемента,
                ?(Родитель = Неопределено, Форма, Форма.Элементы[Родитель]));
    Иначе
        РезультатФункции = Форма.Элементы.Вставить(
                ИмяЭлемента,
                ТипЭлемента,
                ?(Родитель = Неопределено, Форма, Форма.Элементы[Родитель]),
                Форма.Элементы[ЭлементВставки]);
    КонецЕсли;

    РезультатФункции.Видимость = Истина;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  Имя - Строка
//  ПараметрыКнопки - Структура
//  Форма - ФормаКлиентскогоПриложения
//  Родитель - Строка, Неопределено - Имя родительского элемента
//  ЭлементВставки - Строка, Неопределено
Функция СоздатьКнопкуФормы(
    Знач Имя, Знач ПараметрыКнопки, Знач Форма, Знач Родитель = Неопределено, Знач ЭлементВставки = Неопределено) Экспорт

    НовыйЭлемент = СоздатьЭлементыФормы(Имя, Тип("КнопкаФормы"), Форма, Родитель, ЭлементВставки);

    ЗаполнитьЗначенияСвойств(НовыйЭлемент, ПараметрыКнопки);

    Возврат НовыйЭлемент;
КонецФункции

Функция СоздатьПолеФормы(
    Знач Имя, Знач ПараметрыПоля, Знач Форма, Знач Родитель = Неопределено, Знач ЭлементВставки = Неопределено) Экспорт

    НовыйЭлемент = СоздатьЭлементыФормы(Имя, Тип("ПолеФормы"), Форма, Родитель, ЭлементВставки);

    Если ПараметрыПоля.Свойство("Вид") = Ложь Тогда
        ПараметрыПоля.Вставить("Вид", ВидПоляФормы.ПолеВвода);
    КонецЕсли;
    
    ЗаполнитьЗначенияСвойств(НовыйЭлемент, ПараметрыПоля);

    Возврат НовыйЭлемент;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 01.11.2024 [F00230427] Создание регистрации оплаты на основании поступления --
