// ++ Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика ++
#Область ОбработчикиСобытийФормы

//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЭтотОбъект.ДатаУстановки = Дата(2024, 07, 01);
    ЭтотОбъект.ТолькоСчетчикиБП77 = Истина;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// -- Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика --

// ++ Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика ++
#Область ОбработчикиКомандФормы

// Команда выполняет создание документа Установка счетчика со списком счетчиков лицевых счетов
&НаКлиенте
Асинх Процедура ЗаполнитьДокументыУстановки(Команда)
    РезультатДиалога = Ждать ВопросАсинх(
            "Процедура выполнит создание документа Установка счетчика по данным из БП 7.7.
            |Продолжить?", РежимДиалогаВопрос.ДаНет, , , "Внимание!");
    Если РезультатДиалога <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

    // Создание и заполнение документа Установка счетчика
    РезультатСоздания = ЗаполнитьДокументыУстановкиНаСервере(ЭтотОбъект.ДатаУстановки);

    // Вывод сообщения о результате выполнения
    Если РезультатСоздания.Успех = Ложь Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю(
            СтрШаблон("Создание документа не выполнено.
                |Сообщение о причине: %1", РезультатСоздания.СообщениеОбОшибке));
    Иначе
        ОбщегоНазначенияКлиент.СообщитьПользователю(
            СтрШаблон("Создание документа Установка счетчика выполнено успешно.
                |Создано ""%1"" строк установок счетчиков.", РезультатСоздания.УстановленныеСчетчики.Количество()));
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// -- Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика --

// ++ Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика ++
#Область СлужебныеПроцедурыИФункции

// Выполняет создание документа Установка счетчика со списком счетчиков лицевых счетов
// Параметры:
//  ДатаУстановки - Дата
// Возвращаемое значение:
//  - Структура:
//      * Успех - Булево
//      * УстановленныеСчетчики - Массив из СправочникСсылка.КВП_Счетчики
//      * СообщениеОбОшибке - Строка, Неопределено
&НаСервереБезКонтекста
Функция ЗаполнитьДокументыУстановкиНаСервере(Знач ДатаУстановки)
    ДатаУстановки = ?(ЗначениеЗаполнено(ДатаУстановки), НачалоДня(ДатаУстановки), Неопределено);
    РезультатФункции = Обработки.ГП_ЗаполнениеУстановкиСчетчиков.СоздатьДокументыУстановкиСчетчиковБезВводаПоказаний(ДатаУстановки);
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// -- Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика --
