#Область ПрограммныйИнтерфейс

#Область РаботаСФормами
// Выводит форму вопроса пользователю для подтверждения намеренья выполнить операцию.
//  Выполняется в асинхронном режиме
// Параметры:
//  ТекстВопроса - Строка
// Возвращаемое значение:
//  - Обещание - (Булево) Если Истина, пользователь согласен выполнить операцию, иначе Ложь
Асинх Функция СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(Знач ТекстВопроса) Экспорт
    РезультатДиалога = Ждать ВопросАсинх(СтрШаблон(
                "%1
                |Продолжить?", ТекстВопроса), РежимДиалогаВопрос.ДаНет, , , "Внимание!");

    Возврат РезультатДиалога = КодВозвратаДиалога.Да;
КонецФункции
#КонецОбласти // РаботаСФормами

#КонецОбласти // ПрограммныйИнтерфейс
