#Область ПрограммныйИнтерфейс

#Область РаботаСФормами
// Выводит форму вопроса пользователю для подтверждения намеренья выполнить операцию.
//  Выполняется в асинхронном режиме
// Параметры:
//  ТекстВопроса - Строка
// Возвращаемое значение:
//  - Обещание - (Булево) Если Истина, пользователь согласен выполнить операцию, иначе Ложь
Асинх Функция СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(Знач ТекстВопроса) Экспорт
    РезультатДиалога = Ждать ВопросАсинх(СтрШаблон(
                "%1
                |Продолжить?", ТекстВопроса), РежимДиалогаВопрос.ДаНет, , , "Внимание!");

    Возврат РезультатДиалога = КодВозвратаДиалога.Да;
КонецФункции
#КонецОбласти // РаботаСФормами

// Параметры:
//  РезультатЗаполнения - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Булево
//  ИмяПоляЗаполнения - Строка
Процедура СообщитьПользователюРезультатЗаполненияПоля(Знач РезультатЗаполнения, Знач ИмяПоляЗаполнения) Экспорт
    СообщениеПользователю = "";
    Если РезультатЗаполнения.Успех = Ложь Тогда
        СообщениеПользователю = СтрШаблон("Процедура заполнения %1 не выполнена.
                |Информация об ошибке: %2", ИмяПоляЗаполнения, РезультатЗаполнения.СообщениеОбОшибке);
    Иначе
        СообщениеПользователю = СтрШаблон("Заполнение данных %1 выполнено успешно
                |Заполнены значения для ""%2"" записей.", ИмяПоляЗаполнения, РезультатЗаполнения.КоличествоИзмененныхСтрок);
    КонецЕсли;

    ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);
КонецПроцедуры

// Стандартная для данной конфигурации функция форматирования сумм
// Параметры:
//  Сумма  - Число
// Возвращаемое значение:
//  - Строка
Функция ФорматСумм(Знач Сумма) Экспорт
    Возврат ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма, Неопределено, "0");
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
