// Гарант+ Килипенко 17.09.2024 [F00228438] Вид тарифа потребителя для Установки тарифа ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    ГП_СоздатьПолеВидТарифаПотребителя();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 17.09.2024 [F00228438] Вид тарифа потребителя для Установки тарифа --

// Гарант+ Килипенко 17.09.2024 [F00228438] Вид тарифа потребителя для Установки тарифа ++
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ГП_СоздатьПолеВидТарифаПотребителя()
    ПолеВидТарифаПотребителя = ЭтотОбъект.Элементы.Добавить(
            "ГП_ВидТарифаПотребителя",
            Тип("ПолеФормы"),
            ЭтотОбъект.Элементы.ГруппаСправа);
    ПолеВидТарифаПотребителя.Вид = ВидПоляФормы.ПолеВвода;
    ПолеВидТарифаПотребителя.ПутьКДанным  = "Объект.ГП_ВидТарифаПотребителя";

    Возврат ПолеВидТарифаПотребителя;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 17.09.2024 [F00228438] Вид тарифа потребителя для Установки тарифа --
