// Гарант+ Килипенко 11.12.2024 [F00231508] Создание ПФ "Договор подряда" и "Акт выполненных работ к договору подряда" ++
#Область СлужебныеПроцедурыИФункции

&После("ДобавитьКомандыПечати")
Процедура ГП_ДобавитьКомандыПечати(КомандыПечати)
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Обработка.ГП_ПечатьДоговораПодряда";
    КомандаПечати.Идентификатор = "ГП_ДоговорПодряда";
    КомандаПечати.Представление = НСтр("ru = 'Договор подряда'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
    КомандаПечати.Порядок = 10;

    // КомандаПечати.Картинка = БиблиотекаКартинок.Печать;
КонецПроцедуры

#КонецОбласти // ПодсистемаПечать
// Гарант+ Килипенко 11.12.2024 [F00231508] Создание ПФ "Договор подряда" и "Акт выполненных работ к договору подряда" --
