// Гарант+ Килипенко 16.09.2024 [F00227727] Доработать заполнение документа начисление по приборам учета ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
    ЭтоНовыйДокументБезКопирования = Объект.Ссылка.Пустая()
        И (ЭтотОбъект.Параметры.Свойство("ЗначениеКопирования") = Ложь
            ИЛИ ЗначениеЗаполнено(ЭтотОбъект.Параметры.ЗначениеКопирования));
    Если Отказ ИЛИ ЭтоНовыйДокументБезКопирования Тогда
        Возврат;
    КонецЕсли;

    Если ЭтотОбъект.Параметры.Свойство("ГП_ВидОперации") Тогда
        ЭтотОбъект.Объект.ВидОперации = ЭтотОбъект.Параметры.ГП_ВидОперации;
    КонецЕсли;

    Если ЭтотОбъект.Объект.ВидОперации = Перечисления.КВП_ВидыОперацийНачисленияУслуг.НачисленияПоПоказаниямПУ
        И ЭтотОбъект.Параметры.Свойство("ГП_СписокЛицевыхСчетов") Тогда
        ЭтотОбъект.Объект.УслугиПоПоказаниямПУ.Очистить();
        
        // Основная услуга
        ЭтотОбъект.Объект.Услуга = Справочники.КВП_Услуги.НайтиПоКоду("00-001");

        ДокументОбъект = ДанныеФормыВЗначение(ЭтотОбъект.Объект, Тип("ДокументОбъект.КВП_НачислениеУслуг"));
		ДокументОбъект.ЗаполнитьТабличнуюЧастьУслуги(ЭтотОбъект.Параметры.ГП_СписокЛицевыхСчетов);
		ЗначениеВДанныеФормы(ДокументОбъект, ЭтотОбъект.Объект);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 16.09.2024 [F00227727] Доработать заполнение документа начисление по приборам учета --
