// Гарант+ Килипенко 16.09.2024 [F00227727] Доработать заполнение документа начисление по приборам учета ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
    ЭтоНовыйДокументБезКопирования = Объект.Ссылка.Пустая()
        И (ЭтотОбъект.Параметры.Свойство("ЗначениеКопирования") = Ложь
            ИЛИ ЗначениеЗаполнено(ЭтотОбъект.Параметры.ЗначениеКопирования));
    Если Отказ ИЛИ ЭтоНовыйДокументБезКопирования Тогда
        Возврат;
    КонецЕсли;

    ГП_ЗаполнитьНаОснованииВводаПоказанийНаПУ();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 16.09.2024 [F00227727] Доработать заполнение документа начисление по приборам учета --

// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ГП_ЗаполнитьНаОснованииВводаПоказанийНаПУ()
    РезультатФункции = Новый Структура("Успех", Истина);

    // Это новый документ
    ЭтоНовыйДокументНаОснованииВводаПоказанийНаПУ = Объект.Ссылка.Пустая();
    // Это начисления по показаниям ПУ
    ЭтоНовыйДокументНаОснованииВводаПоказанийНаПУ = ЭтоНовыйДокументНаОснованииВводаПоказанийНаПУ
        И ЭтотОбъект.Параметры.Свойство("ГП_ВидОперации")
        И ЭтотОбъект.Параметры.ГП_ВидОперации = Перечисления.КВП_ВидыОперацийНачисленияУслуг.НачисленияПоПоказаниямПУ;
    // Передано значение услуги для начисления
    ЭтоНовыйДокументНаОснованииВводаПоказанийНаПУ = ЭтоНовыйДокументНаОснованииВводаПоказанийНаПУ
        И ЭтотОбъект.Параметры.Свойство("ГП_Услуга");
    // Передан список л/с для заполнения
    ЭтоНовыйДокументНаОснованииВводаПоказанийНаПУ = ЭтоНовыйДокументНаОснованииВводаПоказанийНаПУ
        И ЭтотОбъект.Параметры.Свойство("ГП_СписокЛицевыхСчетов")
        И ТипЗнч(ЭтотОбъект.Параметры.ГП_СписокЛицевыхСчетов) = Тип("СписокЗначений");

    Если ЭтоНовыйДокументНаОснованииВводаПоказанийНаПУ = Ложь Тогда
        РезультатФункции.Успех = Ложь;
        Возврат РезультатФункции; // Нет данных для заполнения
    КонецЕсли;

    ЭтотОбъект.Объект.Услуга = ЭтотОбъект.Параметры.ГП_Услуга;
    ЭтотОбъект.Объект.ВидОперации = ЭтотОбъект.Параметры.ГП_ВидОперации;
    ЭтотОбъект.Объект.УслугиПоПоказаниямПУ.Очистить();

    // Заполнение ТЧ Услуги
    ДокументОбъект = ДанныеФормыВЗначение(ЭтотОбъект.Объект, Тип("ДокументОбъект.КВП_НачислениеУслуг"));
    ДокументОбъект.ЗаполнитьТабличнуюЧастьУслуги(ЭтотОбъект.Параметры.ГП_СписокЛицевыхСчетов);
    ЗначениеВДанныеФормы(ДокументОбъект, ЭтотОбъект.Объект);

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете --
