Функция СведенияОВнешнейОбработке() Экспорт  
	
	ПараметрыРегистрации = Новый Структура;  
	МассивНазначений = Новый Массив; 
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");  
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений); 
	ПараметрыРегистрации.Вставить("Наименование", "Отправка чеков в ОФД(Счетмаш)"); 
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь); 
	ПараметрыРегистрации.Вставить("Версия", "7.7"); 
	ПараметрыРегистрации.Вставить("Информация", "Обработка 'Отправка чеков в ОФД(Счетмаш)'"); 
	ТаблицаКоманд = ПолучитьТаблицуКоманд(); 
	ДобавитьКоманду(ТаблицаКоманд, 
	"Отправка чеков в ОФД(Счетмаш)", 
	"Отправка чеков в ОФД(Счетмаш)", 
	"ОткрытиеФормы", //Использование. Варианты: "ОткрытиеФормы", "ВызовКлиентскогоМетода", "ВызовСерверногоМетода" 
	Ложь,//Показывать оповещение. Варианты Истина, Ложь 
	"");//Модификатор 
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд); 
	Возврат ПараметрыРегистрации; 
	
КонецФункции

Функция ПолучитьТаблицуКоманд() 

	Команды = Новый ТаблицаЗначений; 
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); 
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево")); 
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка")); 

Возврат Команды; 

КонецФункции 


Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "") 

	НоваяКоманда = ТаблицаКоманд.Добавить(); 
	НоваяКоманда.Представление = Представление; 
	НоваяКоманда.Идентификатор = Идентификатор; 
	НоваяКоманда.Использование = Использование; 
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение; 
	НоваяКоманда.Модификатор = Модификатор; 

КонецПроцедуры