// Гарант+ Килипенко 23.09.2024 [F00228749] Формирование счета на оплату ++
#Область СлужебныеПроцедурыИФункции

&После ("ДобавитьКомандыПечати")
Процедура ГП_ДобавитьКомандыПечати(КомандыПечати)
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "ОбщийМодуль.ГП_ОтражениеВРегУчетеСлужебный";
    КомандаПечати.Идентификатор = "СчетЗаказ";
    КомандаПечати.Представление = НСтр("ru = 'Счет на оплату'");
    КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
    КомандаПечати.Порядок = 10;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 23.09.2024 [F00228749] Формирование счета на оплату ++
