// Гарант+ Килипенко 23.09.2024 [F00228749] Формирование счета на оплату ++
#Область ПрограммныйИнтерфейс

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
    Если МассивОбъектов.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    МассивСчетовНаОплату = ГП_ПолучитьМассивСчетовНаОплату(МассивОбъектов[0]);

    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетЗаказ") Тогда
        Обработки.ПечатьСчетаНаОплату.Печать(
            МассивСчетовНаОплату,
            ПараметрыПечати,
            КоллекцияПечатныхФорм,
            ОбъектыПечати,
            ПараметрыВывода);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 23.09.2024 [F00228749] Формирование счета на оплату --

// Гарант+ Килипенко 23.09.2024 [F00228749] Формирование счета на оплату ++
#Область СлужебныеПроцедурыИФункции

Функция ГП_ПолучитьМассивСчетовНаОплату(Знач ДокументСсылка)
    МассивДокументовРеализации =
        Документы.КВП_ОтражениеНачисленийВРеглУчете.ПолучитьМассивДокументовРеализацияТоваровИУслуг(ДокументСсылка);

    РезультатФункции = Новый Массив;
    Для Каждого ДокументРеализацииСсылка Из МассивДокументовРеализации Цикл
        СчетНаОплатуПокупателюСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
                ДокументРеализацииСсылка, "СчетНаОплатуПокупателю");

        Если СчетНаОплатуПокупателюСсылка.Пустая() Тогда
            Продолжить;
        КонецЕсли;

        РезультатФункции.Добавить(СчетНаОплатуПокупателюСсылка);
    КонецЦикла;

    Возврат РезультатФункции;
КонецФункции

&После ("ДобавитьКомандыПечати")
Процедура ГП_ДобавитьКомандыПечати(КомандыПечати)
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати = "Документ.КВП_ОтражениеНачисленийВРеглУчете";
    КомандаПечати.Идентификатор = "СчетЗаказ";
    КомандаПечати.Представление = НСтр("ru = 'Счет на оплату'");
    КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
    КомандаПечати.Порядок = 10;
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 23.09.2024 [F00228749] Формирование счета на оплату ++
