// Гарант+ Килипенко 21.03.2025 [F00236141] Приоритетное погашение долга закрытых л/с ++ {
#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  - Структура
//      * ТолькоДействующиеЛицевыеСчета - Булево
Функция НовыйСтруктураДополнительныхПараметровРаспределения() Экспорт
    РезультатФункции = Новый Структура;

    РезультатФункции = Новый Структура;
    РезультатФункции.Вставить("ТолькоДействующиеЛицевыеСчета", Ложь);

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
// Гарант+ Килипенко 21.03.2025 [F00236141] Приоритетное погашение долга закрытых л/с -- }
