// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 ++
#Область ОбработчикиКомандФормы

// Выполняет создание новых контрагентов (абонентов) по данным из регистра ГП_КонтрагентыБП77.
//  Создаются только контрагенты для которых не найдены лицевые счета (т.е. выполняется перенос контрагентов
//  из БП77 но только тех контрагентов которые не были перенесены ранее собственными силами клиента)
&НаКлиенте
Асинх Процедура СоздатьАбонентовДляНесвязанныхЗаписей(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнена операция создания контрагентов (абонентов)"
            + " для лицевых счетов созданных автоматически по данным БП 7.7.");
    Если РезультатДиалога = Ложь Тогда
        Возврат; // Пользователь отказался от выполнения операции
    КонецЕсли;

    // Создание объектов контрагентов (абонентов)
    РезультатОбновления = СоздатьАбонентовДляНесвязанныхЗаписейНаСервере();

    // Вывод сообщения о результате
    ТекстСообщенияРезультатОперации = "";
    Если РезультатОбновления.Успех = Ложь Тогда
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание контрагентов не выполнено.
                |Сообщение о причине: %1", РезультатОбновления.ТекстСообщения);
    Иначе
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание контрагентов выполнено успешно.
                |Создано ""%1"" контрагентов (абонентов).", РезультатОбновления.СозданныеКонтрагенты.Количество());
    КонецЕсли;
    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРезультатОперации);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 --

// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 ++
#Область СлужебныеПроцедурыИФункции

// Создает новые объекты Контрагентов (типа абонент) по данным из регистра ГП_КонтрагентыБП77.
//  Создаются только контрагенты для которых не найдены лицевые счета (т.е. выполняется перенос контрагентов
//  из БП77 но только тех контрагентов которые не были перенесены ранее собственными силами клиента)
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * СозданныеКонтрагенты - Массив из СправочникСсылка.Контрагенты
//      * ТекстСообщения - Строка, Неопределено
&НаСервереБезКонтекста
Функция СоздатьАбонентовДляНесвязанныхЗаписейНаСервере()
    Возврат ГП_МиграцияКонтрагентов.СоздатьАбонентовДляПеренесенныхЛицевыхСчетов();
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 --
