// Гарант+ Килипенко 16.08.2024 [F00226620] назначение тарифов ++
#Область ПрограммныйИнтерфейс

// Выполняет чтение данных тарифов объектов абонентов (из БП 7.7) из файла и записывает
//  данные в регистр `ГП_ТарифыОбъектовАбонентовБП77`
// Параметры:
//  ПараметрыЗагрузки - Структура
//      * ДвоичныеДанныеФайла - ДвоичныеДанные
//  АдресХранилища - Строка, Неопределено
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоЗаписанных - Число
//      * ТекстСообщения - Строка, Неопределено
//  - Неопределено
Функция ЗагрузитьДанныеТарифовОбъектовАбонентовВРегистр(ПараметрыЗагрузки, АдресХранилища = Неопределено) Экспорт
    РезультатФункции = Новый Структура("Успех, КоличествоЗаписанных, ТекстСообщения", Ложь, 0);

    // Чтение данных из файла XML
    РезультатЧтенияДанных = ГП_МиграцияОбщегоНазначения.ПрочитатьДанныеИзФайлаXML(
            ПараметрыЗагрузки.ДвоичныеДанныеФайла, "ТарифОбъектаАбонента");
    Если РезультатЧтенияДанных.Успех = Ложь Тогда
        РезультатФункции.ТекстСообщения = РезультатЧтенияДанных.ТекстСообщения;
        Возврат ГП_МиграцияОбщегоНазначения.ПоместитьВХранилищеИВернуть(РезультатФункции, АдресХранилища);
    КонецЕсли;

    // Проверка структуры данных
    Если ТипЗнч(РезультатЧтенияДанных.Данные) <> Тип("СписокXDTO") Тогда
        РезультатФункции.ТекстСообщения = "Ошибка структуры данных.";
        Возврат ГП_МиграцияОбщегоНазначения.ПоместитьВХранилищеИВернуть(РезультатФункции, АдресХранилища);
    КонецЕсли;

    // Запись данных в регистр
    ТарифыОбъектовАбонентовБП77 = РезультатЧтенияДанных.Данные;
    РезультатЗаписи = ЗаписатьДанныеТарифовОбъектовАбонентовВРегистр(ТарифыОбъектовАбонентовБП77);

    // Формирование результата
    РезультатФункции.Успех = РезультатЗаписи.Успех;
    РезультатФункции.ТекстСообщения = РезультатЗаписи.СообщениеОбОшибке;
    РезультатФункции.КоличествоЗаписанных = РезультатЗаписи.КоличествоЗаписанных;

    Возврат ГП_МиграцияОбщегоНазначения.ПоместитьВХранилищеИВернуть(РезультатФункции, АдресХранилища);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 16.08.2024 [F00226620] назначение тарифов --

// Гарант+ Килипенко 16.08.2024 [F00226620] назначение тарифов ++
#Область СлужебныйПрограммныйИнтерфейс

// Выполняет запись исходных данных тарифов объектов абонентов в регистр `ГП_ТарифыОбъектовАбонентовБП77` (по данным из БП77)
//  Существующие записи по отбору составного кода будут перезаписаны
// Параметры:
//  ИсходныеДанныеТарифовОбъектовАбонентов - Массив из Структура - Данные БП77
// Возвращаемое значение:
//  Структура:
//      * Успех - Булево
//      * КоличествоЗаписанных - Число
//      * СообщениеОбОшибке - Строка, Неопределено
Функция ЗаписатьДанныеТарифовОбъектовАбонентовВРегистр(Знач ИсходныеДанныеТарифовОбъектовАбонентов) Экспорт
    РезультатФункции = Новый Структура(
            "Успех, КоличествоЗаписанных, СообщениеОбОшибке", Истина, 0);

    Если ИсходныеДанныеТарифовОбъектовАбонентов = Неопределено ИЛИ ИсходныеДанныеТарифовОбъектовАбонентов.Количество() = 0 Тогда
        Возврат РезультатФункции; // Нет данных
    КонецЕсли;

    // Поля для предобработки (приведения типов)
    КлючиЧисел = "ТарифВода,ТарифКанализация";

    // Транзакция записи в регистр
    НачатьТранзакцию();
    Попытка

        Для Каждого ТарифОбъектаАбонентаБП77 Из ИсходныеДанныеТарифовОбъектовАбонентов Цикл
            НаборЗаписейТарифовОбъектовАбонентов = СоздатьНаборЗаписейТарифовОбъектовАбонентовБП77(ТарифОбъектаАбонентаБП77);
            НоваяЗапись = НаборЗаписейТарифовОбъектовАбонентов.Добавить();

            // Заполнение данных
            ЗаполнитьЗначенияСвойств(НоваяЗапись, ТарифОбъектаАбонентаБП77, ,
                СтрШаблон("%1", КлючиЧисел));

            // Заполнение полей с преобразованием типов
            Для Каждого Ключ Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючиЧисел, ",", Ложь, Истина) Цикл
                НоваяЗапись[Ключ] = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТарифОбъектаАбонентаБП77[Ключ]);
            КонецЦикла;

            НаборЗаписейТарифовОбъектовАбонентов.Записать(Истина);
            РезультатФункции.КоличествоЗаписанных = РезультатФункции.КоличествоЗаписанных + 1;
        КонецЦикла;

        ЗафиксироватьТранзакцию(); // Записано успешно
    Исключение
        ОтменитьТранзакцию();

        ОбщаяЧастьСообщения = "Ошибка при загрузке данных тарифов объектов абонентов в регистр ""ГП_ТарифыОбъектовАбонентовБП77"".";
        СтруктураОшибки = ГП_МиграцияОбщегоНазначения.ЗаписатьОшибкуВЖурнал(
                ОбщаяЧастьСообщения, ИнформацияОбОшибке(), Ложь, Истина);

        РезультатФункции.Успех = Ложь;
        РезультатФункции.СообщениеОбОшибке = СтрШаблон(
                "%1
                |Информация об ошибке: %2",
                ОбщаяЧастьСообщения,
                СтруктураОшибки.КраткоеПредставлениеОшибки);

        РезультатФункции.КоличествоЗаписанных = 0;
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

// Параметры:
//  ТарифОбъектаАбонентаБП77 - Структура
//      * КонтрагентКод - Строка
//      * ОбъектАбонентаКод - Строка
// Возвращаемое значение:
//  - РегистрСведений.ГП_ТарифыОбъектовАбонентовБП77.НаборЗаписей
Функция СоздатьНаборЗаписейТарифовОбъектовАбонентовБП77(Знач ТарифОбъектаАбонентаБП77) Экспорт
    НаборЗаписей = РегистрыСведений.ГП_ТарифыОбъектовАбонентовБП77.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.КонтрагентКод.Установить(ТарифОбъектаАбонентаБП77.КонтрагентКод);
    НаборЗаписей.Отбор.ОбъектАбонентаКод.Установить(ТарифОбъектаАбонентаБП77.ОбъектАбонентаКод);

    Возврат НаборЗаписей;
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
// Гарант+ Килипенко 16.08.2024 [F00226620] назначение тарифов --
