// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область ПрограммныйИнтерфейс

// Заполняет значения признака `ЭтоНегативноеВоздействиеЦСВ` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
Функция ЗаполнитьПризнакНегативноеВоздействие() Экспорт
    РезультатФункции = Новый Структура("Успех, КоличествоИзмененныхСтрок, СообщениеОбОшибке", Истина, 0);

    НаборВсехЗаписейРегистра = РегистрыСведений.ГП_УслугиБП77.СоздатьНаборЗаписей();
    НаборВсехЗаписейРегистра.Прочитать();

    Для Каждого ТекущаяСтрока Из НаборВсехЗаписейРегистра Цикл
        ТекущееЗначениеЭтоНегативноеВоздействие = ТекущаяСтрока.ЭтоНегативноеВоздействиеЦСВ;
        ТекущаяСтрока.ЭтоНегативноеВоздействиеЦСВ =
            ГП_МиграцияПриборовУчета.ЭтоНаименованиеУслугиНегативногоВоздействия(
                ТекущаяСтрока.ОбъектАбонентаНаименование);

        Если ТекущееЗначениеЭтоНегативноеВоздействие <> ТекущаяСтрока.ЭтоНегативноеВоздействиеЦСВ Тогда
            РезультатФункции.КоличествоИзмененныхСтрок = РезультатФункции.КоличествоИзмененныхСтрок + 1;
        КонецЕсли;
    КонецЦикла;

    Попытка
        НаборВсехЗаписейРегистра.Записать();
    Исключение
        ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
            "Ошибка при записи в регистр сведений ""Услуги БП 7.7"" при обновлении значений признака негативного воздействия.",
            УровеньЖурналаРегистрации.Ошибка, , ,
            ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

        РезультатФункции.КоличествоИзмененныхСтрок = 0;
        РезультатФункции.СообщениеОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
        РезультатФункции.Успех = Ложь;
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --
