// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете ++
#Область ПереопределениеСтандартныхФункций

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьТабличнуюЧастьОтражениеНачисленийНаСервере")
Процедура ГП_ЗаполнитьТабличнуюЧастьОтражениеНачисленийНаСервере(ОбновитьСодержаниеТабличнойЧасти)

    ДокументОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.КВП_ОтражениеНачисленийВРеглУчете"));
    #Вставка
    // Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
    ДокументОбъект.ДополнительныеСвойства.Вставить("ГП_ЭтоЗаполнениеПоЛицевымСчетам",
        ЭтотОбъект.ГП_ДополнительныеСвойстваФормы.ГП_ЭтоЗаполнениеПоЛицевымСчетам);
    // Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете --
    #КонецВставки
    ДокументОбъект.ЗаполнитьТабличнуюЧастьОтражениеНачислений(ОбновитьСодержаниеТабличнойЧасти);
    #Вставка
    // Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
    ДокументОбъект.ДополнительныеСвойства.ГП_ЭтоЗаполнениеПоЛицевымСчетам = Ложь;
    // Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете --
    #КонецВставки
    ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры

// Гарант+ Килипенко 17.10.2024 [F00229783] Группировка отражения начислений в рег. учете без ном. групп ++
//
&НаКлиенте
&ИзменениеИКонтроль("ОбновитьОтборРасшифровкиНачислений")
Процедура ГП_ОбновитьОтборРасшифровкиНачислений()

    Упрощенный = (Объект.ВидОперации = 
    ПредопределенноеЗначение("Перечисление.КВП_ВидыОперацийОтраженияНачисленийВРеглУчете.ОтражениеУпрощенное"));

    Если Упрощенный Тогда
        ТекСтрока = Элементы.КонтрагентыУпр.ТекущиеДанные;
    Иначе
        ТекСтрока = Элементы.Контрагенты.ТекущиеДанные;
    КонецЕсли;

    Если Не ТекСтрока = Неопределено Тогда

        // Установим отбор в таблице расшифровки.
        СтруктураОтбора = Новый ФиксированнаяСтруктура("ДоговорКонтрагента, НоменклатурнаяГруппа, ЭтоКапРемонт, ЭтоЛьгота,
        |ЭтоПени, ВариантПоставкиУслуг, ЭтоРеализация",
        ТекСтрока.ДоговорКонтрагента,
        ТекСтрока.НоменклатурнаяГруппа,
        ТекСтрока.ЭтоКапРемонт,
        ТекСтрока.ЭтоЛьгота,
        ТекСтрока.ЭтоПени,
        ТекСтрока.ВариантПоставкиУслуг,
        ТекСтрока.ЭтоРеализация);
        #Вставка // Гарант+ Килипенко 17.10.2024 [F00229783] Группировка отражения начислений в рег. учете без ном. групп ++
        
        Если ЗначениеЗаполнено(ТекСтрока.НоменклатурнаяГруппа) = Ложь Тогда
            // Исключение Номенклатурной группы из отбора строк расшифровки
            СтруктураОтбора = Новый Структура(СтруктураОтбора);
            СтруктураОтбора.Удалить("НоменклатурнаяГруппа");
            СтруктураОтбора = Новый ФиксированнаяСтруктура(СтруктураОтбора);
        КонецЕсли;
        
        #КонецВставки // Гарант+ Килипенко 17.10.2024 [F00229783] Группировка отражения начислений в рег. учете без ном. групп --
        Если Упрощенный Тогда
            Элементы.РасшифровкаНачисленийУпр.ОтборСтрок = СтруктураОтбора;
        Иначе
            Элементы.РасшифровкаНачислений.ОтборСтрок = СтруктураОтбора;
        КонецЕсли;

        // Обновим итоги в подвале таблицы
        СуммаРасшифровки = 0;

        СтруктураОтбора = Новый Структура;
        СтруктураОтбора.Вставить("ДоговорКонтрагента",   ТекСтрока.ДоговорКонтрагента);
        СтруктураОтбора.Вставить("НоменклатурнаяГруппа", ТекСтрока.НоменклатурнаяГруппа);
        СтруктураОтбора.Вставить("ЭтоКапРемонт",         ТекСтрока.ЭтоКапРемонт);
        СтруктураОтбора.Вставить("ЭтоЛьгота",            ТекСтрока.ЭтоЛьгота);
        СтруктураОтбора.Вставить("ЭтоПени",              ТекСтрока.ЭтоПени);
        СтруктураОтбора.Вставить("ВариантПоставкиУслуг", ТекСтрока.ВариантПоставкиУслуг);
        СтруктураОтбора.Вставить("ЭтоРеализация",        ТекСтрока.ЭтоРеализация);
        #Вставка // Гарант+ Килипенко 17.10.2024 [F00229783] Группировка отражения начислений в рег. учете без ном. групп ++
        
        Если ЗначениеЗаполнено(ТекСтрока.НоменклатурнаяГруппа) = Ложь Тогда
            // Исключение Номенклатурной группы из отбора строк расшифровки
            СтруктураОтбора.Удалить("НоменклатурнаяГруппа");
        КонецЕсли;
        
        #КонецВставки // Гарант+ Килипенко 17.10.2024 [F00229783] Группировка отражения начислений в рег. учете без ном. групп --

        СтрокиРасшифровки = Объект.РасшифровкаНачислений.НайтиСтроки(СтруктураОтбора);

        Для Каждого ТекСтрокаРасшифровки Из СтрокиРасшифровки Цикл
            СуммаРасшифровки = СуммаРасшифровки + ТекСтрокаРасшифровки.СуммаОтражения;
        КонецЦикла;

        СуммаИтогоСуммаОтраженияРасшифровки = СуммаРасшифровки;

    КонецЕсли;

КонецПроцедуры // Гарант+ Килипенко 17.10.2024 [F00229783] Группировка отражения начислений в рег. учете без ном. групп --

// Гарант+ Килипенко 17.10.2024 [F00229783] Группировка отражения начислений в рег. учете без ном. групп ++
//
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьСуммуОтраженияВСтроке")
Процедура ГП_ЗаполнитьСуммуОтраженияВСтроке(ТекущаяСтрока)

    ДанныеСтроки = Объект.Контрагенты.НайтиПоИдентификатору(ТекущаяСтрока);

    СтруктураПоиска = Новый Структура;
    СтруктураПоиска.Вставить("ВариантПоставкиУслуг", ДанныеСтроки.ВариантПоставкиУслуг);
    СтруктураПоиска.Вставить("ДоговорКонтрагента",   ДанныеСтроки.ДоговорКонтрагента);
    СтруктураПоиска.Вставить("НоменклатурнаяГруппа", ДанныеСтроки.НоменклатурнаяГруппа);
    СтруктураПоиска.Вставить("ЭтоЛьгота",            ДанныеСтроки.ЭтоЛьгота);
    СтруктураПоиска.Вставить("ЭтоПени",              ДанныеСтроки.ЭтоПени);
    СтруктураПоиска.Вставить("ЭтоКапРемонт",         ДанныеСтроки.ЭтоКапРемонт);
    СтруктураПоиска.Вставить("ЭтоРеализация",        ДанныеСтроки.ЭтоРеализация);
    #Вставка // Гарант+ Килипенко 17.10.2024 [F00229783] Группировка отражения начислений в рег. учете без ном. групп ++
    
    Если ЗначениеЗаполнено(ДанныеСтроки.НоменклатурнаяГруппа) = Ложь Тогда
        // Исключение Номенклатурной группы из отбора строк расшифровки
        СтруктураПоиска.Удалить("НоменклатурнаяГруппа");
    КонецЕсли;
    
    #КонецВставки // Гарант+ Килипенко 17.10.2024 [F00229783] Группировка отражения начислений в рег. учете без ном. групп --

    СтрокиРасшифровки = Объект.РасшифровкаНачислений.НайтиСтроки(СтруктураПоиска);

    СуммаОтражения = 0;

    Для Каждого ТекСтрокаРасшифровки Из СтрокиРасшифровки Цикл
        СуммаОтражения = СуммаОтражения + ТекСтрокаРасшифровки.СуммаОтражения;
    КонецЦикла;

    ДанныеСтроки.СуммаОтражения = СуммаОтражения;

КонецПроцедуры // Гарант+ Килипенко 17.10.2024 [F00229783] Группировка отражения начислений в рег. учете без ном. групп --

#КонецОбласти // ПереопределениеСтандартныхФункций
// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете --

// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
    // Создание дополнительных реквизитов
    ГП_СоздатьРеквизитДополнительныеСвойстваФормыНаСервере();

    // Создание элементов формы
    ГП_СоздатьКомандуЗаполнитьПоЛицевымСчетамНаСервере();
    ГП_СоздатьЭлементФормыРасшифровкаНачисленийЛицевойСчетНаСервере();

    // Инициализация значений дополнительных реквизитов
    ГП_УстановитьЗначениеДополнительныхСвойствНаСервере("ГП_ЭтоЗаполнениеПоЛицевымСчетам", Ложь);

    ЭтоНовыйДокументКопирования = Объект.Ссылка.Пустая()
        И (ЭтотОбъект.Параметры.Свойство("ЗначениеКопирования") = Ложь
            ИЛИ ЗначениеЗаполнено(ЭтотОбъект.Параметры.ЗначениеКопирования));
    Если Отказ ИЛИ ЭтоНовыйДокументКопирования Тогда
        Возврат;
    КонецЕсли;

    // Заполнение шапки документа по данным документа Начисления услуг
    ГП_ЗаполнитьНаОснованииДокументаНачисленияУслугНаСервере("ВидОперации");
КонецПроцедуры

&НаСервере
Процедура ГП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    // Заполнение шапки документа по данным документа Начисления услуг
    ГП_ЗаполнитьНаОснованииДокументаНачисленияУслугНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете --

// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете ++
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ГП_ЗаполнитьПоЛицевымСчетамПриНажатии(Команда)
    ГП_УстановитьЗначениеДополнительныхСвойствНаСервере("ГП_ЭтоЗаполнениеПоЛицевымСчетам", Истина);
    Заполнить(Команда);
    // ГП_УстановитьЗначениеДополнительныхСвойствНаСервере("ГП_ЭтоЗаполнениеПоЛицевымСчетам", Ложь);
КонецПроцедуры

&НаКлиенте
&После("ЗаполнитьПродолжение")
Процедура ГП_ЗаполнитьПродолжение(ОбновитьСодержаниеТабличнойЧасти)
    ГП_УстановитьЗначениеДополнительныхСвойствНаСервере("ГП_ЭтоЗаполнениеПоЛицевымСчетам", Ложь);
КонецПроцедуры

&НаКлиенте
&Перед("ЗаполнитьЗавершение")
Процедура ГП_ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры)
    Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		ГП_УстановитьЗначениеДополнительныхСвойствНаСервере("ГП_ЭтоЗаполнениеПоЛицевымСчетам", Ложь);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете --

// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

&НаСервере
Функция ГП_ЗаполнитьНаОснованииДокументаНачисленияУслугНаСервере(Знач ПоляЗаполнения = Неопределено)
    РезультатФункции = Новый Структура("Успех", Истина);

    Если ГП_ЭтоНовыйДокументНаОснованииНачисленияУслугНаСервере() = Ложь Тогда
        РезультатФункции.Успех = Ложь;
        Возврат РезультатФункции; // Нет данных для заполнения
    КонецЕсли;

    ЗаполнитьЗначенияСвойств(ЭтотОбъект.Объект, ЭтотОбъект.Параметры.ГП_ДанныеЗаполненияПоНачислениям, ПоляЗаполнения);

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ЗаполнениеДокумента

// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете ++
#Область СозданиеЭлементовФормы

&НаСервере
Функция ГП_СоздатьКомандуЗаполнитьПоЛицевымСчетамНаСервере()
    Результат = Новый Структура("Кнопка, Команда");

    // Создание команды формы
    Результат.Команда = ЭтотОбъект.Команды.Добавить("ГП_ЗаполнитьПоЛицевымСчетам");
    Результат.Команда.Заголовок = "Заполнить по л/с";
    Результат.Команда.Действие = "ГП_ЗаполнитьПоЛицевымСчетамПриНажатии";

    // Создание элемента формы
    Результат.Кнопка = ЭтотОбъект.Элементы.Вставить(
            "ГП_ЗаполнитьПоЛицевымСчетам",
            Тип("КнопкаФормы"),
            ЭтотОбъект.Элементы.КонтрагентыКоманднаяПанель,
            ЭтотОбъект.Элементы.КонтрагентыУпрЗаполнить1);
    Результат.Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
    Результат.Кнопка.ИмяКоманды = Результат.Команда.Имя;
    Результат.Кнопка.Видимость = Истина;

    Возврат Результат;
КонецФункции

&НаСервере
Функция ГП_СоздатьРеквизитДополнительныеСвойстваФормыНаСервере()
    ДобавляемыеРеквизиты = Новый Массив;

    РеквизитДополнительныеСвойстваФормы = Новый РеквизитФормы(
            "ГП_ДополнительныеСвойстваФормы", Новый ОписаниеТипов(), "", "");
    ДобавляемыеРеквизиты.Добавить(РеквизитДополнительныеСвойстваФормы);

    ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

    Возврат РеквизитДополнительныеСвойстваФормы;
КонецФункции

&НаСервере
Функция ГП_СоздатьЭлементФормыРасшифровкаНачисленийЛицевойСчетНаСервере()
    Результат = ЭтотОбъект.Элементы.Вставить(
            "ГП_РасшифровкаНачисленийЛицевойСчет",
            Тип("ПолеФормы"),
            ЭтотОбъект.Элементы.РасшифровкаНачислений,
            ЭтотОбъект.Элементы.РасшифровкаНачисленийНоменклатура);
    Результат.Вид = ВидПоляФормы.ПолеВвода;
    Результат.ПутьКДанным = "Объект.РасшифровкаНачислений.lc_ЛицевойСчет";
    Результат.Видимость = Истина;

    Возврат Результат;
КонецФункции

#КонецОбласти // СозданиеЭлементовФормы
// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете --

&НаСервере
Процедура ГП_УстановитьЗначениеДополнительныхСвойствНаСервере(Знач Ключ, Знач Значение)
    Если ЭтотОбъект.ГП_ДополнительныеСвойстваФормы = Неопределено Тогда
        ЭтотОбъект.ГП_ДополнительныеСвойстваФормы = Новый Структура("ГП_ЭтоЗаполнениеПоЛицевымСчетам", Ложь);
    КонецЕсли;

    ЭтотОбъект.ГП_ДополнительныеСвойстваФормы.Вставить(Ключ, Значение);
КонецПроцедуры

&НаСервере
Функция ГП_ЭтоНовыйДокументНаОснованииНачисленияУслугНаСервере()
    ЭтоНовыйДокументНаОснованииНачисленияУслуг = Объект.Ссылка.Пустая()
        И ЭтотОбъект.Параметры.Свойство("ГП_ДанныеЗаполненияПоНачислениям");

    Возврат ЭтоНовыйДокументНаОснованииНачисленияУслуг;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете --
