// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете ++
#Область ПереопределениеСтандартныхФункций

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьТабличнуюЧастьОтражениеНачисленийНаСервере")
Процедура ГП_ЗаполнитьТабличнуюЧастьОтражениеНачисленийНаСервере(ОбновитьСодержаниеТабличнойЧасти)

    ДокументОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.КВП_ОтражениеНачисленийВРеглУчете"));
    #Вставка
    // Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
    ДокументОбъект.ДополнительныеСвойства.Вставить("ГП_ЭтоЗаполнениеПоЛицевымСчетам",
        ЭтотОбъект.ГП_ДополнительныеСвойстваФормы.ГП_ЭтоЗаполнениеПоЛицевымСчетам);
    // Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете --
    #КонецВставки
    ДокументОбъект.ЗаполнитьТабличнуюЧастьОтражениеНачислений(ОбновитьСодержаниеТабличнойЧасти);
    #Вставка
    // Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
    ДокументОбъект.ДополнительныеСвойства.ГП_ЭтоЗаполнениеПоЛицевымСчетам = Ложь;
    // Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете --
    #КонецВставки
    ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры

#КонецОбласти // ПереопределениеСтандартныхФункций
// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете --

// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
    // Создание дополнительных реквизитов
    ГП_СоздатьРеквизитДополнительныеСвойстваФормыНаСервере();

    // Создание элементов формы
    ГП_СоздатьКомандуЗаполнитьПоЛицевымСчетамНаСервере();

    // Инициализация значений дополнительных реквизитов
    ГП_УстановитьЗначениеДополнительныхСвойствНаСервере("ГП_ЭтоЗаполнениеПоЛицевымСчетам", Ложь);

    ЭтоНовыйДокументКопирования = Объект.Ссылка.Пустая()
        И (ЭтотОбъект.Параметры.Свойство("ЗначениеКопирования") = Ложь
            ИЛИ ЗначениеЗаполнено(ЭтотОбъект.Параметры.ЗначениеКопирования));
    Если Отказ ИЛИ ЭтоНовыйДокументКопирования Тогда
        Возврат;
    КонецЕсли;

    // Заполнение шапки документа по данным документа Начисления услуг
    ГП_ЗаполнитьНаОснованииДокументаНачисленияУслугНаСервере("ВидОперации");
КонецПроцедуры

&НаСервере
Процедура ГП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    // Заполнение шапки документа по данным документа Начисления услуг
    ГП_ЗаполнитьНаОснованииДокументаНачисленияУслугНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете --

// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете ++
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ГП_ЗаполнитьПоЛицевымСчетамПриНажатии(Команда)
    ГП_УстановитьЗначениеДополнительныхСвойствНаСервере("ГП_ЭтоЗаполнениеПоЛицевымСчетам", Истина);
    Заполнить(Команда);
    // ГП_УстановитьЗначениеДополнительныхСвойствНаСервере("ГП_ЭтоЗаполнениеПоЛицевымСчетам", Ложь);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете --

// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

&НаСервере
Функция ГП_ЗаполнитьНаОснованииДокументаНачисленияУслугНаСервере(Знач ПоляЗаполнения = Неопределено)
    РезультатФункции = Новый Структура("Успех", Истина);

    Если ГП_ЭтоНовыйДокументНаОснованииНачисленияУслугНаСервере() = Ложь Тогда
        РезультатФункции.Успех = Ложь;
        Возврат РезультатФункции; // Нет данных для заполнения
    КонецЕсли;

    ЗаполнитьЗначенияСвойств(ЭтотОбъект.Объект, ЭтотОбъект.Параметры.ГП_ДанныеЗаполненияПоНачислениям, ПоляЗаполнения);

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ЗаполнениеДокумента

// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете ++
#Область СозданиеЭлементовФормы

&НаСервере
Функция ГП_СоздатьКомандуЗаполнитьПоЛицевымСчетамНаСервере()
    Результат = Новый Структура("Кнопка, Команда");

    // Создание команды формы
    Результат.Команда = ЭтотОбъект.Команды.Добавить("ГП_ЗаполнитьПоЛицевымСчетам");
    Результат.Команда.Заголовок = "Заполнить по л/с";
    Результат.Команда.Действие = "ГП_ЗаполнитьПоЛицевымСчетамПриНажатии";

    // Создание элемента формы
    Результат.Кнопка = ЭтотОбъект.Элементы.Добавить(
            "ГП_ЗаполнитьПоЛицевымСчетам",
            Тип("КнопкаФормы"),
            ЭтотОбъект.Элементы.КонтрагентыКоманднаяПанель);
    Результат.Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
    Результат.Кнопка.ИмяКоманды = Результат.Команда.Имя;
    Результат.Кнопка.Видимость = Истина;

    Возврат Результат;
КонецФункции

&НаСервере
Функция ГП_СоздатьРеквизитДополнительныеСвойстваФормыНаСервере()
    ДобавляемыеРеквизиты = Новый Массив;

    РеквизитДополнительныеСвойстваФормы = Новый РеквизитФормы(
            "ГП_ДополнительныеСвойстваФормы", Новый ОписаниеТипов(), "", "");
    ДобавляемыеРеквизиты.Добавить(РеквизитДополнительныеСвойстваФормы);

    ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

    Возврат РеквизитДополнительныеСвойстваФормы;
КонецФункции

#КонецОбласти // СозданиеЭлементовФормы
// Гарант+ Килипенко 19.09.2024 [F00228718] Доработка заполнения отражения начислений в рег. учете --

&НаСервере
Процедура ГП_УстановитьЗначениеДополнительныхСвойствНаСервере(Знач Ключ, Знач Значение)
    Если ЭтотОбъект.ГП_ДополнительныеСвойстваФормы = Неопределено Тогда
        ЭтотОбъект.ГП_ДополнительныеСвойстваФормы = Новый Структура("ГП_ЭтоЗаполнениеПоЛицевымСчетам", Ложь);
    КонецЕсли;

    ЭтотОбъект.ГП_ДополнительныеСвойстваФормы.Вставить(Ключ, Значение);
КонецПроцедуры

&НаСервере
Функция ГП_ЭтоНовыйДокументНаОснованииНачисленияУслугНаСервере()
    ЭтоНовыйДокументНаОснованииНачисленияУслуг = Объект.Ссылка.Пустая()
        И ЭтотОбъект.Параметры.Свойство("ГП_ДанныеЗаполненияПоНачислениям");

    Возврат ЭтоНовыйДокументНаОснованииНачисленияУслуг;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете --
