// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    // Добавление полей формы
    ГП_ДобавитьДополнительныеЭлементыФормыНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --

// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область СлужебныеПроцедурыИФункции

#Область ГП_СозданиеЭлементовФормы

&НаСервере
Процедура ГП_ДобавитьДополнительныеЭлементыФормыНаСервере()
    ГП_ДобавитьЭлементФормыДатаУстановкиНаСервере();
    ГП_ДобавитьЭлементФормыСоставнойКодБП77НаСервере();
    ГП_ДобавитьЭлементФормыТолькоДляКанализацииНаСервере();
    ГП_ДобавитьЭлементФормыКомментарийНаСервере();
КонецПроцедуры

// Добавляет поле формы ГП_ДатаУстановки
// Возвращаемое значение:
//  - ПолеФормы
&НаСервере
Функция ГП_ДобавитьЭлементФормыДатаУстановкиНаСервере()
    НовыйЭлементФормы = ГП_ДобавитьПолеФормыНаСервере(
            "ГП_ДатаУстановки", "Объект.ГП_ДатаУстановки", ЭтотОбъект.Элементы.ГруппаПоверка);

    Возврат НовыйЭлементФормы;
КонецФункции

// Добавляет поле формы ГП_ИдентификаторБП77
// Возвращаемое значение:
//  - ПолеФормы
&НаСервере
Функция ГП_ДобавитьЭлементФормыСоставнойКодБП77НаСервере()
    НовыйЭлементФормы = ГП_ДобавитьПолеФормыНаСервере(
            "ГП_ИдентификаторБП77", "Объект.ГП_ИдентификаторБП77", ЭтотОбъект.Элементы.ГруппаОбщиеСведения);
    НовыйЭлементФормы.ТолькоПросмотр = Истина;
    НовыйЭлементФормы.Видимость = ЗначениеЗаполнено(ЭтотОбъект.Объект.ГП_ИдентификаторБП77);

    Возврат НовыйЭлементФормы;
КонецФункции

// Добавляет поле формы ГП_Комментарий
// Возвращаемое значение:
//  - ПолеФормы
&НаСервере
Функция ГП_ДобавитьЭлементФормыКомментарийНаСервере()
    НовыйЭлементФормы = ГП_ДобавитьПолеФормыНаСервере(
            "ГП_Комментарий", "Объект.ГП_Комментарий", ЭтотОбъект.Элементы.ГруппаОбщиеСведения);

    Возврат НовыйЭлементФормы;
КонецФункции

// Добавляет поле формы ГП_ТолькоДляКанализации
// Возвращаемое значение:
//  - ПолеФормы
&НаСервере
Функция ГП_ДобавитьЭлементФормыТолькоДляКанализацииНаСервере()
    НовыйЭлементФормы = ГП_ДобавитьПолеФормыНаСервере(
            "ГП_ТолькоДляКанализации", "Объект.ГП_ТолькоДляКанализации", ЭтотОбъект.Элементы.ГруппаОбщиеСведения);

    НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
    
    Возврат НовыйЭлементФормы;
КонецФункции

// Параметры:
//  Имя - Строка
//  Путь - Строка
//  Родитель - ГруппаФормы, ТаблицаФормы, ФормаКлиентскогоПриложения, Неопределено
// Возвращаемое значение:
//  - ПолеФормы
&НаСервере
Функция ГП_ДобавитьПолеФормыНаСервере(Знач Имя, Знач Путь, Знач Родитель = Неопределено)
    НовыйЭлементФормы = Неопределено;
    Если Родитель <> Неопределено Тогда
        НовыйЭлементФормы = ЭтотОбъект.Элементы.Добавить(Имя, Тип("ПолеФормы"), Родитель);
    Иначе
        НовыйЭлементФормы = ЭтотОбъект.Элементы.Добавить(Имя, Тип("ПолеФормы"));
    КонецЕсли;

    НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
    НовыйЭлементФормы.ПутьКДанным = Путь;
    НовыйЭлементФормы.АвтоОтметкаНезаполненного = Ложь;
    НовыйЭлементФормы.Видимость = Истина;

    Возврат НовыйЭлементФормы;
КонецФункции

#КонецОбласти // ГП_СозданиеЭлементовФормы

#КонецОбласти // СлужебныеПроцедурыИФункции
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --
