// Гарант+ Килипенко 01.10.2024 [F00228899] Формирование комментария со списком договоров док. ввода показаний ++
#Область ОбработчикиСобытий

&После ("ПередЗаписью")
Процедура ГП_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    ПрефиксСпискаДоговоров = "#";

    Если Отказ
        ИЛИ (ПустаяСтрока(ЭтотОбъект.Комментарий) = Ложь И СтрНачинаетсяС(ЭтотОбъект.Комментарий, ПрефиксСпискаДоговоров) = Ложь) Тогда
        Возврат; // Если комментарий заполнен пользователем - тогда не формируем список
    КонецЕсли;

    КоллекцияСчетчиковФормирования = ГП_ПолучитьКоллекциюСчетчиковДокумента();
    СтрокаСпискаДоговоров = ГП_ПриборыУчета.СформироватьСтрокуСпискаДоговоровПоПУ(КоллекцияСчетчиковФормирования);
    Если СтрокаСпискаДоговоров = Неопределено Тогда
        Возврат; // Список не сформирован
    КонецЕсли;

    // Записываем в комментарий список договоров счетчиков
    ЭтотОбъект.Комментарий = СтрШаблон("%1 %2", ПрефиксСпискаДоговоров, СтрокаСпискаДоговоров);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
// Гарант+ Килипенко 01.10.2024 [F00228899] Формирование комментария со списком договоров док. ввода показаний --

// Гарант+ Килипенко 01.10.2024 [F00228899] Формирование комментария со списком договоров док. ввода показаний ++
#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  - Строка
Функция ГП_ПолучитьКоллекциюСчетчиковДокумента()
    МассивПУ = Новый Массив;
    Для Каждого СтрокаГлавная Из ЭтотОбъект.Главная Цикл
        Если СтрокаГлавная.Счетчик = Справочники.КВП_Счетчики.ПустаяСсылка() Тогда
            Продолжить;
        КонецЕсли;

        МассивПУ.Добавить(СтрокаГлавная.Счетчик);
    КонецЦикла;

    Возврат МассивПУ;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 01.10.2024 [F00228899] Формирование комментария со списком договоров док. ввода показаний --
