// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
#Область ПрограммныйИнтерфейс

// Параметры:
//  ДокументНачисленияУслугСсылка - ДокументСсылка.КВП_НачислениеУслуг
// Возвращаемое значение:
//  ТаблицаЗначений
//      * Контрагент - СправочникСсылка.Контрагенты
//      * Договор - СправочникСсылка.ДоговорыКонтрагентов
//      * НомерСтроки - Число
Функция ПолучитьКонтрагентовПриборовУчетаДокумента(Знач ДокументНачисленияУслугСсылка) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	НачисленияУслугиПоПоказаниямПУ.ЛицевойСчет КАК ЛицевойСчет,
        |	НачисленияУслугиПоПоказаниямПУ.Договор КАК Договор,
        |	НачисленияУслугиПоПоказаниямПУ.Договор.Владелец КАК Контрагент,
        |	МИНИМУМ(НачисленияУслугиПоПоказаниямПУ.НомерСтроки) КАК НомерСтроки
        |ПОМЕСТИТЬ ВТ_КонтрагентыЛицевыхСчетов
        |ИЗ
        |	Документ.КВП_НачислениеУслуг.УслугиПоПоказаниямПУ КАК НачисленияУслугиПоПоказаниямПУ
        |ГДЕ
        |	НачисленияУслугиПоПоказаниямПУ.Ссылка = &ДокументНачисленияУслугСсылка
        |
        |СГРУППИРОВАТЬ ПО
        |	НачисленияУслугиПоПоказаниямПУ.ЛицевойСчет,
        |	НачисленияУслугиПоПоказаниямПУ.Договор,
        |	НачисленияУслугиПоПоказаниямПУ.Договор.Владелец
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	МИНИМУМ(ВТ_КонтрагентыЛицевыхСчетов.НомерСтроки) КАК НомерСтроки,
        |	ВТ_КонтрагентыЛицевыхСчетов.Контрагент КАК Контрагент,
        |	ВТ_КонтрагентыЛицевыхСчетов.Договор КАК Договор
        |ИЗ
        |	ВТ_КонтрагентыЛицевыхСчетов КАК ВТ_КонтрагентыЛицевыхСчетов
        |
        |СГРУППИРОВАТЬ ПО
        |	ВТ_КонтрагентыЛицевыхСчетов.Контрагент,
        |	ВТ_КонтрагентыЛицевыхСчетов.Договор
        |
        |УПОРЯДОЧИТЬ ПО
        |	НомерСтроки
        |";

    Запрос.УстановитьПараметр("ДокументНачисленияУслугСсылка", ДокументНачисленияУслугСсылка);
    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 18.09.2024 [F00228484] Доработка отражения в рег учете ++
