// Гарант+ Килипенко 11.09.2024 [F00227694] Доработка документа ввод показаний счетчика ++
#Область ПрограммныйИнтерфейс

// Параметры:
//  ЛицевойСчет - СправочникСсылка.КВП_ЛицевыеСчета
//  ТолькоДействующие - Булево, Неопределено - По умолчанию Истина
// Возвращаемое значение:
//  - ТаблицаЗначений
//      * ПриборУчета - СправочникСсылка.КВП_Счетчики
//      * Действует - Булево
//      * ДатаНачала - Дата
//      * ДатаПоверки - Дата
//      * НомерПломбы - Строка
//      * ПричинаОтключения - ПеречислениеСсылка.УПЖКХ_ПричиныОтключенияПриборовУчета
Функция ПолучитьПриборыУчетаДоговораПоЛицевомуСчету(Знач ЛицевойСчет, Знач ТолькоДействующие = Неопределено) Экспорт
    ТолькоДействующие = ?(ТолькоДействующие = Неопределено, Истина, ТолькоДействующие);

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	СведенияДляВзаиморасчетовПоЛС.Договор КАК Договор,
        |	СведенияДляВзаиморасчетовПоЛС.Контрагент КАК Контрагент
        |ПОМЕСТИТЬ ВТ_ДоговорыЛС
        |ИЗ
        |	РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК СведенияДляВзаиморасчетовПоЛС
        |ГДЕ
        |	СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет = &ЛицевойСчет
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |	СведенияДляВзаиморасчетовПоЛС.Период КАК Период,
        |	СведенияДляВзаиморасчетовПоЛС.Регистратор КАК Регистратор,
        |	СведенияДляВзаиморасчетовПоЛС.НомерСтроки КАК НомерСтроки,
        |	СведенияДляВзаиморасчетовПоЛС.Организация КАК Организация,
        |	СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет КАК ЛицевойСчет,
        |	СведенияДляВзаиморасчетовПоЛС.Договор КАК Договор,
        |	СведенияДляВзаиморасчетовПоЛС.Контрагент КАК Контрагент,
        |ПОМЕСТИТЬ ВТ_ЛицевыеСчетаДоговора
        |ИЗ
        |	РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС.СрезПоследних КАК СведенияДляВзаиморасчетовПоЛС
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДоговорыЛС КАК ВТ_ДоговорыЛС
        |		ПО СведенияДляВзаиморасчетовПоЛС.Договор = ВТ_ДоговорыЛС.Договор
        |			И СведенияДляВзаиморасчетовПоЛС.Контрагент = ВТ_ДоговорыЛС.Контрагент
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ИсторияСостоянийПриборовУчета.Период КАК Период,
        |	ИсторияСостоянийПриборовУчета.Регистратор КАК Регистратор,
        |	ИсторияСостоянийПриборовУчета.НомерСтроки КАК НомерСтроки,
        |	ИсторияСостоянийПриборовУчета.Объект КАК Объект,
        |	ИсторияСостоянийПриборовУчета.ПриборУчета КАК ПриборУчета,
        |	ИсторияСостоянийПриборовУчета.Действует КАК Действует,
        |	ИсторияСостоянийПриборовУчета.ДатаНачала КАК ДатаНачала,
        |	ИсторияСостоянийПриборовУчета.ДатаПоверки КАК ДатаПоверки,
        |	ИсторияСостоянийПриборовУчета.НомерПломбы КАК НомерПломбы,
        |	ИсторияСостоянийПриборовУчета.ПричинаОтключения КАК ПричинаОтключения
        |ИЗ
        |	РегистрСведений.УПЖКХ_ИсторияСостоянийПриборовУчета.СрезПоследних КАК ИсторияСостоянийПриборовУчета
        |ГДЕ
        |	ИсторияСостоянийПриборовУчета.Объект В
        |			(ВЫБРАТЬ
        |				ВТ_ЛицевыеСчетаДоговора.ЛицевойСчет
        |			ИЗ
        |				ВТ_ЛицевыеСчетаДоговора)
        |   И ИсторияСостоянийПриборовУчета.Действует = ИСТИНА
        |";

    Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
    Если ТолькоДействующие = Ложь Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИсторияСостоянийПриборовУчета.Действует = ИСТИНА", "");
    КонецЕсли;

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 11.09.2024 [F00227694] Доработка документа ввод показаний счетчика --
