#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьНоменклатурнуюГруппуВодоснабжение() Экспорт
    Возврат ПолучитьНоменклатурнуюГруппуПоКоду("0000001", Истина);
КонецФункции

// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьНоменклатурнуюГруппуВодоотведение() Экспорт
    Возврат ПолучитьНоменклатурнуюГруппуПоКоду("0000002", Истина);
КонецФункции

// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьНоменклатурнуюГруппуНегативноеВоздействиеНаЦСВ() Экспорт
    Возврат ПолучитьНоменклатурнуюГруппуПоКоду("0000158", Истина);
КонецФункции

// Параметры:
//  Код - Строка
//  ИгнорироватьПомеченныеНаУдаление - Булево
// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьНоменклатурнуюГруппуПоКоду(Знач Код, Знач ИгнорироватьПомеченныеНаУдаление = Истина) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   НоменклатурныеГруппы.Ссылка КАК Ссылка,
        |   НоменклатурныеГруппы.Код КАК Код,
        |   НоменклатурныеГруппы.Наименование КАК Наименование
        |ИЗ
        |   Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
        |ГДЕ
        |   НоменклатурныеГруппы.Код = &Код
        |   И НоменклатурныеГруппы.ПометкаУдаления = ЛОЖЬ
        |";

    Запрос.УстановитьПараметр("Код", Код);
    Если ИгнорироватьПомеченныеНаУдаление = Ложь Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НоменклатурныеГруппы.ПометкаУдаления = ЛОЖЬ", "");
    КонецЕсли;

    РезультатЗапроса = Запрос.Выполнить();
    ТаблицаУслуг = РезультатЗапроса.Выгрузить();

    Если ТаблицаУслуг.Количество() <> 1 Тогда
        ВызватьИсключение(СтрШаблон("Ошибка при получении номенклатурной группы с кодом ""%1"". %2",
                Код,
                ?(ТаблицаУслуг.Количество() > 1, "Код номенклатурной группы не уникален.", "Номенклатурная группа отсутствует в ИБ.")));
    КонецЕсли;

    РезультатФункции = Новый Структура("Ссылка, Код, Наименование");
    ЗаполнитьЗначенияСвойств(РезультатФункции, ТаблицаУслуг[0]);

    Возврат РезультатФункции;
КонецФункции

// Возвращаемое значение:
//  - Соответствие
Функция ПолучитьСоответствиеПсевдонимовНоменклатурныхГрупп() Экспорт
    РезультатФункции = Новый Соответствие;

    РезультатФункции.Вставить(ПолучитьНоменклатурнуюГруппуНегативноеВоздействиеНаЦСВ().Ссылка, "Водоотведение");

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
