// Гарант+ Килипенко 17.09.2024 [F00228438] Вид тарифа потребителя для Установки тарифа ++
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СоздатьВидыТарифовПотребителей(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будут созданы элементы видов тарифов потребителей.");
    Если РезультатДиалога = Ложь Тогда
        Возврат; // Пользователь отказался от выполнения операции
    КонецЕсли;
    
    РезультатЗаполнения = СоздатьВидыТарифовПотребителейНаСервере();

    СообщениеПользователю = "";
    Если РезультатЗаполнения.Успех = Ложь Тогда
        СообщениеПользователю = СтрШаблон("Создание видов тарифов потребителей не выполнено.
                |Информация о проблеме: %1", РезультатЗаполнения.ТекстСообщения);
    Иначе
        СообщениеПользователю = СтрШаблон("Создание видов тарифов потребителей выполнено успешно.
                |Создано ""%1"" новых элементов",
                РезультатЗаполнения.СозданныеЭлементы.Количество());
    КонецЕсли;

    ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// Гарант+ Килипенко 17.09.2024 [F00228438] Вид тарифа потребителя для Установки тарифа --

// Гарант+ Килипенко 17.09.2024 [F00228438] Вид тарифа потребителя для Установки тарифа ++
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СоздатьВидыТарифовПотребителейНаСервере()
    Возврат ГП_МиграцияТарифовАбонентов.СоздатьВидыТарифовПотребителей();
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 17.09.2024 [F00228438] Вид тарифа потребителя для Установки тарифа --
