// Гарант+ Килипенко 07.04.2025 [F00237150] Доработка шапки чека ++ {
#Область ПереопределениеСтандартногоФункционала

&Вместо("ПараметрыОперацииФискализацииЧека")
Функция ГП_ПараметрыОперацииФискализацииЧека(Реквизиты, ДанныеПечатиЧека, ВерсияФормата, АдресУстановкиККТ, СообщениеОбОшибке)
    ОбщиеПараметры = ПродолжитьВызов(Реквизиты, ДанныеПечатиЧека, ВерсияФормата, АдресУстановкиККТ, СообщениеОбОшибке);
    
    // Гарант+ Килипенко 07.04.2025 [F00237150] Доработка шапки чека ++ {
    
    // По ТЗ - установка приоритета ФактическийАдрес
    СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Организация, Реквизиты.Дата);
    ОбщиеПараметры.АдресМагазина = ?(ПустаяСтрока(СведенияОбОрганизации.ФактическийАдрес), АдресУстановкиККТ, СведенияОбОрганизации.ФактическийАдрес);
    
    // Гарант+ Килипенко 07.04.2025 [F00237150] Доработка шапки чека -- }

    Возврат ОбщиеПараметры;
КонецФункции

#КонецОбласти // ПереопределениеСтандартногоФункционала
// Гарант+ Килипенко 07.04.2025 [F00237150] Доработка шапки чека -- }
