// Гарант+ Килипенко 10.09.2024 [F00227690] Заполнение динамических показателей ++
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
&После ("ОбновитьПодчиненныеТаблицы")
Процедура ГП_ОбновитьПодчиненныеТаблицы()
    ЛицевойСчетОпределен = ?(ЭтотОбъект.мЗначениеОтбора = Неопределено ИЛИ ЭтотОбъект.мЗначениеОтбора.Пустая(),
            Ложь, Истина);
    ТекСтраница = Элементы.ПанельДополнительнойИнформации.ТекущаяСтраница;
    Если ТекСтраница <> ЭтотОбъект.Элементы.ГП_ДинамическиеПоказатели ИЛИ ЛицевойСчетОпределен = Ложь Тогда
        Возврат;
    КонецЕсли;

    Если ЭтотОбъект.Элементы.Список.ТекущиеДанные = Неопределено Тогда
        ГП_ОчиститьТаблицуДинамическихПоказателей();
        Возврат;
    КонецЕсли;

    ГП_ОчиститьТаблицуДинамическихПоказателей();
    ГП_ОбновитьТаблицуДинамическихПоказателейНаСервере(ЭтотОбъект.мЗначениеОтбора);
КонецПроцедуры

&НаСервере
Процедура ГП_ОбновитьТаблицуДинамическихПоказателейНаСервере(Знач ЛицевойСчет)
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   Период,
        |   ПроцентВодоотведенияХВС,
        |   ПроцентВодоотведенияГВС,
        |   ВидПотребления,
        |   Финансирование,
        |   Водозабор,
        |   Договородержатель,
        |   Контролер,
        |   Характеристика
        |ИЗ
        |   РегистрСведений.lc_ДинамическиеПоказателиЛицевыхСчетов.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК ДинамическиеПоказателиЛицевыхСчетов
        |УПОРЯДОЧИТЬ ПО
        |   Период
        |";

    Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);

    РезультатЗапроса = Запрос.Выполнить();
    ТаблицаРезультата = РезультатЗапроса.Выгрузить();

    ЭтотОбъект.ГП_ТаблицаДинамическихПоказателей.Загрузить(ТаблицаРезультата);
КонецПроцедуры

&НаКлиенте
Процедура ГП_ОчиститьТаблицуДинамическихПоказателей()
    ЭтотОбъект.ГП_ТаблицаДинамическихПоказателей.Очистить();
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 10.09.2024 [F00227690] Заполнение динамических показателей --
