// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФайлДляЧтения(Команда)
    ПараметрыЗагрузкиФайлаJSON = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
    ПараметрыЗагрузкиФайлаJSON.Диалог.Заголовок = НСтр("ru = 'Выберите файл JSON для загрузки счетчиков'");
    ПараметрыЗагрузкиФайлаJSON.Диалог.Фильтр = НСтр("ru = 'Файлы JSON (*.json)|*.json'");
    ПараметрыЗагрузкиФайлаJSON.ИдентификаторФормы = ЭтотОбъект.УникальныйИдентификатор;
    ФайловаяСистемаКлиент.ЗагрузитьФайлы(Новый ОписаниеОповещения("ЗагрузкаФайлаЗавершение", ЭтотОбъект), ПараметрыЗагрузкиФайлаJSON);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСчетчики(Команда)
    Для каждого Файл Из ЭтотОбъект.ИнформацияОЗагруженныхФайлах Цикл
        ПрочитатьФайлJSONНаСервере(Файл.Хранение, ЭтотОбъект.УникальныйИдентификатор);
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --

// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПрочитатьФайлJSONНаСервере(Знач АдресФайла, Знач УникальныйИдентификатор)
    //ЧтениеJSON = Новый ЧтениеJSON()
    ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);

    ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("ДвоичныеДанныеФайла", ДвоичныеДанныеФайла);

    Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		Обработки.ГП_ЗагрузкаСчетчиковБП77.ЗагрузитьДанныеВИБ(ПараметрыВыгрузки, АдресХранилища);
		Результат = Новый Структура("ЗаданиеВыполнено", Истина);
	Иначе
		НаименованиеЗадания = НСтр("ru = 'Загрузка данных из ЗиК'");

		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"Обработки.ГП_ЗагрузкаСчетчиковБП77.ЗагрузитьДанныеВИБ",
			ПараметрыВыгрузки,
			НаименованиеЗадания);

		АдресХранилища = Результат.АдресХранилища;
	КонецЕсли;

	Если Результат.ЗаданиеВыполнено Тогда
		//ЗагрузитьРезультат();
	КонецЕсли;

	Возврат Результат;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --

// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ЗагрузкаФайлаЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
    Если ТипЗнч(ПомещенныеФайлы) <> Тип("Массив") Тогда
        Возврат;
    КонецЕсли;

    ЭтотОбъект.ИнформацияОЗагруженныхФайлах.Очистить();
    Для каждого Файл Из ПомещенныеФайлы Цикл
        НоваяСтрокаИнформации = ЭтотОбъект.ИнформацияОЗагруженныхФайлах.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрокаИнформации, Файл);
    КонецЦикла;
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --
