// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 ++
#Область ОбработчикиКомандФормы

// Выполняет создание банков для создания расчетных счетов абонентов.
//  !!! Для корректной работы требуется обязательное наличие установленных связей контрагентов в регистре `ГП_КонтрагентыБП77`
&НаКлиенте
Асинх Процедура СоздатьБанкиДляРасчетныхСчетов(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнена создания банков для создания расчетных счетов абонентов.");
    Если РезультатДиалога = Ложь Тогда
        Возврат; // Пользователь отказался от выполнения операции
    КонецЕсли;

    // Создание объектов
    РезультатСоздания = СоздатьБанкиДляРасчетныхСчетовНаСервере();

    // Вывод сообщения о результате
    ТекстСообщенияРезультатОперации = "";
    Если РезультатСоздания.Успех = Ложь Тогда
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание банков не выполнено.
                |Сообщение о причине: %1", РезультатСоздания.ТекстСообщения);
    Иначе
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание банков выполнено успешно.
                |Создано ""%1"" банков.", РезультатСоздания.СозданныеБанки.Количество());
    КонецЕсли;
    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРезультатОперации);
КонецПроцедуры

// Выполняет создание банковских счетов для перенесенных (созданных ГарантПлюс) абонентов (по данным расчетных счетов).
//  !!! Для корректной работы требуется обязательное наличие установленных связей контрагентов в регистре `ГП_КонтрагентыБП77`
&НаКлиенте
Асинх Процедура СоздатьБанковскиеСчетаДляПеренесенныхАбонентов(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнена создания банковских счетов для перенесенных абонентов.");
    Если РезультатДиалога = Ложь Тогда
        Возврат; // Пользователь отказался от выполнения операции
    КонецЕсли;

    // Создание объектов
    РезультатСоздания = СоздатьБанковскиеСчетаДляПеренесенныхАбонентовНаСервере();

    // Вывод сообщения о результате
    ТекстСообщенияРезультатОперации = "";
    Если РезультатСоздания.Успех = Ложь Тогда
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание банковских счетов не выполнено.
                |Сообщение о причине: %1", РезультатСоздания.ТекстСообщения);
    Иначе
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание банковских счетов выполнено успешно.
                |Создано ""%1"" банковских счета.", РезультатСоздания.СозданныеБанковскиеСчета.Количество());
    КонецЕсли;
    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРезультатОперации);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 --

// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 ++
#Область СлужебныеПроцедурыИФункции

// Создает новые банки для создания расчетных счетов абонентов.
//  !!! Для корректной работы требуется обязательное наличие установленных связей контрагентов в регистре `ГП_КонтрагентыБП77`
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * СозданныеБанки - Массив из СправочникСсылка.Банки
//      * ТекстСообщения - Строка, Неопределено
&НаСервереБезКонтекста
Функция СоздатьБанкиДляРасчетныхСчетовНаСервере()
    Возврат ГП_МиграцияРасчетныхСчетов.СоздатьБанкиДляПеренесенныхРасчетныхСчетовАбонентов();
КонецФункции

// Создает банковские счета для перенесенных (созданных ГарантПлюс) абонентов (по данным расчетных счетов).
//  !!! Для корректной работы требуется обязательное наличие установленных связей контрагентов в регистре `ГП_КонтрагентыБП77`
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * СозданныеБанковскиеСчета - Массив из СправочникСсылка.БанковскиеСчета
//      * ТекстСообщения - Строка, Неопределено
&НаСервереБезКонтекста
Функция СоздатьБанковскиеСчетаДляПеренесенныхАбонентовНаСервере()
    Возврат ГП_МиграцияРасчетныхСчетов.СоздатьБанковскиеСчетаДляПеренесенныхАбонентов();
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 --
