// Гарант+ Килипенко 24.07.2024 [F00226318] заполнение регистра сведений Зависимость услуг ++
#Область ОбработчикиКомандФормы

// Выполняет запись (обновление) зависимостей услуг в регистр сведений "Зависимости услуг"
&НаКлиенте
Асинх Процедура ЗаполнитьЗависимостиУслуг(Команда)
    РезультатДиалога = Ждать ВопросАсинх(
            "Процедура выполнит запись (обновление) зависимостей услуг в регистр сведений КВП_ЗависимостиУслуг.
            |Продолжить?", РежимДиалогаВопрос.ДаНет, , , "Внимание!");
    Если РезультатДиалога <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

    РезультатЗаполнения = ЗаполнитьЗависимостиУслугНаСервере();

    ТекстСообщенияРезультатОперации = "";
    Если РезультатЗаполнения.Успех = Ложь Тогда
        ТекстСообщенияРезультатОперации = СтрШаблон("Запись зависимостей услуг не выполнена.
                |Подробная информация: %1", РезультатЗаполнения.СообщениеОбОшибке);
    Иначе
        ТекстСообщенияРезультатОперации = СтрШаблон("Запись зависимостей услуг выполнена успешно.
                |Записано (обновлено) %1 записей регистра", РезультатЗаполнения.КоличествоЗаписейЗависимыхУслуг);
    КонецЕсли;

    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРезультатОперации);
КонецПроцедуры

// Гарант+ Килипенко 02.10.2024 [F00229273] заполнение регистра сведений Зависимость услуг по НВ на ЦСВ ++
//
&НаКлиенте
Асинх Процедура ЗаполнитьЗависимостиУслугНегативноеВоздействие(Команда)
    РезультатДиалога = Ждать ВопросАсинх(
            "Процедура выполнит запись (обновление) зависимостей услуг"
            + " (для Негативного воздействия) в регистр сведений КВП_ЗависимостиУслуг.
            |Продолжить?", РежимДиалогаВопрос.ДаНет, , , "Внимание!");
    Если РезультатДиалога <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

    РезультатЗаполнения = ЗаполнитьЗависимостиУслугДляНегативногоВоздействияНаСервере();

    ТекстСообщенияРезультатОперации = "";
    Если РезультатЗаполнения.Успех = Ложь Тогда
        ТекстСообщенияРезультатОперации = СтрШаблон("Запись зависимостей услуг (Негативное воздействие) не выполнена.
                |Подробная информация: %1", РезультатЗаполнения.СообщениеОбОшибке);
    Иначе
        ТекстСообщенияРезультатОперации = СтрШаблон("Запись зависимостей услуг (Негативное воздействие) выполнена успешно.
                |Записано (обновлено) %1 записей регистра", РезультатЗаполнения.КоличествоЗаписейЗависимыхУслуг);
    КонецЕсли;

    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРезультатОперации);
КонецПроцедуры // Гарант+ Килипенко 02.10.2024 [F00229273] заполнение регистра сведений Зависимость услуг по НВ на ЦСВ --

#КонецОбласти // ОбработчикиКомандФормы
// Гарант+ Килипенко 24.07.2024 [F00226318] заполнение регистра сведений Зависимость услуг --

// Гарант+ Килипенко 24.07.2024 [F00226318] заполнение регистра сведений Зависимость услуг ++
#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Период - Дата, Неопределено - Дата (начало месяца), по умолчанию 01.01.2024г
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоЗаписейЗависимыхУслуг - Число
//      * СообщениеОбОшибке - Строка, Неопределено
&НаСервереБезКонтекста
Функция ЗаполнитьЗависимостиУслугНаСервере(Знач Период = Неопределено)
    Возврат Обработки.ГП_ЗаполнениеЗависимостейУслуг.ЗаполнитьЗависимостиУслуг(Период);
КонецФункции

// Гарант+ Килипенко 02.10.2024 [F00229273] заполнение регистра сведений Зависимость услуг по НВ на ЦСВ ++
//
// Параметры:
//  Период - Дата, Неопределено - Дата (начало месяца), по умолчанию 01.01.2024г
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоЗаписейЗависимыхУслуг - Число
//      * СообщениеОбОшибке - Строка, Неопределено
&НаСервереБезКонтекста
Функция ЗаполнитьЗависимостиУслугДляНегативногоВоздействияНаСервере(Знач Период = Неопределено)
    Возврат Обработки.ГП_ЗаполнениеЗависимостейУслуг.ЗаполнитьЗависимостиУслугДляНегативногоВоздействия(Период);
КонецФункции // Гарант+ Килипенко 02.10.2024 [F00229273] заполнение регистра сведений Зависимость услуг по НВ на ЦСВ --

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 24.07.2024 [F00226318] заполнение регистра сведений Зависимость услуг --
