
&НаСервере
Процедура ГП_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() И Параметры.Свойство("ГП_ЗначенияПоказанийДляЗаполнения") Тогда   		       
        // Обновим дату ввода показаний и текущие показания.
        ЭтотОбъект.Объект.Главная.Очистить();
        ДатаЗаполнения = ТекущаяДатаСеанса();
        Для Каждого СтрокаИсходныхПоказаний Из Параметры.ГП_ЗначенияПоказанийДляЗаполнения Цикл
            //ТекСтрокаПоказания.ДатаПоказания = Объект.Дата;
            //ТекСтрокаПоказания.ДневноеПоказание = Неопределено;
            //ТекСтрокаПоказания.НочноеПоказание  = Неопределено;
            //ТекСтрокаПоказания.ПиковоеПоказание = Неопределено;
            НоваяСтрокаПоказаний = ЭтотОбъект.Объект.Главная.Добавить();
            НоваяСтрокаПоказаний.ДатаПоказания = ДатаЗаполнения;
            ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказаний, СтрокаИсходныхПоказаний);
        КонецЦикла;
        
        ОбновитьТабличнуюЧастьНаСервере();
	КонецЕсли;
КонецПроцедуры
