// Гарант+ Килипенко 04.03.2025 [] Доработка движений док-та КВП_РазовоеНачислениеУслуг ++
#Область ПереопределениеСтандартногоФункционала
	
&ИзменениеИКонтроль("ДвиженияПоРегистрам")
Процедура ГП_ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаНачислений, Отказ, Заголовок)

	Если Услуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьТаблицуНачислений(СтруктураШапкиДокумента, ТаблицаНачислений);
	
	УПЖКХ_ВзаиморасчетыПоЛицевымСчетам.СформироватьДвиженияПоВзаиморасчетам(ЭтотОбъект, 
	                                                                        Новый Структура("Приход", ТаблицаНачислений));
	
	// Движения для отражения начислений в регл. учете.
	СформироватьДвиженияДляОтраженияНачисленийВРеглУчете(ЭтотОбъект);
	
	Если ВестиУчетНачисленийПоДобровольномуСтрахованию Тогда
		ДвиженияВРегистреНачисленияДобровольногоСтрахования();
    КонецЕсли;
    #Вставка // Гарант+ Килипенко 04.03.2025 [] Доработка движений док-та КВП_РазовоеНачислениеУслуг ++

    // Перезаполнение движений отражения в рег. учете в разрезе лицевых счетов
    ГП_РаботаСНачислениемУслуг.ДополнитьДвиженияОтраженияДаннымиЛС(
        ЭтотОбъект.Движения.УПЖКХ_Начисления, ЭтотОбъект.Движения.КВП_НачислениеДляОтраженияВРеглУчете);

    СтавкаНДСДляПерерасчета = ГП_ОбщегоНазначения.ПолучитьОбщуюСтавкуНДСНачисленийЖКХ(ЭтотОбъект.Дата);

    // Перерасчет сумм движений взаиморасчетов с учетом НДС
    ГП_РаботаСНачислениемУслуг.ПересчитатьСуммыДвиженийНачисленийИВзаиморасчетовСУчетомНДС(
        ЭтотОбъект.Движения.УПЖКХ_Начисления, Ложь, СтавкаНДСДляПерерасчета);

    // Перерасчет сумм движений начислений с учетом НДС
    ГП_РаботаСНачислениемУслуг.ПересчитатьСуммыДвиженийНачисленийИВзаиморасчетовСУчетомНДС(
        ЭтотОбъект.Движения.КВП_ВзаиморасчетыПоЛицевымСчетам, Ложь, СтавкаНДСДляПерерасчета);

    #КонецВставки // Гарант+ Килипенко 04.03.2025 [] Доработка движений док-та КВП_РазовоеНачислениеУслуг --
	
КонецПроцедуры

#КонецОбласти // ПереопределениеСтандартногоФункционала
// Гарант+ Килипенко 04.03.2025 [] Доработка движений док-та КВП_РазовоеНачислениеУслуг --
