
&НаКлиенте
Процедура ОК(Команда)
    СтруктураЗакрытия = Новый Структура;
    ТекстовыйФайл = Новый ТекстовыйДокумент;
 
    ТекстовыйФайл.Прочитать(
        "D:\TMA\TokenSchetmash\pass.txt",
        КодировкаТекста.UTF8,
        Символы.ВК + Символы.ПС
    );
    Если Пароль = ТекстовыйФайл.ПолучитьТекст() Тогда 
        СтруктураЗакрытия.Вставить(Истина);
    Иначе
        СтруктураЗакрытия.Вставить(Ложь);
    КонецЕсли;
    Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
    СтруктураЗакрытия = Новый Структура;
    СтруктураЗакрытия.Вставить(Ложь);
    Закрыть(СтруктураЗакрытия);
КонецПроцедуры
