// Гарант+ Килипенко 10.09.2024 [F00227690] Заполнение динамических показателей ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЭтотОбъект.ДатаЗаполненияДинамическихПоказателей = 
        ?(ЗначениеЗаполнено(ЭтотОбъект.ДатаЗаполненияДинамическихПоказателей),
            НачалоДня(ЭтотОбъект.ДатаЗаполненияДинамическихПоказателей), Дата(2024, 08, 01));
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 10.09.2024 [F00227690] Заполнение динамических показателей --

// Гарант+ Килипенко 10.09.2024 [F00227690] Заполнение динамических показателей ++
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьДинамическиеПоказателиЛС(Команда)
    ПериодЗаполнения = ЭтотОбъект.ДатаЗаполненияДинамическихПоказателей;

    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            СтрШаблон("Будет выполнено запись значений динамических показателей л/с (на период ""%1"") в регистр.",
            ПериодЗаполнения));
    Если РезультатДиалога = Ложь Тогда
        Возврат; // Пользователь отказался от выполнения операции
    КонецЕсли;

    // Создание документов
    РезультатЗаполнения = ЗаполнитьДанныеДинамическихПоказателейНаСервере(ПериодЗаполнения);

    СообщениеПользователю = "";
    Если РезультатЗаполнения.Успех = Ложь Тогда
        СообщениеПользователю = СтрШаблон("Заполнение динамических показателей не выполнено.
                |Информация о проблеме: %1", РезультатЗаполнения.ТекстСообщения);
    Иначе
        СообщениеПользователю = СтрШаблон("Заполнение динамических показателей выполнено успешно.
                |Создано ""%1"" новых записей",
                РезультатЗаполнения.КоличествоЗаписанных);
    КонецЕсли;

    ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// Гарант+ Килипенко 10.09.2024 [F00227690] Заполнение динамических показателей --

// Гарант+ Килипенко 10.09.2024 [F00227690] Заполнение динамических показателей ++
#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Период - Дата
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоЗаписанных - Число
//      * СообщениеОбОшибке - Строка, Неопределено
&НаСервереБезКонтекста
Функция ЗаполнитьДанныеДинамическихПоказателейНаСервере(Знач Период)
    Возврат ГП_МиграцияДинамическихПоказателей.ЗаполнитьДанныеДинамическихПоказателей(Период);
КонецФункции

#КонецОбласти
// Гарант+ Килипенко 10.09.2024 [F00227690] Заполнение динамических показателей --
