#Область ПрограммныйИнтерфейс

Функция ПолучитьКонтактнуюИнформациюПоПредставлению(Представление, ОжидаемыйВид) Экспорт
    Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Представление, ОжидаемыйВид);
КонецФункции

Функция ЗаполнитьАдресаДоставкиСчетовИКвитанцийЛицевыхСчетов()
    ДанныеЗаполнения = ПолучитьЛицевыеСчетаДляУстановкиАдресаДоставкиСчетовИКвитанций();

    Для Каждого СтрокаДанных Из ДанныеЗаполнения Цикл
        СтруктураАдресаБП77 = Новый Структура("Улица, Дом, Строение, Квартира");
        СтруктураАдресаБП77.Вставить("ПредставлениеАдресаКонтрагента", ?(ПустаяСтрока(СтрокаДанных.ПочтовыйАдресКонтрагентаБП77) = Ложь,
                    СтрокаДанных.ПочтовыйАдресКонтрагентаБП77, СтрокаДанных.ЮридическийАдресКонтрагентаБП77));
        СтруктураАдресаБП77.Улица = ?(ПустаяСтрока(СтрокаДанных.Улица) = Ложь, СокрЛП(СтрокаДанных.Улица), СокрЛП(СтрокаДанных.Улица2));
        СтруктураАдресаБП77.Дом = СтрокаДанных.Дом;
        СтруктураАдресаБП77.Строение = СтрокаДанных.Корпус;
        СтруктураАдресаБП77.Квартира = СтрокаДанных.Квартира;

        ПредставлениеТекущегоАдреса = СтрокаДанных.ПредставлениеКИ;
        СтруктураТекущегоАдреса = УправлениеКонтактнойИнформациейБП.СтруктураАдреса(
                СтрокаДанных.ЗначениеКИ, Новый Структура("НаименованиеВключаетСокращение", Истина));

        Если ПустаяСтрока(СтруктураАдресаБП77.Улица) И ПустаяСтрока(СтруктураАдресаБП77.Дом) Тогда
            Продолжить;
        КонецЕсли;

    КонецЦикла;

    Возврат Неопределено;
КонецФункции

Функция СформироватьАдресДоставкиСчетовИКвитанцийЛицевогоСчет(Знач СтруктураАдресаБП77, Знач АдресКонтрагента = Неопределено)
    АдресКонтрагентаJSON = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
        СтруктураАдресаБП77.ПредставлениеАдресаКонтрагента);
    СтруктураАдресаКонтрагента = УправлениеКонтактнойИнформациейБП.СтруктураАдреса(
        АдресКонтрагентаJSON, Новый Структура("НаименованиеВключаетСокращение", Истина));

    Возврат Неопределено;
КонецФункции

#Область СборДанных

Функция ПолучитьЛицевыеСчетаДляУстановкиАдресаДоставкиСчетовИКвитанций() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = ПолучитьТекстЗапросаЛицевыхСчетовДляУстановкиАдресаДоставкиСчетовИКвитанций();

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();
    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СборДанных

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область ТекстыЗапросов

Функция ПолучитьТекстЗапросаЛицевыхСчетовДляУстановкиАдресаДоставкиСчетовИКвитанций() Экспорт
    РезультатФункции =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ЛицевыеСчета.Период КАК Период,
        |	ЛицевыеСчета.Регистратор КАК Регистратор,
        |	ЛицевыеСчета.НомерСтроки КАК НомерСтроки,
        |	ЛицевыеСчета.Активность КАК Активность,
        |	ЛицевыеСчета.Объект КАК Объект,
        |	ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
        |	ЛицевыеСчета.Действует КАК Действует,
        |	ЛицевыеСчета.УдалитьКоличествоПроживающих КАК УдалитьКоличествоПроживающих,
        |	ЛицевыеСчета.УдалитьКоличествоЗарегистрированных КАК УдалитьКоличествоЗарегистрированных
        |ПОМЕСТИТЬ ВТ_ДействующиеЛицевыеСчета
        |ИЗ
        |	РегистрСведений.КВП_ЛицевыеСчета.СрезПоследних(, ) КАК ЛицевыеСчета
        |ГДЕ
        |	ЛицевыеСчета.Действует = ИСТИНА
        |	И ЛицевыеСчета.ЛицевойСчет.Идентификатор ПОДОБНО ""%00005623""
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ЗданияБП77.*,
        |	ЗданияБП77.ОбъектАбонентаКод + ""_"" + ЗданияБП77.КонтрагентКод КАК ИдентификаторЛС,
        |	КонтрагентыБП77.ЮридическийАдрес КАК ЮридическийАдресКонтрагентаБП77,
        |	КонтрагентыБП77.ПочтовыйАдрес КАК ПочтовыйАдресКонтрагентаБП77,
        |	КонтрагентыБП77.Наименование КАК НаименованиеКонтрагентаБП77,
        |	КонтрагентыБП77.ПолнНаименование КАК ПолнНаименованиеКонтрагентаБП77,
        |	КонтрагентыБП77.ОсновнойДоговорКод КАК КодОсновногоДоговораКонтрагентаБП77,
        |	КонтрагентыБП77.ОсновнойДоговорНаименование КАК НаименованиеОсновногоДоговораКонтрагентаБП77,
        |	ЕСТЬNULL(ДоговорыБП77.Номер, """") КАК НомерОсновногоДоговораБП77
        |ПОМЕСТИТЬ ВТ_ЗданияБП77
        |ИЗ
        |	РегистрСведений.ГП_ЗданияБП77 КАК ЗданияБП77
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГП_КонтрагентыБП77 КАК КонтрагентыБП77
        |		ПО ЗданияБП77.КонтрагентКод = КонтрагентыБП77.Код
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГП_ДоговорыБП77 КАК ДоговорыБП77
        |		ПО ЗданияБП77.КонтрагентКод = ДоговорыБП77.КонтрагентКод
        |			И (ДоговорыБП77.Код <> """")
        |			И (КонтрагентыБП77.ОсновнойДоговорКод = ДоговорыБП77.Код)
        |ГДЕ
        |	ЗданияБП77.КонтрагентКод <> """"
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	КонтактнаяИнформацияЛС.Ссылка КАК Ссылка,
        |	МАКСИМУМ(КонтактнаяИнформацияЛС.НомерСтроки) КАК НомерСтроки,
        |	КонтактнаяИнформацияЛС.Тип КАК Тип,
        |	КонтактнаяИнформацияЛС.Вид КАК Вид
        |ПОМЕСТИТЬ ВТ_КонтактнаяИнформацияЛС_Подготовка
        |ИЗ
        |	Справочник.КВП_ЛицевыеСчета.КонтактнаяИнформация КАК КонтактнаяИнформацияЛС
        |ГДЕ
        |	КонтактнаяИнформацияЛС.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
        |	И КонтактнаяИнформацияЛС.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.УПЖКХ_АдресДоставкиСчетовИКвитанцийЛицевогоСчета)
        |	И КонтактнаяИнформацияЛС.Ссылка В
        |			(ВЫБРАТЬ
        |				Т.ЛицевойСчет
        |			ИЗ
        |				ВТ_ДействующиеЛицевыеСчета КАК Т)
        |СГРУППИРОВАТЬ ПО
        |	КонтактнаяИнформацияЛС.Ссылка,
        |	КонтактнаяИнформацияЛС.Тип,
        |	КонтактнаяИнформацияЛС.Вид
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	КонтактнаяИнформацияЛС.Ссылка КАК ЛицевойСчет,
        |	КонтактнаяИнформацияЛС.НомерСтроки КАК НомерСтроки,
        |	КонтактнаяИнформацияЛС.Тип КАК Тип,
        |	КонтактнаяИнформацияЛС.Вид КАК Вид,
        |	КонтактнаяИнформацияЛС.Представление КАК Представление,
        |	КонтактнаяИнформацияЛС.ЗначенияПолей КАК ЗначенияПолей,
        |	КонтактнаяИнформацияЛС.Страна КАК Страна,
        |	КонтактнаяИнформацияЛС.Регион КАК Регион,
        |	КонтактнаяИнформацияЛС.Город КАК Город,
        |	КонтактнаяИнформацияЛС.АдресЭП КАК АдресЭП,
        |	КонтактнаяИнформацияЛС.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
        |	КонтактнаяИнформацияЛС.НомерТелефона КАК НомерТелефона,
        |	КонтактнаяИнформацияЛС.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
        |	КонтактнаяИнформацияЛС.Значение КАК Значение
        |ПОМЕСТИТЬ ВТ_КонтактнаяИнформацияЛС
        |ИЗ
        |	Справочник.КВП_ЛицевыеСчета.КонтактнаяИнформация КАК КонтактнаяИнформацияЛС
        |ГДЕ
        |	(КонтактнаяИнформацияЛС.Ссылка, НомерСтроки, КонтактнаяИнформацияЛС.Тип, Вид) В (
        |		ВЫБРАТЬ Т.Ссылка, Т.НомерСтроки, Т.Тип, Т.Вид ИЗ ВТ_КонтактнаяИнформацияЛС_Подготовка КАК Т)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ВТ_ДействующиеЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
        |	ВТ_ЗданияБП77.*,
        |	НЕ (ВТ_ДействующиеЛицевыеСчета.ЛицевойСчет ЕСТЬ NULL) КАК ЕстьКонтактнаяИнформация,
        |	ВТ_КонтактнаяИнформацияЛС.Представление КАК ПредставлениеКИ,
        |	ВТ_КонтактнаяИнформацияЛС.ЗначенияПолей КАК ЗначенияПолейКИ,
        |	ВТ_КонтактнаяИнформацияЛС.Страна КАК СтранаКИ,
        |	ВТ_КонтактнаяИнформацияЛС.Регион КАК РегионКИ,
        |	ВТ_КонтактнаяИнформацияЛС.Город КАК ГородКИ,
        |	ВТ_КонтактнаяИнформацияЛС.АдресЭП КАК АдресЭПКИ,
        |	ВТ_КонтактнаяИнформацияЛС.ДоменноеИмяСервера КАК ДоменноеИмяСервераКИ,
        |	ВТ_КонтактнаяИнформацияЛС.НомерТелефона КАК НомерТелефонаКИ,
        |	ВТ_КонтактнаяИнформацияЛС.НомерТелефонаБезКодов КАК НомерТелефонаБезКодовКИ,
        |	ВТ_КонтактнаяИнформацияЛС.Значение КАК ЗначениеКИ
        |ИЗ
        |	ВТ_ДействующиеЛицевыеСчета КАК ВТ_ДействующиеЛицевыеСчета
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗданияБП77 КАК ВТ_ЗданияБП77
        |		ПО ВТ_ДействующиеЛицевыеСчета.ЛицевойСчет.Идентификатор = ВТ_ЗданияБП77.ИдентификаторЛС
        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформацияЛС КАК ВТ_КонтактнаяИнформацияЛС
        |		ПО ВТ_ДействующиеЛицевыеСчета.ЛицевойСчет = ВТ_КонтактнаяИнформацияЛС.ЛицевойСчет
        |";

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ТекстыЗапросов

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
