#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ГП_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
    Если ПустаяСтрока(ЭтотОбъект.Объект.Номер) = Истина
        И ГП_ЭтоДоговорАбонентскогоОтделаНаСервере() = Истина Тогда

        ГП_ЗаполнитьНовыйНомерАбонентскогоОтделаНаСервере();
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ГП_ЗаполнитьНовыйНомерАбонентскогоОтделаНаСервере()
    СтруктураНомера = ГП_РаботаСДоговорами.ПолучитьМаксимальныйНомерДоговораАбонентскогоОтдела(ЭтотОбъект.Объект.Ссылка);
    Если СтруктураНомера.Успех = Ложь Тогда
        ОбщегоНазначения.СообщитьПользователю("Не удалось получить последний номер для формирования");
        Возврат;
    КонецЕсли;

    ЭтотОбъект.Объект.Номер = Формат(СтруктураНомера.Значение + 1, "ЧДЦ=0; ЧГ=0");
КонецПроцедуры

&НаСервере
Функция ГП_ЭтоДоговорАбонентскогоОтделаНаСервере()
    Возврат ЭтотОбъект.Объект.lc_ВидДоговора = ГП_РаботаСДоговорами.ПолучитьДополнительныйВидДоговораАбонентскийОтдел().Ссылка;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
