#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЭтотОбъект.Объект.Токен = "";

    // Режим доступа
    ПользовательСчетмаш = ГП_СчетмашAPI.ПолучитьДемоПользователяСчетмаш();
    ЭтоДемоЛогинСчетмаш = ГП_СчетмашAPI.ЭтоДемоЛогинСчетмаш(ПользовательСчетмаш.Логин);

    Если ЭтоДемоЛогинСчетмаш Тогда
        ЭтотОбъект.Объект.ИдентификаторМагазина = 42;
    Иначе
        ЭтотОбъект.Объект.ИдентификаторМагазина = 59;
    КонецЕсли;

    ЭтотОбъект.Объект.Логин = ПользовательСчетмаш.Логин;
    ЭтотОбъект.Объект.Пароль =
        Константы.ГП_КлючАвторизацииСчетмаш.ПолучитьКлючДоступа(ЭтоДемоЛогинСчетмаш);

    ЭтотОбъект.Объект.Организация = ?(ЗначениеЗаполнено(ЭтотОбъект.Объект.Организация) = Ложь,
            УПЖКХ_ТиповыеМетодыВызовСервера.ПолучитьОсновнуюОрганизацию(), ЭтотОбъект.Объект.Организация);

    ЭтотОбъект.Объект.ПоУмолчанию_ВидОплаты = 1; // payments.type
    ЭтотОбъект.Объект.ПоУмолчанию_ПризнакПредметаРасчета = 4; // items.type
    ЭтотОбъект.Объект.ПоУмолчанию_ПризнакСпособаРасчета = 4; // items.mode

    РезультатПолученияТокена = ГП_СчетмашAPI.ПолучитьТокен(
            Новый Структура("Логин, Пароль", ЭтотОбъект.Объект.Логин, ЭтотОбъект.Объект.Пароль), Новый Структура);

    Если РезультатПолученияТокена.Успех Тогда
        ОбщегоНазначения.СообщитьПользователю("Токен получен");
    Иначе
        ОбщегоНазначения.СообщитьПользователю(РезультатПолученияТокена.ТекстСообщения);
    КонецЕсли;

    ЭтотОбъект.ТестовыйРежим = ЭтоДемоЛогинСчетмаш;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если ЭтотОбъект.ТестовыйРежим Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю("ВНИМАНИЕ!!! ВКЛЮЧЕН ТЕСТОВЫЙ РЕЖИМ!");
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборПериода(Команда)
    ВыбранныйПериод = Новый СтандартныйПериод;
    ВыбранныйПериод.ДатаНачала = ЭтотОбъект.Объект.ДатаНачала;
    ВыбранныйПериод.ДатаОкончания = ЭтотОбъект.Объект.ДатаОкончания;

    Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период = ВыбранныйПериод;

    Диалог.Показать(Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСтатусовЧеков(Команда)
    ГП_СчетмашОнлайнФорма.ПроверкаСтатусовЧеков(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратПрихода(Команда)
    ГП_СчетмашОнлайнФорма.ВозвратПрихода(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КоррекцияПрихода(Команда)
    ГП_СчетмашОнлайнФорма.КоррекцияПрихода(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КоррекцияПриходаВсехСтрок(Команда)
    ГП_СчетмашОнлайнФорма.КоррекцияПрихода(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратПриходаВсехСтрок(Форма)
    ГП_СчетмашОнлайнФорма.КоррекцияПрихода(Форма);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтрокиРегистрацииОплатПриАктивизацииСтроки(Элемент)
    СтандартнаяОбработка = Ложь;

    Если Элементы.СтрокиРегистрацииОплат.ТекущиеДанные <> Неопределено Тогда
        ЭтотОбъект.РасшифровкаСтрокиРегистрацииОплат.Очистить();

        СтруктураПараметровОтбора = Новый Структура;
        // СтруктураПараметровОтбора.Вставить("Документ", Элементы.СтрокиРегистрацииОплат.ТекущиеДанные.Документ);
        СтруктураПараметровОтбора.Вставить("external_id", Элементы.СтрокиРегистрацииОплат.ТекущиеДанные.external_id);

        НайденныеСтроки = ЭтотОбъект.Объект.РасшифровкаРегистрацийОплат.НайтиСтроки(СтруктураПараметровОтбора);

        Для Каждого ТекущаяСтрокаРасшифровки Из НайденныеСтроки Цикл
            НоваяСтрокаДляОтображения = ЭтотОбъект.РасшифровкаСтрокиРегистрацииОплат.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрокаДляОтображения, ТекущаяСтрокаРасшифровки);
        КонецЦикла;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
    Диалог = ДополнительныеПараметры.Диалог;

    Если ЗначениеЗаполнено(Период) Тогда
        ВыбранныйПериод = Диалог.Период;
        ЭтотОбъект.Объект.ДатаНачала = ВыбранныйПериод.ДатаНачала;
        ЭтотОбъект.Объект.ДатаОкончания = ВыбранныйПериод.ДатаОкончания;
    КонецЕсли;
КонецПроцедуры

#Область ЗаполнениеДанных

&НаКлиенте
Процедура Заполнить(Команда)
    ЗаполненоУспешно = ЗаполнитьНаСервере();

    Если НЕ ЗаполненоУспешно Тогда
        Объект.РасшифровкаРегистрацийОплат.Очистить();
        Объект.СтрокиРегистрацииОплат.Очистить();
        ПоказатьПредупреждение( , "Прервано! Исправьте ошибки.", , "Ошибка при заполнении");
        Возврат;

    КонецЕсли;
КонецПроцедуры

// Гарант+ Килипенко 11.02.2025 Признак выгрузки в ОФД ++
// ~ Переработана полностью ~
//
&НаСервере
Процедура ПолучитьОбщуюТаблицуРасшифровкиОплат()
    // Гарант+ Килипенко 11.02.2025 Признак выгрузки в ОФД ++
    ТаблицаРасшифровкиОплатДляОФД = ГП_ОбменОФД.ПолучитьСвернутуюОбщуюТаблицуРасшифровкиОплатДляОФД(
            НачалоДня(ЭтотОбъект.Объект.ДатаНачала),
            КонецДня(ЭтотОбъект.Объект.ДатаОкончания),
            ?(ЭтотОбъект.ЛицевойСчет.Пустая(), Неопределено, ЭтотОбъект.ЛицевойСчет),
            ЭтотОбъект.Объект.Организация);

    ЭтотОбъект.Объект.ОбщаяТаблицаРасшифровкиОплат.Очистить();
    ЭтотОбъект.Объект.ОбщаяТаблицаРасшифровкиОплат.Загрузить(ТаблицаРасшифровкиОплатДляОФД);
КонецПроцедуры // Гарант+ Килипенко 11.02.2025 Признак выгрузки в ОФД --

&НаСервере
Функция ЗаполнитьНаСервере()
    ЭтотОбъект.Объект.СтрокиРегистрацииОплат.Очистить();
    ЭтотОбъект.Объект.РасшифровкаРегистрацийОплат.Очистить();
    ЭтотОбъект.РасшифровкаСтрокиРегистрацииОплат.Очистить();

    ДанныеЗаполнения = ГП_ОбменОФД.СобратьДанныеЧековСчетмаш(
            НачалоДня(ЭтотОбъект.Объект.ДатаНачала),
            КонецДня(ЭтотОбъект.Объект.ДатаОкончания),
            Новый Структура("Контрагент, Организация",
                ?(ЭтотОбъект.Контрагент.Пустая(), Неопределено, ЭтотОбъект.Контрагент),
                ЭтотОбъект.Объект.Организация));

    Для Каждого СтрокаДанныхЗаполнения Из ДанныеЗаполнения.ТаблицаОплат Цикл
        НоваяСтрокаОплаты = ЭтотОбъект.Объект.СтрокиРегистрацииОплат.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрокаОплаты, СтрокаДанныхЗаполнения);
        НоваяСтрокаОплаты.timestamp = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанныхЗаполнения.Документ, "Дата");

        // Формирование идентификатора
        ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаДанныхЗаполнения.Документ, "Дата, Номер");
        ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаДанныхЗаполнения.Контрагент, "Код");
        НоваяСтрокаОплаты.external_id = ГП_ОбменОФД.СформироватьВнешнийИдентификаторЧекаСчетмаш(
                ДанныеДокумента, ДанныеКонтрагента);
        Если ПустаяСтрока(НоваяСтрокаОплаты.external_id) Тогда
            НоваяСтрокаОплаты.external_id = "";
            ВызватьИсключение("Ошибка формирования идентификатора");
        КонецЕсли;

        НайденныеСтрокиРасшифровки = ДанныеЗаполнения.РасшифровкаОплатДляЧеков.НайтиСтроки(
                Новый Структура("Документ, Контрагент", СтрокаДанныхЗаполнения.Документ, СтрокаДанныхЗаполнения.Контрагент));
        Для Каждого СтрокаДанныхЗаполненияРасшифровки Из НайденныеСтрокиРасшифровки Цикл
            НоваяСтрокаРасшифровки = ЭтотОбъект.Объект.РасшифровкаРегистрацийОплат.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрокаРасшифровки, СтрокаДанныхЗаполненияРасшифровки);
            НоваяСтрокаРасшифровки.external_id = НоваяСтрокаОплаты.external_id;
            НоваяСтрокаРасшифровки.Аванс = ?(СтрокаДанныхЗаполненияРасшифровки.ЭтоАванс = Истина, НоваяСтрокаРасшифровки.Сумма, 0);
            НоваяСтрокаРасшифровки.Пени = ?(СтрокаДанныхЗаполненияРасшифровки.ЭтоПени = Истина, НоваяСтрокаРасшифровки.Сумма, 0);
        КонецЦикла;
    КонецЦикла;

    Возврат Истина;
КонецФункции

&НаСервере
Функция ПолучитьТаблицуОстатковВзаиморасчетовПоДокументу(Знач Документ, Знач СписокЛицевыхСчетов, Знач Услуга = Неопределено)
    Если ТипЗнч(СписокЛицевыхСчетов) = Тип("СправочникСсылка.КВП_ЛицевыеСчета") Тогда
        СписокЛицевыхСчетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СписокЛицевыхСчетов);
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
        |    ВзаиморасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
        |    ВзаиморасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
        |    ВзаиморасчетыПоЛицевымСчетамОстатки.СуммаНачисленияОстаток КАК СуммаНачисленияОстаток
        |ИЗ
        |    РегистрНакопления.КВП_ВзаиморасчетыПоЛицевымСчетам.Остатки(
        |       &Дата,
        |       ЛицевойСчет В (&СписокЛицевыхСчетов)
        |       И &ДополнительныеУсловия) КАК ВзаиморасчетыПоЛицевымСчетамОстатки
        |";

    ДополнительныеУсловияТаблицы = "ИСТИНА";
    Если Услуга <> Неопределено Тогда
        ДополнительныеУсловияТаблицы = СтрШаблон("%1 И (Услуга = &Услуга)", ДополнительныеУсловияТаблицы);
        Запрос.УстановитьПараметр("Услуга", Услуга);
    КонецЕсли;
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеУсловияТаблицы", ДополнительныеУсловияТаблицы);

    Запрос.УстановитьПараметр("СписокЛицевыхСчетов", СписокЛицевыхСчетов);
    Запрос.УстановитьПараметр("Дата", Новый Граница(Документ.МоментВремени(), ВидГраницы.Включая));

    Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти // ЗаполнениеДанных

#Область РаботаСЧеками

// Приход (sell)
&НаКлиенте
Асинх Процедура ДляТекущейСтрокиРегистрацияЧека_Приход(Команда)
    ТекущаяСтрокаОплаты = ЭтотОбъект.Элементы.СтрокиРегистрацииОплат.ТекущиеДанные;

    РезультатДиалога = Ждать ВопросАсинх(СтрШаблон(
                "Будет выполнена регистрация чека ""Приход"" для контрагента: %1
                |Продолжить?", ТекущаяСтрокаОплаты.Контрагент), РежимДиалогаВопрос.ДаНет, 0, , "Регистрация чека (приход)");

    Если РезультатДиалога <> КодВозвратаДиалога.Да Тогда
        Возврат; // Отказ пользователя
    КонецЕсли;

    ТипОперацииРегистрации = ГП_СчетмашAPIКлиентСервер.НовыйТипыОперацииРегистрацииЧека().Приход;
    РезультатПробитияЧека = ПробитьЧекСчетмаш(
            ЭтотОбъект,
            ТипОперацииРегистрации,
            ТекущаяСтрокаОплаты);
КонецПроцедуры

&НаКлиенте
Функция ПробитьЧекСчетмаш(Форма, Знач ТипОперации, Знач ТекущаяСтрокаОплаты)
    РезультатФункции = Новый Структура("Успех, Результат", Истина);

    ДанныеДляОтправкиСчетмаш = ГП_СчетмашAPIКлиентСервер.НовыйСтруктураРегистрацииЧескаСчетмаш(Истина);
    ДанныеДляОтправкиСчетмаш.external_id = ТекущаяСтрокаОплаты.external_id;
    ДанныеДляОтправкиСчетмаш.timestamp = Формат(ТекущаяСтрокаОплаты.timestamp, "ДФ='dd.MM.yyyy hh:mm:ss'");

    НайденныеСтрокиРасшифровки = Форма.Объект.РасшифровкаРегистрацийОплат.НайтиСтроки(
            Новый Структура("external_id", ДанныеДляОтправкиСчетмаш.external_id));
    Если НайденныеСтрокиРасшифровки.Количество() > 100 Тогда
        ВызватьИсключение("Ошибка. Количество строк расшифровки чека превышает максимальное количество: (100)");
    КонецЕсли;

    Для Каждого ТекущаяСтрокаРасшифровки Из НайденныеСтрокиРасшифровки Цикл
        СтруктураЭлементаЧека = ГП_СчетмашAPIКлиентСервер.НовыйСтруктураРасшифровкиСтрокиОплатыРегистрацииЧескаСчетмаш(Истина);
        СтруктураЭлементаЧека.name = СокрЛП(ТекущаяСтрокаРасшифровки.ВидУслугиПредставление);
        СтруктураЭлементаЧека.type =
            ГП_СчетмашAPIКлиентСервер.ПолучитьПризнакПредметаРасчетаСчетмашПоЗначению(ТекущаяСтрокаРасшифровки.ПризнакПредметаРасчета);
        СтруктураЭлементаЧека.mode =
            ГП_СчетмашAPIКлиентСервер.ПолучитьПризнакСпособаРасчетаСчетмашПоЗначению(ТекущаяСтрокаРасшифровки.ПризнакСпособаРасчета);
        СтруктураЭлементаЧека.price = ТекущаяСтрокаРасшифровки.Сумма; // Тариф
        СтруктураЭлементаЧека.quantity = 1; // Количество
        СтруктураЭлементаЧека.sum = ТекущаяСтрокаРасшифровки.Сумма; // Сумма
        СтруктураЭлементаЧека.tax =
            ГП_СчетмашAPIКлиентСервер.ПолучитьСтавкуНДССчетмашПоЗначению(ТекущаяСтрокаРасшифровки.СтавкаНДС); // СтавкаНДС
        СтруктураЭлементаЧека.tax_sum = Окр(УчетНДСКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрокаРасшифровки.Сумма,
                    Истина, ТекущаяСтрокаРасшифровки.ЗначениеСтавкиНДС), 2); // Сумма НДС

        ДанныеДляОтправкиСчетмаш.receipt.items.Добавить(СтруктураЭлементаЧека);
    КонецЦикла;

    ДанныеДляОтправкиСчетмаш.receipt.total = ТекущаяСтрокаОплаты.Сумма; // Сумма чека

    СтруктураСтрокиОплатыРегистрацииЧеска = ГП_СчетмашAPIКлиентСервер.НовыйСтруктураСтрокиОплатыРегистрацииЧескаСчетмаш(Истина);
    СтруктураСтрокиОплатыРегистрацииЧеска.sum = ТекущаяСтрокаРасшифровки.Сумма;
    ДанныеДляОтправкиСчетмаш.receipt.payments.Добавить(СтруктураСтрокиОплатыРегистрацииЧеска);

    РезультатРегистрацииЧека = ВыполнитьРегистрациюЧекаНаСервере(
            ДанныеДляОтправкиСчетмаш, ТипОперации, Форма.Объект.ИдентификаторМагазина, Форма.Объект.Логин);

    Если РезультатРегистрацииЧека.Успех = Ложь Тогда
        РезультатФункции.Успех = Ложь;
        ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатРегистрацииЧека.ТекстСообщения);
        Возврат РезультатФункции; // Ошибка регистрации чека
    КонецЕсли;

    ТекущаяСтрокаОплаты.id_Чека = РезультатРегистрацииЧека.ДанныеОтвета.Идентификатор;
    ТекущаяСтрокаОплаты.status = РезультатРегистрацииЧека.ДанныеОтвета.Статус;
    ОбщегоНазначенияКлиент.СообщитьПользователю("Регистрация чека выполнена успешно");

    РезультатФункции.Результат = РезультатРегистрацииЧека.ДанныеОтвета;
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьРегистрациюЧекаНаСервере(Знач ДанныеДляОтправкиСчетмаш, Знач ТипОперации, Знач ИдентификаторМагазина, Знач Логин)
    РезультатРегистрацииЧека = ГП_СчетмашAPI.ВыполнитьРегистрациюЧека(
            ДанныеДляОтправкиСчетмаш, ТипОперации, ИдентификаторМагазина, Логин);
    Возврат РезультатРегистрацииЧека;
КонецФункции

&НаКлиенте
Процедура ПроверкаСтатусаЧека(Команда)
    ТекущаяСтрокаОплаты = ЭтотОбъект.Элементы.СтрокиРегистрацииОплат.ТекущиеДанные;
    ВыполнитьПроверкуСтатусаЧека(ТекущаяСтрокаОплаты);
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьПроверкуСтатусаЧека(Знач ТекущаяСтрокаОплаты)
    РезультатПроверкиСтатуса = ПолучитьСтатусЧекаСчетмашНаСервере(
            Новый Структура("external_id", ТекущаяСтрокаОплаты.external_id),
            ЭтотОбъект.Объект.ИдентификаторМагазина,
            ЭтотОбъект.Объект.Логин);

    Если РезультатПроверкиСтатуса.Успех = Ложь Тогда
        ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверкиСтатуса.ТекстСообщения);
        Возврат Ложь;
    КонецЕсли;

    ТекущаяСтрокаОплаты.status = РезультатПроверкиСтатуса.ДанныеОтвета.Статус;
    ТекущаяСтрокаОплаты.id_Чека = РезультатПроверкиСтатуса.ДанныеОтвета.Идентификатор;
    ТекущаяСтрокаОплаты.total = РезультатПроверкиСтатуса.ДанныеОтвета.Данные.total;
    Возврат Истина;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатусЧекаСчетмашНаСервере(Знач СтруктураИдентификатора, Знач ИдентификаторМагазина, Знач Логин)
    РезультатПроверкиСтатуса = ГП_СчетмашAPI.ПолучитьСтатусЧекаСчетмаш(
            СтруктураИдентификатора, ИдентификаторМагазина, Логин);
    Возврат РезультатПроверкиСтатуса;
КонецФункции

#КонецОбласти // РаботаСЧеками

#КонецОбласти // СлужебныеПроцедурыИФункции
