// Гарант+ Килипенко 22.01.2025 Сохранение ставки НДС при изменении Договора ++
&ИзменениеИКонтроль("ДоговорКонтрагентаПриИзмененииНаСервере")
Процедура ГП_ДоговорКонтрагентаПриИзмененииНаСервере(СтрокаПлатеж, Форма)

    Объект = Форма.Объект;

    ПараметрыОбъекта = ПоступлениеНаРасчетныйСчетФормыКлиентСервер.ТекущиеПараметрыОбъекта(Форма);
    ПараметрыОбъекта.ДоговорКонтрагента = СтрокаПлатеж.ДоговорКонтрагента;
    Форма.СвойстваПлатежа = ПоступлениеНаРасчетныйСчетФормыКлиентСервер.СвойстваСтрокРасшифровкиПлатежа(ПараметрыОбъекта, Ложь);
    #Вставка // Гарант+ Килипенко 22.01.2025 Сохранение ставки НДС при изменении Договора ++
    
    Если Форма.СвойстваПлатежа.Свойство("СтавкаНДС") И Форма.СвойстваПлатежа.СтавкаНДС <> СтрокаПлатеж.СтавкаНДС Тогда
        Форма.СвойстваПлатежа.СтавкаНДС = СтрокаПлатеж.СтавкаНДС; // Сохраняем исходную ставку НДС
        ОбщегоНазначения.СообщитьПользователю("Внимание! Ставка НДС осталась без изменений");
    КонецЕсли;
    
    #КонецВставки // Гарант+ Килипенко 22.01.2025 Сохранение ставки НДС при изменении Договора --

    ЗаполнитьЗначенияСвойств(СтрокаПлатеж, Форма.СвойстваПлатежа,, "СуммаПлатежа");

    ПараметрыЗаполненияСчетовУчета = ПоступлениеНаРасчетныйСчетФормыКлиентСервер.НачатьЗаполнениеСчетовУчета(
    "РасшифровкаПлатежа.ДоговорКонтрагента", Объект, СтрокаПлатеж);
    Изменения = СчетаУчетаВДокументах.ЗаполнитьРеквизитыПриИзменении(
    Документы.ПоступлениеНаРасчетныйСчет,
    ПараметрыЗаполненияСчетовУчета.КЗаполнению,
    Объект,
    "РасшифровкаПлатежа",
    СтрокаПлатеж,
    Ложь);
    ЗаполнитьЗначенияСвойств(СтрокаПлатеж,          Изменения);
    ЗаполнитьЗначенияСвойств(Форма.СвойстваПлатежа, Изменения);

    Если Форма.ПрименениеУСН Или Форма.ПрименяетсяАУСН Тогда
        ПоступлениеНаРасчетныйСчетФормыКлиентСервер.ЗаполнитьОтражениеСтрокиВУСН(СтрокаПлатеж, Форма);
    КонецЕсли;

    ЗаполнитьЗначенияСвойств(СтрокаПлатеж, Форма.СвойстваПлатежа,, "СуммаПлатежа");

    ПоступлениеНаРасчетныйСчетФормыКлиентСервер.ПересчитатьСуммуНДС(СтрокаПлатеж);
    ПоступлениеНаРасчетныйСчетФормыКлиентСервер.РассчитатьСуммуВзаиморасчетов(СтрокаПлатеж, Форма);

    Если ПоступлениеНаРасчетныйСчетФормыКлиентСервер.ФормаДокументаОднострочная(Форма) Тогда
        Если ЗначениеЗаполнено(Форма.РасшифровкаПлатежаДоговорКонтрагента) Тогда
            Форма.ЕстьРасчетыВУсловныхЕдиницах = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
            Форма.РасшифровкаПлатежаДоговорКонтрагента, "РасчетыВУсловныхЕдиницах");
        Иначе
            Форма.ЕстьРасчетыВУсловныхЕдиницах = Ложь;
        КонецЕсли;
    Иначе
        ЗаполнитьДобавленныеКолонкиТаблиц(Форма);
    КонецЕсли;

    Если ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента) Тогда
        Если ЗначениеЗаполнено(СтрокаПлатеж.СчетНаОплату) Тогда
            ДоговорСчетаПокупателю = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПлатеж.СчетНаОплату, "ДоговорКонтрагента");
            Если ЗначениеЗаполнено(ДоговорСчетаПокупателю)
                И ДоговорСчетаПокупателю <> СтрокаПлатеж.ДоговорКонтрагента Тогда
                СтрокаПлатеж.СчетНаОплату = Неопределено;
            КонецЕсли;
        КонецЕсли;
        Форма.ПредлагатьНовыйДоговор = Ложь;
    КонецЕсли;
    УправлениеФормой(Форма);

КонецПроцедуры
// Гарант+ Килипенко 22.01.2025 Сохранение ставки НДС при изменении Договора --
