// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьПризнакНегативноеВоздействие(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнено обновление значений признака ""ЭтоНегативноеВоздействие"" для всех записей регистра");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    // Заполнение / обновление значений признака Негативное воздействие
    РезультатЗаполнения = ЗаполнитьПризнакНегативноеВоздействиеНаСервере();

    // Вывод сообщения о результате
    СообщениеПользователю = "";
    Если РезультатЗаполнения.Успех = Ложь Тогда
        СообщениеПользователю = СтрШаблон("Процедура заполнения не выполнена.
                |Информация об ошибке: %1", РезультатЗаполнения.СообщениеОбОшибке);
    Иначе
        СообщениеПользователю = СтрШаблон("Заполнение данных выполнено успешно
                |Заполнены значения для ""%1"" записей.", РезультатЗаполнения.КоличествоИзмененныхСтрок);
    КонецЕсли;

    ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --

// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область СлужебныеПроцедурыИФункции

// Заполняет значения признака `ЭтоНегативноеВоздействиеЦСВ` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
&НаСервере
Функция ЗаполнитьПризнакНегативноеВоздействиеНаСервере()
    Возврат РегистрыСведений.ГП_УслугиБП77.ЗаполнитьПризнакНегативноеВоздействие();
КонецФункции

#КонецОбласти
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --
