// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьПризнакНегативноеВоздействие(Команда)
    // Предупреждение пользователю о необратимости операции
    Если ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
        "Будет выполнено обновление значений признака ""ЭтоНегативноеВоздействие"" для всех записей регистра") = Ложь Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьПризнакНегативноеВоздействиеНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --

// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область СлужебныеПроцедурыИФункции

//
&НаСервере
Функция ЗаполнитьПризнакНегативноеВоздействиеНаСервере()
    Возврат Неопределено;
КонецФункции

#КонецОбласти
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --
