// Гарант+ Килипенко 01.11.2024 [F00230427] Создание регистрации оплаты на основании поступления ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
    ГП_СоздатьКомандуСоздатьДокументРасчетовНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 01.11.2024 [F00230427] Создание регистрации оплаты на основании поступления --

// Гарант+ Килипенко 01.11.2024 [F00230427] Создание регистрации оплаты на основании поступления ++
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ГП_СоздатьДокументРасчетовПриНажатии()

КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// Гарант+ Килипенко 01.11.2024 [F00230427] Создание регистрации оплаты на основании поступления --

// Гарант+ Килипенко 01.11.2024 [F00230427] Создание регистрации оплаты на основании поступления ++
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ГП_СоздатьКомандуСоздатьДокументРасчетовНаСервере()
    Результат = Новый Структура("Кнопка, Команда");

    // Создание команды формы
    Результат.Команда = ЭтотОбъект.Команды.Добавить("ГП_СоздатьДокументРасчетов");
    Результат.Команда.Заголовок = "Создать док. расчетов";
    Результат.Команда.Действие = Результат.Команда.Имя + "ПриНажатии";

    // Создание элемента формы
    ПараметрыКнопки = Новый Структура("Заголовок, ИмяКоманды, Видимость");
    ПараметрыКнопки.Заголовок = Результат.Команда.Заголовок;
    ПараметрыКнопки.ИмяКоманды = Результат.Команда.Имя;
    ПараметрыКнопки.Видимость = Истина;

    Результат.Кнопка = ГП_РаботаСФормамиКлиентСервер.СоздатьКнопкуФормы(Результат.Команда.Имя, ПараметрыКнопки, ЭтотОбъект,
            "ГруппаВажныеКоманды", "ФормаОбщаяКомандаПоказатьДвиженияДокумента");

    Возврат Результат;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 01.11.2024 [F00230427] Создание регистрации оплаты на основании поступления --
