#Область ПрограммныйИнтерфейс

#Область Константы

#Область Услуги

// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьУслугуХолодноеВодоснабжение() Экспорт
    Возврат ПолучитьУслугуПоКоду("00-001");
КонецФункции

// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьУслугуГорячееВодоснабжение() Экспорт
    Возврат ПолучитьУслугуПоКоду("00-003");
КонецФункции

// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьУслугуКанализации() Экспорт
    Возврат ПолучитьУслугуПоКоду("00-008");
КонецФункции

// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьУслугуПодогреваХолоднойВоды() Экспорт
    Возврат ПолучитьУслугуПоКоду("00-002");
КонецФункции

// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьУслугуНегативногоВоздействияНаЦСВ() Экспорт
    Возврат ПолучитьУслугуПоКоду("00-006");
КонецФункции

// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьУслугуВодоотведениеХолоднойВоды() Экспорт
    Возврат ПолучитьУслугуПоКоду("00-005");
КонецФункции

// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьУслугуПлатаЗаХолодноеВодоснабжениеОИ() Экспорт
    Возврат ПолучитьУслугуПоКоду("00-009");
КонецФункции

// Гарант+ Килипенко 07.10.2024 [F00230765] перенос счетчиков Потерь воды (по среднему) ++
//
// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьУслугуПотериВоды() Экспорт
    Возврат ПолучитьУслугуПоКоду("00-012");
КонецФункции // // Гарант+ Килипенко 07.10.2024 [F00230765] перенос счетчиков Потерь воды (по среднему) --

// Возвращаемое значение:
//  - Структура из КлючИЗначение
//      * Ключ - Строка
//      * Значение - Структура
//          ** Ссылка - СправочникСсылка.КВП_Услуги
//          ** Код - Строка
//          ** Наименование - Строка
Функция ПолучитьОбязательныеУслуги() Экспорт
    РезультатФункции = Новый Структура;

    РезультатФункции.Вставить("ХолодноеВодоснабжение", ПолучитьУслугуХолодноеВодоснабжение());
    РезультатФункции.Вставить("ГорячееВодоснабжение", ПолучитьУслугуГорячееВодоснабжение());
    РезультатФункции.Вставить("Канализации", ПолучитьУслугуКанализации());
    РезультатФункции.Вставить("ПодогревХолоднойВоды", ПолучитьУслугуПодогреваХолоднойВоды());
    РезультатФункции.Вставить("НегативноеВоздействияНаЦСВ", ПолучитьУслугуНегативногоВоздействияНаЦСВ());
    РезультатФункции.Вставить("ВодоотведениеХолоднойВоды", ПолучитьУслугуВодоотведениеХолоднойВоды());
    РезультатФункции.Вставить("ХолодноеВодоснабжениеОИ", ПолучитьУслугуПлатаЗаХолодноеВодоснабжениеОИ());
    РезультатФункции.Вставить("ПотериВоды", ПолучитьУслугуПотериВоды());

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // Услуги

#КонецОбласти // Константы

#КонецОбласти // ПрограммныйИнтерфейс

// Гарант+ Килипенко 24.07.2024 [F00226318] заполнение регистра сведений Зависимость услуг ++
#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Код - Строка
//  ИгнорироватьПомеченныеНаУдаление - Булево
// Возвращаемое значение:
//  - Структура
//      * Ссылка - СправочникСсылка.КВП_Услуги
//      * Код - Строка
//      * Наименование - Строка
Функция ПолучитьУслугуПоКоду(Знач Код, Знач ИгнорироватьПомеченныеНаУдаление = Истина) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   КВП_Услуги.Ссылка КАК Ссылка,
        |   КВП_Услуги.Код КАК Код,
        |   КВП_Услуги.Наименование КАК Наименование
        |ИЗ
        |   Справочник.КВП_Услуги КАК КВП_Услуги
        |ГДЕ
        |   КВП_Услуги.Код = &Код
        |   И КВП_Услуги.ПометкаУдаления = ЛОЖЬ
        |";

    Запрос.УстановитьПараметр("Код", Код);
    Если ИгнорироватьПомеченныеНаУдаление = Ложь Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КВП_Услуги.ПометкаУдаления = ЛОЖЬ", "");
    КонецЕсли;

    РезультатЗапроса = Запрос.Выполнить();
    ТаблицаУслуг = РезультатЗапроса.Выгрузить();

    Если ТаблицаУслуг.Количество() <> 1 Тогда
        ВызватьИсключение(СтрШаблон("Ошибка при получении услуги с кодом ""%1"". %2",
                Код,
                ?(ТаблицаУслуг.Количество() > 1, "Код услуги не уникален.", "Услуга отсутствует в ИБ.")));
    КонецЕсли;

    РезультатФункции = Новый Структура("Ссылка, Код, Наименование");
    ЗаполнитьЗначенияСвойств(РезультатФункции, ТаблицаУслуг[0]);

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс
// Гарант+ Килипенко 24.07.2024 [F00226318] заполнение регистра сведений Зависимость услуг --
