// Гарант+ Килипенко 20.11.2024 [F00231190] Формирование наименования л/с при открытии ++
#Область СлужебныеПроцедурыИФункции

&НаСервере
&После ("УстановкаНомераЛицевогоСчета")
Процедура ГП_УстановкаНомераЛицевогоСчета()
    ТекущийОтветственныйСобственникЛС = ?(ЗначениеЗаполнено(ЭтотОбъект.Объект.КонтрагентДляВзаиморасчетов),
            ЭтотОбъект.Объект.КонтрагентДляВзаиморасчетов, мОтветственныйВладелец);

    Если ЗначениеЗаполнено(ТекущийОтветственныйСобственникЛС) = Истина
        И ЗначениеЗаполнено(ЭтотОбъект.Объект.Здание) = Истина Тогда

        НаименованиеКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
                ТекущийОтветственныйСобственникЛС, "Наименование");

        НаименованиеЗдания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
                ЭтотОбъект.Объект.Здание, "Наименование");

        ЭтотОбъект.Объект.ИмяЛицевогоСчета = СтрШаблон("%1 / %2", НаименованиеКонтрагента, НаименованиеЗдания);
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 20.11.2024 [F00231190] Формирование наименования л/с при открытии --
