// ++ Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика ++
#Область ПрограммныйИнтерфейс

// Создает документы Установка счетчика и Ввод показаний (начальных) счетчика
// Параметры:
//  ДатаДокумента - Дата, Неопределено
// Возвращаемое значение:
//  - Структура:
//      * Успех - Булево
//      * УстановленныеСчетчики - Массив из СправочникСсылка.КВП_Счетчики
//      * СообщениеОбОшибке - Строка, Неопределено
Функция СоздатьДокументыУстановкиСчетчиковБезВводаПоказаний(Знач ДатаДокумента = Неопределено) Экспорт
    РезультатФункции = Новый Структура("Успех, УстановленныеСчетчики, СообщениеОбОшибке", Истина, Новый Массив);

    ДанныеДляЗаполнения = ГП_МиграцияПриборовУчета.ПолучитьДанныеДляУстановкиСчетчиков(ДатаДокумента);
    Если ДанныеДляЗаполнения.Количество() = 0 Тогда
        Возврат РезультатФункции;
    КонецЕсли;

    ДатаДокумента = ?(ДатаДокумента = Неопределено, ТекущаяДатаСеанса(), ДатаДокумента);

    // Заполнение шапки документа КВП_УстановкаСчетчика
    НовыйУстановкаСчетчиковОбъект = Документы.КВП_УстановкаСчетчика.СоздатьДокумент();
    НовыйУстановкаСчетчиковОбъект.Дата = ДатаДокумента;
    НовыйУстановкаСчетчиковОбъект.ВидОперации = Перечисления.УПЖКХ_ВидыОперацийУстановкаСчетчика.ВключитьСчетчик;
    НовыйУстановкаСчетчиковОбъект.ВвестиНачальныеИлиКонечныеПоказания = Ложь; // Показания счетчиков не вводятся
    НовыйУстановкаСчетчиковОбъект.Ответственный = Пользователи.ТекущийПользователь();
    НовыйУстановкаСчетчиковОбъект.Комментарий = "#создан автоматически по данным из БП 7.7 (ГарантПлюс)";

    // Заполнение шапки документа УПЖКХ_ВводПоказанийСчетчика
    НовыйВводПоказаний = Документы.УПЖКХ_ВводПоказанийСчетчика.СоздатьДокумент();
    НовыйВводПоказаний.Дата = ДатаДокумента;
    НовыйВводПоказаний.ВводНачальныхПоказаний = Истина;
    НовыйВводПоказаний.ВидОперации = Перечисления.КВП_ВидыОперацийВводаПоказанийСчетчика.ВводПоказанииСчетчикаНаЛицевойСчет;
    НовыйВводПоказаний.Ответственный = Пользователи.ТекущийПользователь();
    НовыйВводПоказаний.Комментарий = "#создан автоматически по данным из БП 7.7 (ГарантПлюс)";

    // Заполнение ТЧ Главная
    Для Каждого СтрокаДанных Из ДанныеДляЗаполнения Цикл
        // КВП_УстановкаСчетчика
        НоваяЗаписьУстановки = НовыйУстановкаСчетчиковОбъект.Главная.Добавить();
        НоваяЗаписьУстановки.Объект = СтрокаДанных.ЛицевойСчет;
        НоваяЗаписьУстановки.Счетчик = СтрокаДанных.Счетчик;
        НоваяЗаписьУстановки.ДатаВключения = СтрокаДанных.ДатаУстановки;
        НоваяЗаписьУстановки.ДатаПоверки = СтрокаДанных.ДатаПоверки;

        // УПЖКХ_ВводПоказанийСчетчика
        НоваяЗаписьПоказаний = НовыйВводПоказаний.Главная.Добавить();
        НоваяЗаписьПоказаний.Объект = СтрокаДанных.ЛицевойСчет;
        НоваяЗаписьПоказаний.Услуга = СтрокаДанных.Услуга;
        НоваяЗаписьПоказаний.Счетчик = СтрокаДанных.Счетчик;
        НоваяЗаписьПоказаний.ДатаПоказания = СтрокаДанных.ДатаПоказания;
        НоваяЗаписьПоказаний.ДневноеПоказание = СтрокаДанных.Показание;
        НоваяЗаписьПоказаний.КоэффициентТрансформации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.Счетчик, "Коэффициент");
        НоваяЗаписьПоказаний.Разрядность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.Счетчик, "Разрядность");
        НоваяЗаписьПоказаний.ТемпературныйКоэффициент = 1.0; //! Уточнить
        НоваяЗаписьПоказаний.КоэффициентЧислитель = 1.0; //! Уточнить
        НоваяЗаписьПоказаний.КоэффициентЗнаменатель = 1.0; //! Уточнить

        // Заполнение результата
        РезультатФункции.УстановленныеСчетчики.Добавить(СтрокаДанных.Счетчик);
    КонецЦикла;

    // Запись документа
    НачатьТранзакцию();
    Попытка
        НовыйУстановкаСчетчиковОбъект.Записать(РежимЗаписиДокумента.Запись);
        НовыйВводПоказаний.Записать(РежимЗаписиДокумента.Запись);

        ЗафиксироватьТранзакцию(); // Записано успешно
    Исключение
        ОтменитьТранзакцию();

        ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
            "Ошибка при создании документа Установка счетчика (Ввод показаний) при заполнении по данным из БП 7.7.",
            УровеньЖурналаРегистрации.Ошибка, , ,
            ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

        РезультатФункции.КоличествоЗаписанныхПоказаний = 0;
        РезультатФункции.СообщениеОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
        РезультатФункции.Успех = Ложь;
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// -- Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика --
