// ++ Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика ++
#Область ПрограммныйИнтерфейс

// Параметры:
//  ДатаДокумента - Дата, Неопределено
// Возвращаемое значение:
//  - Структура:
//      * Успех - Булево
//      * УстановленныеСчетчики - Массив из СправочникСсылка.КВП_Счетчики
Функция СоздатьДокументыУстановкиСчетчиков(Знач ДатаДокумента = Неопределено) Экспорт
    РезультатФункции = Новый Структура("Успех, УстановленныеСчетчики", Истина, Новый Массив);

    ДанныеДляЗаполнения = ГП_МиграцияПриборовУчета.ПолучитьДанныеДляУстановкиСчетчиков();
    Если ДанныеДляЗаполнения.Количество() = 0 Тогда
        Возврат РезультатФункции;
    КонецЕсли;

    ДатаДокумента = ?(ДатаДокумента = Неопределено, ТекущаяДатаСеанса(), ДатаДокумента);

    НовыйУстановкаСчетчиковОбъект = Документы.КВП_УстановкаСчетчика.СоздатьДокумент();
    НовыйУстановкаСчетчиковОбъект.Дата = ДатаДокумента;
    НовыйУстановкаСчетчиковОбъект.Ответственный = Пользователи.ТекущийПользователь();
    НовыйУстановкаСчетчиковОбъект.ВидОперации = Перечисления.УПЖКХ_ВидыОперацийУстановкаСчетчика.ВключитьСчетчик;

    // Заполнение ТЧ Главное
    Для каждого СтрокаДанных Из ДанныеДляЗаполнения Цикл
        НоваяЗапись = НовыйУстановкаСчетчиковОбъект.Главное.Добавить();
        НоваяЗапись.Объект = СтрокаДанных.ЛицевойСчет;
    КонецЦикла;

КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// -- Гарант+ Килипенко 25.07.2024 [F00226454] заполнение документов Установка счетчика --
