// Гарант+ Килипенко 27.10.2024 [F00229946] Адаптация к версии 3.0.158.1 ++
//  ~~~ Удалено. т.к. в типовом решении исправляемая ошибка устранена ~~~
//
//&ИзменениеИКонтроль("КомандыПечатиОбъекта")
//Функция ГП_КомандыПечатиОбъекта(ОбъектМетаданных, СПечатнымиФормами)
//    КомандыПечати = СоздатьКоллекциюКомандПечати();
//    Если ТипЗнч(ОбъектМетаданных) <> Тип("ОбъектМетаданных") Тогда 
//        Возврат КомандыПечати;
//    КонецЕсли;	

//    Источники = ПодключаемыеКоманды.ДеревоИсточниковКоманд();
//    НастройкиAPI = ПодключаемыеКоманды.НастройкиПрограммногоИнтерфейсаПодключаемыхОбъектов();
//    ПодключенныеОтчетыИОбработки = ПодключаемыеКоманды.ТаблицаПодключаемыхОбъектов(НастройкиAPI);
//    Источник = ПодключаемыеКоманды.ЗарегистрироватьИсточник(ОбъектМетаданных, Источники, ПодключенныеОтчетыИОбработки, НастройкиAPI);
//    Если Источник.Менеджер = Неопределено Тогда
//        Возврат КомандыПечати;
//    КонецЕсли;

//    ДобавляемыеКомандыПечати = СоздатьКоллекциюКомандПечати();
//    Если НастройкиПечатиОбъекта(Источник.Менеджер).ПриДобавленииКомандПечати Тогда
//        #Удаление // Гарант+ временное решение для устранения ошибки
//        Источник.Менеджер.ДобавитьКомандыПечати(ДобавляемыеКомандыПечати);
//        #КонецУдаления
//        #Вставка // Гарант+ временное решение для устранения ошибки
//        Попытка
//            Источник.Менеджер.ДобавитьКомандыПечати(ДобавляемыеКомандыПечати);
//        Исключение
//            ОбщегоНазначения.СообщитьПользователю(
//                ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//        КонецПопытки;
//        #КонецВставки
//    КонецЕсли;

//    Если СПечатнымиФормами Тогда
//        ДобавитьКомандыПечати(ДобавляемыеКомандыПечати, ОбъектМетаданных);
//    КонецЕсли;

//    Для Каждого КомандаПечати Из ДобавляемыеКомандыПечати Цикл
//        Если КомандаПечати.МенеджерПечати = Неопределено Тогда
//            КомандаПечати.МенеджерПечати = Источник.ПолноеИмя;
//        КонецЕсли;
//        Если КомандаПечати.Порядок = 0 Тогда
//            КомандаПечати.Порядок = 50;
//        КонецЕсли;
//        ЗаполнитьЗначенияСвойств(КомандыПечати.Добавить(), КомандаПечати);
//    КонецЦикла;

//    Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки") Тогда
//        МодульДополнительныеОтчетыИОбработки = ОбщегоНазначения.ОбщийМодуль("ДополнительныеОтчетыИОбработки");
//        МодульДополнительныеОтчетыИОбработки.ПриПолученииКомандПечати(КомандыПечати, Источник.ПолноеИмя);
//    КонецЕсли;

//    ЗарплатаКадры.ПриПолученииКомандПечати(КомандыПечати, Источник.ПолноеИмя);
//    УправлениеПечатьюПереопределяемый.ПриПолученииКомандПечати(Источник.ПолноеИмя, КомандыПечати);

//    КомандыПечати.Индексы.Добавить("МенеджерПечати");
//    Найденные = ПодключенныеОтчетыИОбработки.НайтиСтроки(Новый Структура("ДобавитьКомандыПечати", Истина));
//    Для Каждого ПодключенныйОбъект Из Найденные Цикл
//        ПодключенныйОбъект.Менеджер.ДобавитьКомандыПечати(КомандыПечати);
//        ДобавленныеКоманды = КомандыПечати.НайтиСтроки(Новый Структура("МенеджерПечати", Неопределено));
//        Для Каждого Команда Из ДобавленныеКоманды Цикл
//            Команда.МенеджерПечати = ПодключенныйОбъект.ПолноеИмя;
//        КонецЦикла;
//    КонецЦикла;

//    ТипОбъекта = Неопределено;
//    Если ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(ОбъектМетаданных) Тогда
//        ТипОбъекта = Тип(СтрЗаменить(ОбъектМетаданных.ПолноеИмя(), ".", "Ссылка."));
//    КонецЕсли;

//    Для Каждого КомандаПечати Из КомандыПечати Цикл
//        КомандаПечати.ДополнительныеПараметры.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", КомандаПечати.ДополнитьКомплектВнешнимиПечатнымиФормами);
//        Если ЗначениеЗаполнено(ТипОбъекта) И ЗначениеЗаполнено(КомандаПечати.УсловияВидимости) Тогда
//            КомандаПечати.УсловияВидимостиПоТипамОбъектов.Вставить(ТипОбъекта, КомандаПечати.УсловияВидимости);
//        КонецЕсли;
//    КонецЦикла;

//    КомандыПечати.Сортировать("Порядок Возр, Представление Возр");
//    ИсправитьПризнакПроверкаПроведенияПередПечатью(КомандыПечати, ОбъектМетаданных);
//    УстановитьНастройкиКомандПечати(КомандыПечати, Источник.СсылкаМетаданных);
//    ОпределитьВидимостьКомандПечатиПоФункциональнымОпциям(КомандыПечати);

//    КомандыПечати.Индексы.Добавить("УникальныйИдентификатор");
//    Возврат КомандыПечати;
//КонецФункции
// Гарант+ Килипенко 27.10.2024 [F00229946] Адаптация к версии 3.0.158.1 --