// Гарант+ Килипенко 25.09.2024 [F00228821] Доработка отчета КВП_СводнаяВедомость ++
#Область СлужебныеПроцедурыИФункции

// Устарела. Не используется - будет удалена
//
&Перед ("ПередКомпоновкойМакета")
Процедура ГП_ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек)
    // Добавление поля Договор (ДоговорДляВзаиморасчетов) в текст запроса
    // !!! Не используется - будет удалено
    // !!! Схема.НаборыДанных.ЗапросДанных.Запрос = ГП_ДобавитьДоговорВТекстОсновногоЗапроса(Схема.НаборыДанных.ЗапросДанных.Запрос);
КонецПроцедуры

// Устарела. Не используется - будет удалена
//
// Параметры:
//  ТекстЗапроса - Строка
// Возвращаемое значение:
//  - Строка - Модифицированный текст запроса, если запрос уже содержит добавляемое поле возвращает исходный текст запроса
Функция ГП_ДобавитьДоговорВТекстОсновногоЗапроса(Знач ТекстЗапроса)
    ТекстПизанкаДобавленногоДоговора = "УПЖКХ_СведенияДляВзаиморасчетовПоЛССрезПоследних.Договор";
    Если СтрНайти(ТекстЗапроса, ТекстПизанкаДобавленногоДоговора) > 0 Тогда
        Возврат ТекстЗапроса; // Договор уже добавлен в текст запроса
    КонецЕсли;

    // Добавление поля ДоговорДляВзаиморасчетов
    ТекстДляЗаменыЗапроса = "УПЖКХ_СведенияДляВзаиморасчетовПоЛССрезПоследних.Контрагент КАК КонтрагентДляВзаиморасчетов";
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
            ТекстДляЗаменыЗапроса,
            СтрШаблон(
                "%1,
                |%2",
                ТекстДляЗаменыЗапроса,
                "ЕСТЬNULL(УПЖКХ_СведенияДляВзаиморасчетовПоЛССрезПоследних.Договор"
                + ", ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК ДоговорДляВзаиморасчетов"));

    // Добавление поля условного выбора ДоговорДляВзаиморасчетов
    ТекстДляЗаменыЗапроса = "КонтрагентДляВзаиморасчетов.*";
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
            ТекстДляЗаменыЗапроса,
            СтрШаблон(
                "%1,
                |%2",
                ТекстДляЗаменыЗапроса,
                "ДоговорДляВзаиморасчетов.*"));

    Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 25.09.2024 [F00228821] Доработка отчета КВП_СводнаяВедомость --
