// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 ++
#Область ОбработчикиКомандФормы

// Выполняет создание новых объектов `Договоры` по данным из регистра `ГП_ДокументыБП77` для перенесенных ГарантПлюс Контрагентов
//  Создается только основные договоры контрагентов. Созданным договорам будет назначен владелец - Контрагент
&НаКлиенте
Асинх Процедура СоздатьОсновныеДоговоры(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнена операция создания основных договоров"
            + " для контрагентов созданных автоматически по данным БП 7.7. (перенесенных ГарантПлюс).");
    Если РезультатДиалога = Ложь Тогда
        Возврат; // Пользователь отказался от выполнения операции
    КонецЕсли;

    // Создание объектов документов
    РезультатСоздания = СоздатьОсновныеДоговорыНаСервере();

    // Вывод сообщения о результате
    ТекстСообщенияРезультатОперации = "";
    Если РезультатСоздания.Успех = Ложь Тогда
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание договоров не выполнено.
                |Сообщение о причине: %1", РезультатСоздания.ТекстСообщения);
    Иначе
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание договоров выполнено успешно.
                |Создано ""%1"" договоров.", РезультатСоздания.СозданныеДоговоры.Количество());
    КонецЕсли;
    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРезультатОперации);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 --

// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 ++
#Область СлужебныеПроцедурыИФункции

// Создает новые объекты `Договоры` по данным из регистра `ГП_ДокументыБП77` для перенесенных ГарантПлюс Контрагентов (абонентов)
//  Создается только основные договоры контрагентов. Созданным договорам будет назначен владелец - Контрагент
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * СозданныеДоговоры - Массив из СправочникСсылка.ДоговорыКонтрагентов
//      * ТекстСообщения - Строка, Неопределено
&НаСервереБезКонтекста
Функция СоздатьОсновныеДоговорыНаСервере()
    Возврат ГП_МиграцияДоговоров.СоздатьОсновныеДоговорыДляПеренесенныхКонтрагентов();
КонецФункции

#КонецОбласти
// Гарант+ Килипенко 08.08.2024 [F00227208] перенос контрагентов из БП77 --
