&ИзменениеИКонтроль("ЗаполнитьСведенияОПокупателяхУПД")
Процедура lc_ЗаполнитьСведенияОПокупателяхУПД1(ДеревоДанных, ДанныеДляФормированияЭД)

	ДанныеДокументаУчета = ДанныеДляФормированияЭД.ДанныеДокументаУчета;
	ДанныеШапки = ДанныеДокументаУчета.ДанныеШапки;

	СведенияОПокупателях = Новый Массив;
	Если ДанныеДляФормированияЭД.ЭтоСводныйСчетФактура
			И ДанныеШапки.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
		СведенияОПокупателях = ДанныеШапки.СведенияОПокупателях;
	Иначе
		Если ЗначениеЗаполнено(ДанныеШапки.Покупатель) Тогда
			Контрагент = ДанныеШапки.Покупатель;
			СведенияОПокупателе = ПолучитьДанныеЮрФизЛица(ДанныеШапки.Покупатель, ДанныеШапки.Дата);
			СведенияОПокупателе.ИНН = ДанныеШапки.ИННпокупателя;
			СведенияОПокупателе.КПП = ДанныеШапки.КППпокупателя;
			#Вставка
			//ГП 12/07/22 ++
			// Для определенных контрагентов в качестве покупателя необходимо устанавливать головного контрагента
			ГоловнойКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеШапки.Покупатель,"ГоловнойКонтрагент");
			Если ЗначениеЗаполнено(ГоловнойКонтрагент) Тогда
				GUID = Новый УникальныйИдентификатор("83af1d70-ecf3-11ea-bbae-6c2b598bafab");
				Если ГоловнойКонтрагент.УникальныйИдентификатор() = GUID Тогда
					СведенияОПокупателе = ПолучитьДанныеЮрФизЛица(ГоловнойКонтрагент, ДанныеШапки.Дата);
					СведенияОПокупателе.КПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеШапки.Покупатель,"КПП");
				КонецЕсли;
			КонецЕсли;
			//ГП 12/07/22 --
			#КонецВставки
		Иначе
			Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДокументаУчета.Ссылка, "Контрагент");
			СведенияОПокупателе = ПолучитьДанныеЮрФизЛица(Контрагент, ДанныеШапки.Дата);
			#Вставка
			//ГП 12/07/22 ++
			// Для определенных контрагентов в качестве покупателя необходимо устанавливать головного контрагента
			ГоловнойКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент,"ГоловнойКонтрагент");
			Если ЗначениеЗаполнено(ГоловнойКонтрагент) Тогда
				GUID = Новый УникальныйИдентификатор("83af1d70-ecf3-11ea-bbae-6c2b598bafab");
				Если ГоловнойКонтрагент.УникальныйИдентификатор() = GUID Тогда
					СведенияОПокупателе = ПолучитьДанныеЮрФизЛица(ГоловнойКонтрагент, ДанныеШапки.Дата);
					СведенияОПокупателе.КПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент,"КПП");
				КонецЕсли;
			КонецЕсли;
			//ГП 12/07/22 --
			#КонецВставки
		КонецЕсли;
		СведенияОПокупателях.Добавить(СведенияОПокупателе);

		Если ДанныеДокументаУчета.Свойство("ШтрихкодыУпаковок")
				И ДанныеДокументаУчета.ШтрихкодыУпаковок <> Неопределено
				И ДанныеДокументаУчета.ШтрихкодыУпаковок.Количество() > 0 Тогда
			СписокВидовПродукции = ОбщегоНазначения.ВыгрузитьКолонку(ДанныеДокументаУчета.ШтрихкодыУпаковок, "ВидПродукции", Истина);
			УчастникСистемыМаркировки = РегистрыСведений.СтатусыКонтрагентовИСМП.УчастникСистемыМаркировки(Контрагент, СписокВидовПродукции);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
				"СведенияОВыбытииМаркированныхТоваров",
				?(УчастникСистемыМаркировки = ЛОЖЬ, 1, 0));
		КонецЕсли;
	КонецЕсли;

	// ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС
	Для каждого Покупатель Из СведенияОПокупателях Цикл
		Если Не ЗначениеЗаполнено(ДанныеДляФормированияЭД.ИдентификаторМестаПоставкиЕИС) Тогда
			Продолжить;
		КонецЕсли;
		Покупатель.Вставить("ИдентификаторМестаПоставкиЕИС", ДанныеДляФормированияЭД.ИдентификаторМестаПоставкиЕИС);
	КонецЦикла;
	// Конец ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС

	ПараметрыУчастников = НовыйПараметрыУчастников();
	ПараметрыУчастников.СведенияОбУчастниках = СведенияОПокупателях;
	ПараметрыУчастников.ЭтоФормат502 = ДанныеДляФормированияЭД.ЭтоФормат502;
	ПараметрыУчастников.ВидУчастника = ВидыУчастниковЭД().Покупатель;
	ПараметрыУчастников.ПутьВДеревеУчастники = ?(ДанныеДляФормированияЭД.ЭтоФормат502,
		"СведенияОСчетеФактуре.СведенияОПокупателях", "СведенияОПокупателе");
	ПараметрыУчастников.ПутьВДеревеУчастник = ?(ДанныеДляФормированияЭД.ЭтоФормат502,
		"СведенияОСчетеФактуре.СведенияОПокупателях.НомерСтроки.Покупатель", "");
	ПараметрыУчастников.ВидАдреса = ВидыАдресовЭД().Юридический;
	ПараметрыУчастников.ДатаСведений = ДанныеШапки.Дата;
	ПараметрыУчастников.ЭтоЭлектронноеАктированиеЕИС = ДанныеДляФормированияЭД.ЭтоЭлектронноеАктированиеЕИС;
	ПараметрыУчастников.ДанныеПриложенияЕИС = ДанныеДляФормированияЭД.ДанныеПриложенияЕИС;
	ПараметрыУчастников.ИдентификаторМестаПоставкиЕИС = ДанныеДляФормированияЭД.ИдентификаторМестаПоставкиЕИС;

	ЗаполнитьДанныеУчастниковУПД(ДеревоДанных, ПараметрыУчастников);

КонецПроцедуры
