// Гарант+ Килипенко 28.03.2025 [F00236447] испр. ошибка отсутствия свойства Защита ++ {
//
&ИзменениеИКонтроль("ПодготовитьКоллекциюПечатныхФорм")
Функция Рурешъ_ПодготовитьКоллекциюПечатныхФорм(Знач Идентификаторы)

	Результат = Новый ТаблицаЗначений;
	Для Каждого ИмяКолонки Из УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм() Цикл
		Результат.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;

    #Вставка // Гарант+ Килипенко 28.03.2025 [F00236447] испр. ошибка отсутствия свойства Защита ++ {
    //
	// РурешъНачалоИзменений 14.05.2021
    //    Макеты.Колонки.Добавить("ОфисныеДокументы");

    НаименованиеДополнительнойКолонки = "ОфисныеДокументы";
    Если Результат.Колонки.Найти(НаименованиеДополнительнойКолонки) = Неопределено Тогда
        Результат.Колонки.Добавить("ОфисныеДокументы");
    КонецЕсли;

	// РурешъКонецИзменений 14.05.2021
    //

    #КонецВставки // Гарант+ Килипенко 28.03.2025 [F00236447] испр. ошибка отсутствия свойства Защита -- }
    Если ТипЗнч(Идентификаторы) = Тип("Строка") Тогда
		Идентификаторы = СтрРазделить(Идентификаторы, ",");
	КонецЕсли;

	Для Каждого Идентификатор Из Идентификаторы Цикл
		ПечатнаяФорма = Результат.Найти(Идентификатор, "ИмяМакета");
		Если ПечатнаяФорма = Неопределено Тогда
			ПечатнаяФорма = Результат.Добавить();
			ПечатнаяФорма.ИмяМакета = Идентификатор;
			ПечатнаяФорма.ИмяВРЕГ = ВРег(Идентификатор);
			ПечатнаяФорма.Экземпляров = 1;
		Иначе
			ПечатнаяФорма.Экземпляров = ПечатнаяФорма.Экземпляров + 1;
		КонецЕсли;
	КонецЦикла;

	Результат.Индексы.Добавить("ИмяВРЕГ");
	Возврат Результат;

КонецФункции // Гарант+ Килипенко 28.03.2025 [F00236447] испр. ошибка отсутствия свойства Защита -- }
