ВЫБРАТЬ РАЗРЕШЕННЫЕ
	Резолюции.АвторРезолюции КАК АвторРезолюции,
	Резолюции.ДатаРезолюции КАК ДатаРезолюции,
	Резолюции.ТекстРезолюции КАК Резолюция,
	Резолюции.Документ КАК Ссылка
ПОМЕСТИТЬ ПоследняяРезолюция
ИЗ
	Справочник.Резолюции КАК Резолюции
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			МАКСИМУМ(ДокументПредприятияРезолюции.ДатаРезолюции) КАК ДатаРезолюции,
			ДокументПредприятияРезолюции.Документ КАК Ссылка
		ИЗ
			Справочник.Резолюции КАК ДокументПредприятияРезолюции
		ГДЕ
			НЕ ДокументПредприятияРезолюции.ПометкаУдаления

		СГРУППИРОВАТЬ ПО
			ДокументПредприятияРезолюции.Документ) КАК МаксРезолюции
		ПО Резолюции.ДатаРезолюции = МаксРезолюции.ДатаРезолюции
			И (МаксРезолюции.Ссылка = Резолюции.Документ)
ГДЕ
	НЕ Резолюции.ПометкаУдаления
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ
	ДокументПредприятия.РегистрационныйНомер КАК РегистрационныйНомер,
	ДокументПредприятия.ДатаРегистрации КАК ДатаРегистрации,
	ДокументПредприятия.ВидДокумента КАК ВидДокумента,
	ДокументПредприятия.Ссылка КАК Ссылка,
	ДокументПредприятия.Ссылка КАК ДокументПредприятия,
	ДокументПредприятия.Подготовил КАК Подготовил,
	ДокументПредприятия.ПодписанУтвержден КАК Утвердил,
	ДокументПредприятия.Дело КАК Дело,
	ДокументПредприятия.СрокИсполнения КАК ПлановыйСрокИсполнения,
	ДокументПредприятия.Зарегистрировал КАК Зарегистрировал,
	ДокументПредприятия.Папка КАК Папка,
	ДокументПредприятия.Организация КАК Организация,
	ДокументПредприятия.Ответственный КАК Ответственный,
	ПоследняяРезолюция.АвторРезолюции КАК АвторРезолюции,
	ПоследняяРезолюция.ДатаРезолюции КАК ДатаРезолюции,
	ПоследняяРезолюция.Резолюция КАК Резолюция,
	ДокументПредприятия.Проект КАК Проект,
	ДокументПредприятия.Валюта КАК Валюта,
	ДокументПредприятия.Сумма КАК Сумма,
	СостоянияДокументов.Период КАК ФактическийСрокИсполнения,
	ВЫБОР
		КОГДА СостоянияДокументов.Период ЕСТЬ NULL
			ТОГДА ЛОЖЬ
		ИНАЧЕ ИСТИНА
	КОНЕЦ КАК Исполнен,
	ДанныеДокументовПредприятия.ПредставлениеСостояния КАК ПредставлениеСостояния,
	ДокументПредприятия.ФормаДокумента КАК ФормаДокумента,
	ДокументПредприятия.Важность КАК Важность
ИЗ
	Справочник.ДокументыПредприятия КАК ДокументПредприятия
		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			ТекущиеСостоянияДокументов.Документ КАК Документ,
			МАКСИМУМ(ТекущиеСостоянияДокументов.ДатаУстановки) КАК Период
		ИЗ
			РегистрСведений.ТекущиеСостоянияДокументов КАК ТекущиеСостоянияДокументов
		ГДЕ
			ТекущиеСостоянияДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Исполнен)

		СГРУППИРОВАТЬ ПО
			ТекущиеСостоянияДокументов.Документ) КАК СостоянияДокументов
		ПО (СостоянияДокументов.Документ = ДокументПредприятия.Ссылка)
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДокументовПредприятия КАК ДанныеДокументовПредприятия
		ПО (ДанныеДокументовПредприятия.Документ = ДокументПредприятия.Ссылка)
		ЛЕВОЕ СОЕДИНЕНИЕ ПоследняяРезолюция КАК ПоследняяРезолюция
		ПО ДокументПредприятия.Ссылка = ПоследняяРезолюция.Ссылка
{ГДЕ
	(ИСТИНА В
				(ВЫБРАТЬ ПЕРВЫЕ 1
					ИСТИНА
				ИЗ
					РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
				ГДЕ
					КатегорииОбъектов.ОбъектДанных = ДокументПредприятия.Ссылка
					И КатегорииОбъектов.КатегорияДанных В (&СписокКатегорий))
			ИЛИ ЛОЖЬ В
				(ВЫБРАТЬ
					Константы.ИспользоватьКатегорииДанных
				ИЗ
					Константы КАК Константы)),
	(ДокументПредприятия.ПометкаУдаления = ЛОЖЬ
			ИЛИ &ПоказыватьПомеченныеНаУдаление = ИСТИНА),
	(ДокументПредприятия.ФормаДокумента = &ФормаДокумента),
	(&Состояние В
			(ВЫБРАТЬ
				РегистрСведений.ТекущиеСостоянияДокументов.Состояние
			ИЗ
				РегистрСведений.ТекущиеСостоянияДокументов
			ГДЕ
				РегистрСведений.ТекущиеСостоянияДокументов.Документ = ДокументПредприятия.Ссылка)),
	(ВЫБОР
			КОГДА ДокументПредприятия.РегистрационныйНомер <> ""
				ТОГДА ДокументПредприятия.ДатаРегистрации
			ИНАЧЕ ДокументПредприятия.ДатаСоздания
		КОНЕЦ МЕЖДУ &ДатаНачала И &ДатаОкончания),
	(ДокументПредприятия.РегистрационныйНомер = ""
				И &ПоказыватьДокументы = ЗНАЧЕНИЕ(Перечисление.ПоказыватьДокументы.НеЗарегистрированные)
			ИЛИ ДокументПредприятия.РегистрационныйНомер <> ""
				И &ПоказыватьДокументы = ЗНАЧЕНИЕ(Перечисление.ПоказыватьДокументы.Зарегистрированные)
			ИЛИ &ПоказыватьДокументы = ЗНАЧЕНИЕ(Перечисление.ПоказыватьДокументы.Все)),
	(ВЫБОР
			КОГДА &ДокументыСИстекающимСрокомДействия
				ТОГДА ДокументПредприятия.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
						И НЕ ДокументПредприятия.НеДействует
						И (ДокументПредприятия.Ответственный В (&Ответственные)
							ИЛИ ДокументПредприятия.Подготовил В (&Ответственные)
								И (ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = НЕОПРЕДЕЛЕНО))
						И ДокументПредприятия.ДатаОкончанияДействия >= &ТекущаяДата
						И ДокументПредприятия.ДатаОкончанияДействия <= КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2), ДЕНЬ)
			ИНАЧЕ ИСТИНА
		КОНЕЦ),
	(ВЫБОР
			КОГДА &ДокументыСИстекшимСрокомДействия
				ТОГДА ДокументПредприятия.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
						И НЕ ДокументПредприятия.НеДействует
						И (ДокументПредприятия.Ответственный В (&Ответственные)
							ИЛИ ДокументПредприятия.Подготовил В (&Ответственные)
								И (ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = НЕОПРЕДЕЛЕНО))
						И ДокументПредприятия.ДатаОкончанияДействия < &ТекущаяДата
						И ДокументПредприятия.ПорядокПродления = ЗНАЧЕНИЕ(Перечисление.ПорядокПродления.ДопускаетПродление)
			ИНАЧЕ ИСТИНА
		КОНЕЦ),
	(ВЫБОР
			КОГДА &ДокументыСИстекающимСрокомИсполнения
				ТОГДА ДокументПредприятия.СрокИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
						И НЕ ДокументПредприятия.НеДействует
						И (ДокументПредприятия.Ответственный В (&Ответственные)
							ИЛИ ДокументПредприятия.Подготовил В (&Ответственные)
								И (ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = НЕОПРЕДЕЛЕНО))
						И СостоянияДокументов.Период ЕСТЬ NULL
						И ДокументПредприятия.СрокИсполнения >= &ТекущаяДата
						И ДокументПредприятия.СрокИсполнения <= КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2), ДЕНЬ)
			ИНАЧЕ ИСТИНА
		КОНЕЦ),
	(ВЫБОР
			КОГДА &ДокументыПросроченные
				ТОГДА ДокументПредприятия.СрокИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
						И НЕ ДокументПредприятия.НеДействует
						И (ДокументПредприятия.Ответственный В (&Ответственные)
							ИЛИ ДокументПредприятия.Подготовил В (&Ответственные)
								И (ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = НЕОПРЕДЕЛЕНО))
						И СостоянияДокументов.Период ЕСТЬ NULL
						И ДокументПредприятия.СрокИсполнения < &ТекущаяДата
			ИНАЧЕ ИСТИНА
		КОНЕЦ)}
