ВЫБРАТЬ РАЗРЕШЕННЫЕ
	Резолюции.АвторРезолюции КАК АвторРезолюции,
	Резолюции.ДатаРезолюции КАК ДатаРезолюции,
	Резолюции.ТекстРезолюции КАК Резолюция,
	Резолюции.Документ КАК Ссылка
ПОМЕСТИТЬ ПоследняяРезолюция
ИЗ
	Справочник.Резолюции КАК Резолюции
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			МАКСИМУМ(ДокументПредприятияРезолюции.ДатаРезолюции) КАК ДатаРезолюции,
			ДокументПредприятияРезолюции.Документ КАК Ссылка
		ИЗ
			Справочник.Резолюции КАК ДокументПредприятияРезолюции
		ГДЕ
			НЕ ДокументПредприятияРезолюции.ПометкаУдаления

		СГРУППИРОВАТЬ ПО
			ДокументПредприятияРезолюции.Документ) КАК МаксРезолюции
		ПО Резолюции.ДатаРезолюции = МаксРезолюции.ДатаРезолюции
			И (МаксРезолюции.Ссылка = Резолюции.Документ)
ГДЕ
	НЕ Резолюции.ПометкаУдаления
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ
	ДокументПредприятия.РегистрационныйНомер КАК РегистрационныйНомер,
	ДокументПредприятия.ДатаРегистрации КАК ДатаРегистрации,
	ДокументПредприятия.ВидДокумента КАК ВидДокумента,
	ДокументПредприятия.Ссылка КАК Ссылка,
	ДокументПредприятия.Ссылка КАК ДокументПредприятия,
	ВЫРАЗИТЬ(ДокументПредприятия.Источник.Наименование КАК СТРОКА(100)) КАК Источник,
	ДокументПредприятия.Подготовил КАК Подготовил,
	ДокументПредприятия.ПодписанУтвержден КАК Утвердил,
	ДокументПредприятия.Дело КАК Дело,
	ДокументПредприятия.СрокИсполнения КАК ПлановыйСрокИсполнения,
	ДокументПредприятия.Зарегистрировал КАК Зарегистрировал,
	ДокументПредприятия.Папка КАК Папка,
	ДокументПредприятия.Организация КАК Организация,
	ДокументПредприятия.Ответственный КАК Ответственный,
	ПоследняяРезолюция.АвторРезолюции КАК АвторРезолюции,
	ПоследняяРезолюция.ДатаРезолюции КАК ДатаРезолюции,
	ПоследняяРезолюция.Резолюция КАК Резолюция,
	ДокументПредприятия.Проект КАК Проект,
	ДокументПредприятия.Валюта КАК Валюта,
	ДокументПредприятия.Сумма КАК Сумма,
	СостоянияДокументов.Период КАК ФактическийСрокИсполнения,
	ВЫБОР
		КОГДА СостоянияДокументов.Период ЕСТЬ NULL
			ТОГДА ЛОЖЬ
		ИНАЧЕ ИСТИНА
	КОНЕЦ КАК Исполнен,
	ДанныеДокументовПредприятия.ПредставлениеСостояния КАК ПредставлениеСостояния,
	ДокументПредприятия.ФормаДокумента КАК ФормаДокумента,
	ДокументПредприятия.Важность КАК Важность,
	ЗадачаПриложения.Ссылка КАК Поручение,
	ДокументПредприятия.доп_ТекущегоГода КАК СуммаТекущегоГода,
	ДокументПредприятия.доп_ПервогоГода КАК СуммаПервогоГода,
	ДокументПредприятия.доп_ВторогоГода КАК СуммаВторогоГода
ПОМЕСТИТЬ ВТ_Поручение
ИЗ
	Справочник.ДокументыПредприятия КАК ДокументПредприятия
		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			ТекущиеСостоянияДокументов.Документ КАК Документ,
			МАКСИМУМ(ТекущиеСостоянияДокументов.ДатаУстановки) КАК Период
		ИЗ
			РегистрСведений.ТекущиеСостоянияДокументов КАК ТекущиеСостоянияДокументов
		ГДЕ
			ТекущиеСостоянияДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Исполнен)

		СГРУППИРОВАТЬ ПО
			ТекущиеСостоянияДокументов.Документ) КАК СостоянияДокументов
		ПО (СостоянияДокументов.Документ = ДокументПредприятия.Ссылка)
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДокументовПредприятия КАК ДанныеДокументовПредприятия
		ПО (ДанныеДокументовПредприятия.Документ = ДокументПредприятия.Ссылка)
		ЛЕВОЕ СОЕДИНЕНИЕ ПоследняяРезолюция КАК ПоследняяРезолюция
		ПО ДокументПредприятия.Ссылка = ПоследняяРезолюция.Ссылка
		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Задача.Приложения КАК ЗадачаПриложения
		ПО ДокументПредприятия.Ссылка = ЗадачаПриложения.Приложение
{ГДЕ
	(ИСТИНА В
				(ВЫБРАТЬ ПЕРВЫЕ 1
					ИСТИНА
				ИЗ
					РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
				ГДЕ
					КатегорииОбъектов.ОбъектДанных = ДокументПредприятия.Ссылка
					И КатегорииОбъектов.КатегорияДанных В (&СписокКатегорий))
			ИЛИ ЛОЖЬ В
				(ВЫБРАТЬ
					Константы.ИспользоватьКатегорииДанных
				ИЗ
					Константы КАК Константы)),
	(ДокументПредприятия.ПометкаУдаления = ЛОЖЬ
			ИЛИ &ПоказыватьПомеченныеНаУдаление = ИСТИНА),
	(ДокументПредприятия.ФормаДокумента = &ФормаДокумента),
	(&Состояние В
			(ВЫБРАТЬ
				РегистрСведений.ТекущиеСостоянияДокументов.Состояние
			ИЗ
				РегистрСведений.ТекущиеСостоянияДокументов
			ГДЕ
				РегистрСведений.ТекущиеСостоянияДокументов.Документ = ДокументПредприятия.Ссылка)),
	(ВЫБОР
			КОГДА ДокументПредприятия.РегистрационныйНомер <> ""
				ТОГДА ДокументПредприятия.ДатаРегистрации
			ИНАЧЕ ДокументПредприятия.ДатаСоздания
		КОНЕЦ МЕЖДУ &ДатаНачала И &ДатаОкончания),
	(ДокументПредприятия.РегистрационныйНомер = ""
				И &ПоказыватьДокументы = ЗНАЧЕНИЕ(Перечисление.ПоказыватьДокументы.НеЗарегистрированные)
			ИЛИ ДокументПредприятия.РегистрационныйНомер <> ""
				И &ПоказыватьДокументы = ЗНАЧЕНИЕ(Перечисление.ПоказыватьДокументы.Зарегистрированные)
			ИЛИ &ПоказыватьДокументы = ЗНАЧЕНИЕ(Перечисление.ПоказыватьДокументы.Все)),
	(ВЫБОР
			КОГДА &ДокументыСИстекающимСрокомДействия
				ТОГДА ДокументПредприятия.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
						И НЕ ДокументПредприятия.НеДействует
						И (ДокументПредприятия.Ответственный В (&Ответственные)
							ИЛИ ДокументПредприятия.Подготовил В (&Ответственные)
								И (ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = НЕОПРЕДЕЛЕНО))
						И ДокументПредприятия.ДатаОкончанияДействия >= &ТекущаяДата
						И ДокументПредприятия.ДатаОкончанияДействия <= КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2), ДЕНЬ)
			ИНАЧЕ ИСТИНА
		КОНЕЦ),
	(ВЫБОР
			КОГДА &ДокументыСИстекшимСрокомДействия
				ТОГДА ДокументПредприятия.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
						И НЕ ДокументПредприятия.НеДействует
						И (ДокументПредприятия.Ответственный В (&Ответственные)
							ИЛИ ДокументПредприятия.Подготовил В (&Ответственные)
								И (ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = НЕОПРЕДЕЛЕНО))
						И ДокументПредприятия.ДатаОкончанияДействия < &ТекущаяДата
						И ДокументПредприятия.ПорядокПродления = ЗНАЧЕНИЕ(Перечисление.ПорядокПродления.ДопускаетПродление)
			ИНАЧЕ ИСТИНА
		КОНЕЦ),
	(ВЫБОР
			КОГДА &ДокументыСИстекающимСрокомИсполнения
				ТОГДА ДокументПредприятия.СрокИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
						И НЕ ДокументПредприятия.НеДействует
						И (ДокументПредприятия.Ответственный В (&Ответственные)
							ИЛИ ДокументПредприятия.Подготовил В (&Ответственные)
								И (ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = НЕОПРЕДЕЛЕНО))
						И СостоянияДокументов.Период ЕСТЬ NULL
						И ДокументПредприятия.СрокИсполнения >= &ТекущаяДата
						И ДокументПредприятия.СрокИсполнения <= КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2), ДЕНЬ)
			ИНАЧЕ ИСТИНА
		КОНЕЦ),
	(ВЫБОР
			КОГДА &ДокументыПросроченные
				ТОГДА ДокументПредприятия.СрокИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
						И НЕ ДокументПредприятия.НеДействует
						И (ДокументПредприятия.Ответственный В (&Ответственные)
							ИЛИ ДокументПредприятия.Подготовил В (&Ответственные)
								И (ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
									ИЛИ ДокументПредприятия.Ответственный = НЕОПРЕДЕЛЕНО))
						И СостоянияДокументов.Период ЕСТЬ NULL
						И ДокументПредприятия.СрокИсполнения < &ТекущаяДата
			ИНАЧЕ ИСТИНА
		КОНЕЦ)}
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_Поручение.РегистрационныйНомер КАК РегистрационныйНомер,
	ВТ_Поручение.ДатаРегистрации КАК ДатаРегистрации,
	ВТ_Поручение.ВидДокумента КАК ВидДокумента,
	ВТ_Поручение.Ссылка КАК Ссылка,
	ВТ_Поручение.ДокументПредприятия КАК ДокументПредприятия,
	ВТ_Поручение.Подготовил КАК Подготовил,
	ВТ_Поручение.Утвердил КАК Утвердил,
	ВТ_Поручение.Дело КАК Дело,
	ВТ_Поручение.ПлановыйСрокИсполнения КАК ПлановыйСрокИсполнения,
	ВТ_Поручение.Зарегистрировал КАК Зарегистрировал,
	ВТ_Поручение.Папка КАК Папка,
	ВТ_Поручение.Организация КАК Организация,
	ВТ_Поручение.Ответственный КАК Ответственный,
	ВТ_Поручение.АвторРезолюции КАК АвторРезолюции,
	ВТ_Поручение.ДатаРезолюции КАК ДатаРезолюции,
	ВТ_Поручение.Резолюция КАК Резолюция,
	ВТ_Поручение.Проект КАК Проект,
	ВТ_Поручение.Валюта КАК Валюта,
	ВТ_Поручение.Сумма КАК Сумма,
	ВТ_Поручение.ФактическийСрокИсполнения КАК ФактическийСрокИсполнения,
	ВТ_Поручение.Исполнен КАК Исполнен,
	ВТ_Поручение.ПредставлениеСостояния КАК ПредставлениеСостояния,
	ВТ_Поручение.ФормаДокумента КАК ФормаДокумента,
	ВТ_Поручение.Важность КАК Важность,
	ВТ_Поручение.Поручение КАК Поручение,
	ЗадачаУчастники.Участник КАК Участник,
	ЗадачаУчастники.ДействиеУчастника КАК ДействиеУчастника,
	ЗадачаУчастники.ДействиеУчастника.ДатаВыполнения КАК ДействиеУчастникаДатаВыполнения,
	ВТ_Поручение.СуммаТекущегоГода КАК СуммаТекущегоГода,
	ВТ_Поручение.СуммаПервогоГода КАК СуммаПервогоГода,
	ВТ_Поручение.СуммаВторогоГода КАК СуммаВторогоГода,
	ВТ_Поручение.Источник КАК Источник
ПОМЕСТИТЬ ВТ_ДействиеУчастника
ИЗ
	ВТ_Поручение КАК ВТ_Поручение
		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Задача.Участники КАК ЗадачаУчастники
		ПО ВТ_Поручение.Поручение = ЗадачаУчастники.Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ
	ВТ_ДействиеУчастника.РегистрационныйНомер КАК РегистрационныйНомер,
	ВТ_ДействиеУчастника.ДатаРегистрации КАК ДатаРегистрации,
	ВТ_ДействиеУчастника.ВидДокумента КАК ВидДокумента,
	ВТ_ДействиеУчастника.Ссылка КАК Ссылка,
	ВТ_ДействиеУчастника.ДокументПредприятия КАК ДокументПредприятия,
	ВТ_ДействиеУчастника.Подготовил КАК Подготовил,
	ВТ_ДействиеУчастника.Утвердил КАК Утвердил,
	ВТ_ДействиеУчастника.Дело КАК Дело,
	ВТ_ДействиеУчастника.ПлановыйСрокИсполнения КАК ПлановыйСрокИсполнения,
	ВТ_ДействиеУчастника.Зарегистрировал КАК Зарегистрировал,
	ВТ_ДействиеУчастника.Папка КАК Папка,
	ВТ_ДействиеУчастника.Организация КАК Организация,
	ВТ_ДействиеУчастника.Ответственный КАК Ответственный,
	ВТ_ДействиеУчастника.АвторРезолюции КАК АвторРезолюции,
	ВТ_ДействиеУчастника.ДатаРезолюции КАК ДатаРезолюции,
	ВТ_ДействиеУчастника.Резолюция КАК Резолюция,
	ВТ_ДействиеУчастника.Проект КАК Проект,
	ВТ_ДействиеУчастника.Валюта КАК Валюта,
	ВТ_ДействиеУчастника.Сумма КАК Сумма,
	ВТ_ДействиеУчастника.ФактическийСрокИсполнения КАК ФактическийСрокИсполнения,
	ВТ_ДействиеУчастника.Исполнен КАК Исполнен,
	ВТ_ДействиеУчастника.ПредставлениеСостояния КАК ПредставлениеСостояния,
	ВТ_ДействиеУчастника.ФормаДокумента КАК ФормаДокумента,
	ВТ_ДействиеУчастника.Важность КАК Важность,
	ВТ_ДействиеУчастника.Поручение КАК Поручение,
	ВТ_ДействиеУчастника.Участник КАК Участник,
	ВТ_ДействиеУчастника.ДействиеУчастника КАК ДействиеУчастника,
	ВТ_ДействиеУчастника.ДействиеУчастникаДатаВыполнения КАК ДействиеУчастникаДатаВыполнения,
	ДействиеЗадачи.Ссылка КАК ДействиеЗадачи,
	ВТ_ДействиеУчастника.СуммаТекущегоГода КАК СуммаТекущегоГода,
	ВТ_ДействиеУчастника.СуммаПервогоГода КАК СуммаПервогоГода,
	ВТ_ДействиеУчастника.СуммаВторогоГода КАК СуммаВторогоГода,
	ВТ_ДействиеУчастника.Источник КАК Источник
ПОМЕСТИТЬ ВТ_ДействиеЗадачи
ИЗ
	ВТ_ДействиеУчастника КАК ВТ_ДействиеУчастника
		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДействиеЗадачи КАК ДействиеЗадачи
		ПО ВТ_ДействиеУчастника.ДействиеУчастника = ДействиеЗадачи.Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	РеестрЗадачПоИсполнителям.ВидДействия КАК ВидДействия,
	РеестрЗадачПоИсполнителям.ВидЗадачи КАК ВидЗадачи,
	РеестрЗадачПоИсполнителям.ДействиеЗадачи КАК ДействиеЗадачи,
	РеестрЗадачПоИсполнителям.Исполнитель КАК Исполнитель
ПОМЕСТИТЬ ВТ_Новые
ИЗ
	РегистрСведений.РеестрЗадачПоИсполнителям КАК РеестрЗадачПоИсполнителям
ГДЕ
	НЕ РеестрЗадачПоИсполнителям.ВидДействия ЕСТЬ NULL
	И НЕ РеестрЗадачПоИсполнителям.ВидЗадачи ЕСТЬ NULL
	И РеестрЗадачПоИсполнителям.Новое = ИСТИНА
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ДействиеЗадачи.РегистрационныйНомер КАК РегистрационныйНомер,
	ВТ_ДействиеЗадачи.ДатаРегистрации КАК ДатаРегистрации,
	ВТ_ДействиеЗадачи.ВидДокумента КАК ВидДокумента,
	ВТ_ДействиеЗадачи.Ссылка КАК Ссылка,
	ВТ_ДействиеЗадачи.ДокументПредприятия КАК ДокументПредприятия,
	ВТ_ДействиеЗадачи.Подготовил КАК Подготовил,
	ВЫРАЗИТЬ(ВТ_ДействиеЗадачи.Утвердил КАК СТРОКА(100)) КАК Утвердил,
	ВТ_ДействиеЗадачи.Дело КАК Дело,
	ВТ_ДействиеЗадачи.ПлановыйСрокИсполнения КАК ПлановыйСрокИсполнения,
	ВТ_ДействиеЗадачи.Зарегистрировал КАК Зарегистрировал,
	ВТ_ДействиеЗадачи.Папка КАК Папка,
	ВТ_ДействиеЗадачи.Организация КАК Организация,
	ВТ_ДействиеЗадачи.Ответственный КАК Ответственный,
	ВТ_ДействиеЗадачи.АвторРезолюции КАК АвторРезолюции,
	ВТ_ДействиеЗадачи.ДатаРезолюции КАК ДатаРезолюции,
	ВЫРАЗИТЬ(ВТ_ДействиеЗадачи.Резолюция КАК СТРОКА(100)) КАК Резолюция,
	ВТ_ДействиеЗадачи.Проект КАК Проект,
	ВТ_ДействиеЗадачи.Валюта КАК Валюта,
	ВТ_ДействиеЗадачи.Сумма КАК Сумма,
	ВТ_ДействиеЗадачи.ФактическийСрокИсполнения КАК ФактическийСрокИсполнения,
	ВТ_ДействиеЗадачи.Исполнен КАК Исполнен,
	ВТ_ДействиеЗадачи.ПредставлениеСостояния КАК ПредставлениеСостояния,
	ВТ_ДействиеЗадачи.ФормаДокумента КАК ФормаДокумента,
	ВТ_ДействиеЗадачи.Важность КАК Важность,
	ВТ_ДействиеЗадачи.Участник КАК Гарант_Участник,
	ВТ_ДействиеЗадачи.ДействиеУчастникаДатаВыполнения КАК ДействиеУчастникаДатаВыполнения,
	ВТ_Новые.ВидДействия КАК Гарант_ВидДействия,
	ВТ_Новые.ВидЗадачи КАК Гарант_ВидЗадачи,
	ВТ_Новые.Исполнитель КАК Гарант_Исполнитель,
	ВТ_ДействиеЗадачи.Участник.Наименование КАК УчастникНаименование,
	ВТ_ДействиеЗадачи.СуммаТекущегоГода КАК СуммаТекущегоГода,
	ВТ_ДействиеЗадачи.СуммаПервогоГода КАК СуммаПервогоГода,
	ВТ_ДействиеЗадачи.СуммаВторогоГода КАК СуммаВторогоГода,
	ВТ_ДействиеЗадачи.Источник КАК Источник
ПОМЕСТИТЬ ВТ_Роли
ИЗ
	ВТ_ДействиеЗадачи КАК ВТ_ДействиеЗадачи
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Новые КАК ВТ_Новые
		ПО ВТ_ДействиеЗадачи.ДействиеЗадачи = ВТ_Новые.ДействиеЗадачи
ГДЕ
	ВТ_ДействиеЗадачи.ДействиеУчастникаДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)
	И ВТ_Новые.Исполнитель <> НЕОПРЕДЕЛЕНО

СГРУППИРОВАТЬ ПО
	ВТ_ДействиеЗадачи.РегистрационныйНомер,
	ВТ_ДействиеЗадачи.ДатаРегистрации,
	ВТ_ДействиеЗадачи.ВидДокумента,
	ВТ_ДействиеЗадачи.Ссылка,
	ВТ_ДействиеЗадачи.ДокументПредприятия,
	ВТ_ДействиеЗадачи.Подготовил,
	ВЫРАЗИТЬ(ВТ_ДействиеЗадачи.Утвердил КАК СТРОКА(100)),
	ВТ_ДействиеЗадачи.Дело,
	ВТ_ДействиеЗадачи.ПлановыйСрокИсполнения,
	ВТ_ДействиеЗадачи.Зарегистрировал,
	ВТ_ДействиеЗадачи.Папка,
	ВТ_ДействиеЗадачи.Организация,
	ВТ_ДействиеЗадачи.Ответственный,
	ВТ_ДействиеЗадачи.АвторРезолюции,
	ВТ_ДействиеЗадачи.ДатаРезолюции,
	ВТ_ДействиеЗадачи.Проект,
	ВТ_ДействиеЗадачи.Валюта,
	ВТ_ДействиеЗадачи.Сумма,
	ВТ_ДействиеЗадачи.ФактическийСрокИсполнения,
	ВТ_ДействиеЗадачи.Исполнен,
	ВТ_ДействиеЗадачи.ПредставлениеСостояния,
	ВТ_ДействиеЗадачи.ФормаДокумента,
	ВТ_ДействиеЗадачи.Важность,
	ВТ_ДействиеЗадачи.Участник,
	ВТ_ДействиеЗадачи.ДействиеУчастникаДатаВыполнения,
	ВЫРАЗИТЬ(ВТ_ДействиеЗадачи.Резолюция КАК СТРОКА(100)),
	ВТ_ДействиеЗадачи.Участник.Наименование,
	ВТ_ДействиеЗадачи.СуммаТекущегоГода,
	ВТ_ДействиеЗадачи.СуммаПервогоГода,
	ВТ_ДействиеЗадачи.СуммаВторогоГода,
	ВТ_Новые.ВидДействия,
	ВТ_Новые.ВидЗадачи,
	ВТ_Новые.Исполнитель,
	ВТ_ДействиеЗадачи.Источник
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_Роли.РегистрационныйНомер КАК РегистрационныйНомер,
	ВТ_Роли.ДатаРегистрации КАК ДатаРегистрации,
	ВТ_Роли.ВидДокумента КАК ВидДокумента,
	ВТ_Роли.Ссылка КАК Ссылка,
	ВТ_Роли.ДокументПредприятия КАК ДокументПредприятия,
	ВТ_Роли.Источник КАК Источник,
	ВТ_Роли.Подготовил КАК Подготовил,
	ВТ_Роли.Утвердил КАК Утвердил,
	ВТ_Роли.Дело КАК Дело,
	ВТ_Роли.ПлановыйСрокИсполнения КАК ПлановыйСрокИсполнения,
	ВТ_Роли.Зарегистрировал КАК Зарегистрировал,
	ВТ_Роли.Папка КАК Папка,
	ВТ_Роли.Организация КАК Организация,
	ВТ_Роли.Ответственный КАК Ответственный,
	ВТ_Роли.АвторРезолюции КАК АвторРезолюции,
	ВТ_Роли.ДатаРезолюции КАК ДатаРезолюции,
	ВТ_Роли.Резолюция КАК Резолюция,
	ВТ_Роли.Проект КАК Проект,
	ВТ_Роли.Валюта КАК Валюта,
	ВТ_Роли.Сумма КАК Сумма,
	ВТ_Роли.ФактическийСрокИсполнения КАК ФактическийСрокИсполнения,
	ВТ_Роли.Исполнен КАК Исполнен,
	ВТ_Роли.ПредставлениеСостояния КАК ПредставлениеСостояния,
	ВТ_Роли.ФормаДокумента КАК ФормаДокумента,
	ВТ_Роли.Важность КАК Важность,
	ВТ_Роли.Гарант_ВидДействия КАК Гарант_ВидДействия,
	ВТ_Роли.Гарант_ВидЗадачи КАК Гарант_ВидЗадачи,
	ВТ_Роли.Гарант_Исполнитель КАК Гарант_Исполнитель,
	ВТ_Роли.СуммаТекущегоГода КАК СуммаТекущегоГода,
	ВТ_Роли.СуммаПервогоГода КАК СуммаПервогоГода,
	ВТ_Роли.СуммаВторогоГода КАК СуммаВторогоГода
ИЗ
	ВТ_Роли КАК ВТ_Роли
