// Гарант+ Килипенко 14.08.2024 [F00227047] перенос норм потребления из БП77 ++
#Область ОбработчикиКомандФормы

// Выполняет создание норм потребления холодной воды по виду тарифа "для населения"
&НаКлиенте
Асинх Процедура СоздатьНормыПотребленияХолоднойВодыДляНаселения(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнена создания норм потребления холодной воды (для населения).");
    Если РезультатДиалога = Ложь Тогда
        Возврат; // Пользователь отказался от выполнения операции
    КонецЕсли;

    // Создание объектов
    РезультатСоздания = СоздатьНормыПотребленияХолоднойВодыДляНаселенияНаСервере();

    // Вывод сообщения о результате
    ТекстСообщенияРезультатОперации = "";
    Если РезультатСоздания.Успех = Ложь Тогда
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание норм потребления не выполнено.
                |Сообщение о причине: %1", РезультатСоздания.ТекстСообщения);
    Иначе
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание норм потребления выполнено успешно.
                |Создано ""%1"" норм потребления услуг.", РезультатСоздания.СозданныеНормыПотребления.Количество());
    КонецЕсли;
    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРезультатОперации);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// Гарант+ Килипенко 14.08.2024 [F00227047] перенос норм потребления из БП77 --

// Гарант+ Килипенко 14.08.2024 [F00227047] перенос норм потребления из БП77 ++
#Область СлужебныеПроцедурыИФункции

// Создает нормы потребления холодной воды по виду тарифа "для населения"
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * СозданныеНормыПотребления - Массив из СправочникСсылка.БанковскиеСчета
//      * ТекстСообщения - Строка, Неопределено
&НаСервереБезКонтекста
Функция СоздатьНормыПотребленияХолоднойВодыДляНаселенияНаСервере()
    Возврат ГП_МиграцияНормПотребления.СоздатьНормыПотребленияХолоднойВодыДляНаселения();
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 14.08.2024 [F00227047] перенос норм потребления из БП77 --
