// Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа ++
#Область ПереопределениеСтандартногоФункционала

&ИзменениеИКонтроль("ОбновитьСтатусыЧековВТабличнойЧасти")
Процедура ГП_ОбновитьСтатусыЧековВТабличнойЧасти(Объект, ЛицевойСчет)

	ДокументОснование = Объект.Ссылка;

	Если Не ЗначениеЗаполнено(ДокументОснование) ИЛИ Объект.ЛицевыеСчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

    #Вставка // Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа ++

    ИспользуетсяФормированиеЧековПоКонтрагентуДокумента = ГП_ИспользуетсяФормированиеЧековПоКонтрагентуДокумента(Неопределено);
    НеУчитыватьЗначениеЛицевыхСчетов = Ложь;
    Если ИспользуетсяФормированиеЧековПоКонтрагентуДокумента Тогда
        КонтрагентДокументаОплаты = Неопределено;
        Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КВП_РегистрацияОплаты") Тогда
            КонтрагентДокументаОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Контрагент");
        Иначе
            ОбщегоНазначения.СообщитьПользователю(
                СтрШаблон(
                    "Внимание! Текущий механизм формирования чеков по контрагенту не поддерживает работу с документом ""%1"".
                    |Статусы чеков могут быть сформированы неправильно",
                    ТипЗнч(ДокументОснование)));
        КонецЕсли;

        Если ТипЗнч(КонтрагентДокументаОплаты) = Тип("СправочникСсылка.Контрагенты") И НЕ КонтрагентДокументаОплаты.Пустая() Тогда
            НеУчитыватьЗначениеЛицевыхСчетов = Истина;
        КонецЕсли;
    КонецЕсли;

    #КонецВставки // Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа --

	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		СписокЛицевыхСчетов  = Объект.ЛицевыеСчета.НайтиСтроки(Новый Структура("Объект", ЛицевойСчет));
		ТаблицаЛицевыхСчетов = Объект.ЛицевыеСчета.Выгрузить(СписокЛицевыхСчетов, "НомерСтроки, Объект");
	Иначе
		СписокЛицевыхСчетов  = Объект.ЛицевыеСчета;
		ТаблицаЛицевыхСчетов = Объект.ЛицевыеСчета.Выгрузить(, "НомерСтроки, Объект");
	КонецЕсли;

	Если ТаблицаЛицевыхСчетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаЛицевыхСчетов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаЛицевыхСчетов.Объект КАК ЛицевойСчет,
	|	&ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ втЛицевыеСчета
	|ИЗ
	|	&ТаблицаЛицевыхСчетов КАК ТаблицаЛицевыхСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЛицевыеСчета.НомерСтроки КАК НомерСтроки,
	|	втЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	|	втЛицевыеСчета.ДокументОснование КАК ДокументОснование,
	|	МАКСИМУМ(ФискальныеОперации.Дата) КАК Дата
	|ПОМЕСТИТЬ втДатаПоследнегоЧека
	|ИЗ
	|	втЛицевыеСчета КАК втЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
    #Удаление // Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа
	|		ПО втЛицевыеСчета.ЛицевойСчет = ФискальныеОперации.УПЖКХ_ЛицевойСчет
    #КонецУдаления
    #Вставка // Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа ++

	|		ПО
    |           ВЫБОР
    |               КОГДА &ИспользуетсяФормированиеЧековПоКонтрагентуДокумента = ЛОЖЬ
    |                   ТОГДА втЛицевыеСчета.ЛицевойСчет = ФискальныеОперации.УПЖКХ_ЛицевойСчет
    |               ИНАЧЕ
    |                   // Для использования механизма формирования чеков по контрагенту документа
    |                   ФискальныеОперации.УПЖКХ_ЛицевойСчет = ЗНАЧЕНИЕ(Справочник.КВП_ЛицевыеСчета.ПустаяСсылка)
    |           КОНЕЦ

    #КонецВставки // Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа --
	|			И втЛицевыеСчета.ДокументОснование = ФискальныеОперации.ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	втЛицевыеСчета.НомерСтроки,
	|	втЛицевыеСчета.ЛицевойСчет,
	|	втЛицевыеСчета.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДатаПоследнегоЧека.НомерСтроки КАК НомерСтроки,
	|	втДатаПоследнегоЧека.ЛицевойСчет КАК ЛицевойСчет,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ФискальныеОперации.УПЖКХ_СтатусЧека ЕСТЬ NULL
	|				ТОГДА 0
	|			КОГДА ФискальныеОперации.УПЖКХ_СтатусЧека = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_СтатусыЧека.ПробитОтправлен)
	|					ИЛИ ФискальныеОперации.УПЖКХ_СтатусЧека = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_СтатусыЧека.ПробитНеОтправлен)
	|				ТОГДА 2
	|			КОГДА ФискальныеОперации.УПЖКХ_СтатусЧека = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_СтатусыЧека.ОблачнаяКассаВОчереди)
	|				ТОГДА 3
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК ЧекПробит,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ФискальныеОперации.УПЖКХ_СтатусЧека ЕСТЬ NULL
	|				ТОГДА 0
	|			КОГДА ФискальныеОперации.УПЖКХ_СтатусЧека = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_СтатусыЧека.ПробитНеОтправлен)
	|					И (НЕ ФискальныеОперации.УПЖКХ_ДатаОтправки = ДАТАВРЕМЯ(1, 1, 1)
	|						ИЛИ НЕ ФискальныеОперации.УПЖКХ_ОблачнаяКассаДатаОтправки = ДАТАВРЕМЯ(1, 1, 1))
	|				ТОГДА 1
	|			КОГДА ФискальныеОперации.УПЖКХ_СтатусЧека = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_СтатусыЧека.ПробитОтправлен)
	|				ТОГДА 2
	|			КОГДА ФискальныеОперации.УПЖКХ_СтатусЧека = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_СтатусыЧека.ОблачнаяКассаВОчереди)
	|					И (ФискальныеОперации.УПЖКХ_ОблачнаяКассаСостояниеОтправкиЧека = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_ОблачнаяКассаСостояниеОтправкиЧека.ОтправляетОФД)
	|						ИЛИ ФискальныеОперации.УПЖКХ_ОблачнаяКассаСостояниеОтправкиЧека = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_ОблачнаяКассаСостояниеОтправкиЧека.ТребуетсяОтправкаИзПрограммы))
	|				ТОГДА 3
	|			КОГДА ФискальныеОперации.УПЖКХ_СтатусЧека = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_СтатусыЧека.ПробитНеОтправлен)
	|					И ФискальныеОперации.УПЖКХ_ОблачнаяКассаСостояниеОтправкиЧека = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_ОблачнаяКассаСостояниеОтправкиЧека.ТребуетсяОтправкаИзПрограммы)
	|				ТОГДА 3
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЧекОтправлен
	|ИЗ
	|	втДатаПоследнегоЧека КАК втДатаПоследнегоЧека
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
    #Удаление // Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа
	|		ПО втДатаПоследнегоЧека.ЛицевойСчет = ФискальныеОперации.УПЖКХ_ЛицевойСчет
    #КонецУдаления
    #Вставка // Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа ++

	|		ПО
    |           ВЫБОР
    |               КОГДА &ИспользуетсяФормированиеЧековПоКонтрагентуДокумента = ЛОЖЬ
    |                   ТОГДА втДатаПоследнегоЧека.ЛицевойСчет = ФискальныеОперации.УПЖКХ_ЛицевойСчет
    |               ИНАЧЕ
    |                   // Для использования механизма формирования чеков по контрагенту документа
    |                   ФискальныеОперации.УПЖКХ_ЛицевойСчет = ЗНАЧЕНИЕ(Справочник.КВП_ЛицевыеСчета.ПустаяСсылка)
    |           КОНЕЦ

    #КонецВставки // Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа --
	|			И втДатаПоследнегоЧека.ДокументОснование = ФискальныеОперации.ДокументОснование
	|			И втДатаПоследнегоЧека.Дата = ФискальныеОперации.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	втДатаПоследнегоЧека.НомерСтроки,
	|	втДатаПоследнегоЧека.ЛицевойСчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("ТаблицаЛицевыхСчетов", ТаблицаЛицевыхСчетов);
	Запрос.УстановитьПараметр("ДокументОснование",    ДокументОснование);
    #Вставка // Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа ++

    Запрос.УстановитьПараметр("ИспользуетсяФормированиеЧековПоКонтрагентуДокумента", НеУчитыватьЗначениеЛицевыхСчетов);

    #КонецВставки // Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа --

	ТаблицаФискальныхОпераций = Запрос.Выполнить().Выгрузить();

	УстановитьПривилегированныйРежим(Ложь);

	Для Каждого СтрокаТЧ Из СписокЛицевыхСчетов Цикл

		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НомерСтроки", СтрокаТЧ.НомерСтроки);

		МассивСтрокПлатежа = ТаблицаФискальныхОпераций.НайтиСтроки(ПараметрыОтбора);

		Для Каждого СтрокаТаблицы Из МассивСтрокПлатежа Цикл
			СтрокаТЧ.ЧекПробит    = СтрокаТаблицы.ЧекПробит;
			СтрокаТЧ.ЧекОтправлен = СтрокаТаблицы.ЧекОтправлен;
			Прервать;
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти // ПереопределениеСтандартногоФункционала
// Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа --

// Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа ++
#Область ПрограммныйИнтерфейс

// Параметры:
//  Период - Дата, Неопределено - Не используется в текущей реализации
// Возвращаемое значение:
//  - Булево
&НаСервере
Функция ГП_ИспользуетсяФормированиеЧековПоКонтрагентуДокумента(Знач Период = Неопределено) Экспорт
    Возврат Константы.ГП_ФормироватьЧекиЖКХПоКонтрагентуДокумента.Получить();
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 24.02.2025 [F00235125] Печать чеков по контрагенту документа --
