// Гарант+ Килипенко 11.11.2024 [F00229978] Фильтр по договору формы выбора контрагента ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    ГП_СоздатьРеквизитОборПоДоговоруНаСервере();
    ГП_СоздатьЭлементДоговорНаСервере();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 11.11.2024 [F00229978] Фильтр по договору формы выбора контрагента --

// Гарант+ Килипенко 11.11.2024 [F00229978] Фильтр по договору формы выбора контрагента ++
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГП_ДоговорПриИзменении(Элемент)
    ГП_УстановитьФильтрПоДоговоруНаСервере(ЭтотОбъект.ГП_Договор);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы
// Гарант+ Килипенко 11.11.2024 [F00229978] Фильтр по договору формы выбора контрагента --

// Гарант+ Килипенко 11.11.2024 [F00229978] Фильтр по договору формы выбора контрагента ++
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ГП_СоздатьЭлементДоговорНаСервере()
    РезультатФункции = Новый Структура("Элемент, Реквизит, ГруппаФормы");

    НаименованиеСоздаваемогоРеквизита = "ГП_Договор";

    // Создание реквизита
    ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
    РезультатФункции.Реквизит = Новый РеквизитФормы(НаименованиеСоздаваемогоРеквизита, ТипРеквизита, "", "Договор");
    ЭтотОбъект.ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РезультатФункции.Реквизит));

    ЭтотОбъект[НаименованиеСоздаваемогоРеквизита] = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();

    // Создание элемента формы
    РезультатФункции.Элемент = ГП_РаботаСФормамиКлиентСервер.СоздатьПолеФормы(НаименованиеСоздаваемогоРеквизита,
            Новый Структура("Заголовок", "Договор"), ЭтотОбъект, Неопределено, "Список");
    РезультатФункции.Элемент.Вид = ВидПоляФормы.ПолеВвода;
    РезультатФункции.Элемент.ПутьКДанным = НаименованиеСоздаваемогоРеквизита;
    РезультатФункции.Элемент.УстановитьДействие("ПриИзменении", "ГП_ДоговорПриИзменении");

    Возврат РезультатФункции;
КонецФункции

&НаСервере
Функция ГП_СоздатьРеквизитОборПоДоговоруНаСервере()
    РезультатФункции = Новый Структура("Реквизит");

    НаименованиеСоздаваемогоРеквизита = "ГП_ОтборПоДоговору";

    // Создание реквизита
    ТипРеквизита = Новый ОписаниеТипов();
    РезультатФункции.Реквизит = Новый РеквизитФормы(НаименованиеСоздаваемогоРеквизита, ТипРеквизита, "", "Отбор по договору");
    ЭтотОбъект.ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РезультатФункции.Реквизит));

    ЗначениеРеквизитаОтбора = ЭтотОбъект.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЗначениеРеквизитаОтбора.Представление = "ГП_ОтборПоДоговору";
    ЗначениеРеквизитаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    ЗначениеРеквизитаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ЗначениеРеквизитаОтбора.ПравоеЗначение = Новый Массив;
    ЗначениеРеквизитаОтбора.Использование = Ложь;
    ЭтотОбъект[НаименованиеСоздаваемогоРеквизита] = ЗначениеРеквизитаОтбора;

    Возврат РезультатФункции;
КонецФункции

&НаСервере
Процедура ГП_УстановитьФильтрПоДоговоруНаСервере(Знач ДоговорСсылка)
    ОтборПоДоговору = ГП_ПолучитьЭлементОтбораПоПредставлению(ЭтотОбъект.ГП_ОтборПоДоговору.Представление);
    Если ОтборПоДоговору = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если ЗначениеЗаполнено(ДоговорСсылка) = Ложь Тогда
        ОтборПоДоговору.Использование = Ложь;
        Возврат;
    КонецЕсли;

    МассивКонтрагентовОтбора = ГП_ПолучитьСписокПриборовУчетаДоговораНаСервере(ДоговорСсылка);
    ОтборПоДоговору.ПравоеЗначение = МассивКонтрагентовОтбора;
    ОтборПоДоговору.Использование = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ГП_ПолучитьСписокПриборовУчетаДоговораНаСервере(Знач ДоговорСсылка)
    РезультатФункции = ГП_ПриборыУчета.ПолучитьСписокПриборовУчетаДоговора(ДоговорСсылка, Неопределено);
    Возврат РезультатФункции;
КонецФункции

&НаСервере
Функция ГП_ПолучитьЭлементОтбораПоПредставлению(Знач Представление)
    Для Каждого ТекущийЭлементОтбора Из ЭтотОбъект.Список.Отбор.Элементы Цикл
        Если ТекущийЭлементОтбора.Представление = Представление Тогда
            Возврат ТекущийЭлементОтбора;
        КонецЕсли;
    КонецЦикла;

    Возврат Неопределено;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 11.11.2024 [F00229978] Фильтр по договору формы выбора контрагента --
