// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область ПрограммныйИнтерфейс

// Выполняет чтение данных счетчиков (из ИБ БП 7.7) и записывает данные в регистр ГП_СчетчикиБП77 для последующего
//  добавления / обновления счетчиков БП 8
// Параметры:
//  ПараметрыВыгрузки - Структура
//  АдресХранилища - Строка
Процедура ЗагрузитьДанныеВИБ(ПараметрыВыгрузки, АдресХранилища) Экспорт
    РезультатВыполнения = Новый Структура("Успех, КоличествоЗаписанныхСчетчиков, ТекстСообщения", Ложь, 0);

    ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
    ДвоичныеДанныеФайла = ПараметрыВыгрузки.ДвоичныеДанныеФайла;
    ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);

    ЧтениеXML = Новый ЧтениеXML();
    ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);

    СправочникиБП77 = Неопределено;
    Попытка
        СправочникиБП77 = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
    Исключение
        РезультатВыполнения.ТекстСообщения = НСтр("ru = 'Загрузка из файлов данного типа не поддерживается.'");
        ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
            
        ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
        Возврат;
    КонецПопытки;
    ЭтоДопустимыйОбъект = (ТипЗнч(СправочникиБП77) = Тип("ОбъектXDTO") И СправочникиБП77.Свойства().Получить("Счетчик") <> Неопределено);
    Если ЭтоДопустимыйОбъект = Ложь Тогда
        РезультатВыполнения.ТекстСообщения = НСтр("ru = 'Данные счетчиков не обнаружены.'");
        ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
        Возврат;
    КонецЕсли;

    РезультатЗаписи = ЗаписатьДанныеСчетчиковВРегистр(СправочникиБП77.Счетчик);
    РезультатВыполнения.Успех = РезультатЗаписи.Успех;
    РезультатВыполнения.ТекстСообщения = РезультатЗаписи.СообщениеОбОшибке;
    РезультатВыполнения.КоличествоЗаписанныхСчетчиков = РезультатЗаписи.КоличествоЗаписанныхСчетчиков;

    ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --

// ++ Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики ++
#Область СлужебныеПроцедурыИФункции

// Выполняет запись данных счетчиков в регистр ГП_СчетчикиБП77
// Параметры:
//  ИсходныеДанныеСчетчиков - Массив из Структура
// Возвращаемое значение:
//  Структура:
//      * Успех - Булево
//      * КоличествоЗаписанныхСчетчиков - Число
//      * СообщениеОбОшибке - Строка, Неопределено
Функция ЗаписатьДанныеСчетчиковВРегистр(Знач ИсходныеДанныеСчетчиков)
    РезультатФункции = Новый Структура("Успех, КоличествоЗаписанныхСчетчиков, СообщениеОбОшибке", Истина, 0);

    Если ИсходныеДанныеСчетчиков = Неопределено ИЛИ ИсходныеДанныеСчетчиков.Количество() = 0 Тогда
        Возврат РезультатФункции;
    КонецЕсли;

    КлючиДатСчетчика = "ДатаУстановки,ДатаПоверки,ДатаПоказаний,ДатаБудущейПоверки";
    КлючиУсловийСчетчика = "ТолькоДляКанализации";
    КлючиЧиселСчетчика = "ПериодичностьПоверки,КоэффициентПересчета,МаксимальныйПоказатель";

    // Запись счетчиков в регистр ГП_СчетчикиБП77
    НачатьТранзакцию();
    Попытка

        Для Каждого СчетчикБП77 Из ИсходныеДанныеСчетчиков Цикл
            НаборЗаписейСчетчиков = РегистрыСведений.ГП_СчетчикиБП77.СоздатьНаборЗаписей();
            НаборЗаписейСчетчиков.Отбор.КонтрагентКод.Установить(СчетчикБП77.КонтрагентКод);
            НаборЗаписейСчетчиков.Отбор.ОбъектАбонентаКод.Установить(СчетчикБП77.ОбъектАбонентаКод);
            НаборЗаписейСчетчиков.Отбор.СчетчикКод.Установить(СчетчикБП77.СчетчикКод);

            НоваяЗапись = НаборЗаписейСчетчиков.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяЗапись, СчетчикБП77, ,
                СтрШаблон("%1,%2,%3", КлючиДатСчетчика, КлючиУсловийСчетчика, КлючиЧиселСчетчика));

            Для каждого Ключ Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючиДатСчетчика, ",", Ложь, Истина) Цикл
                НоваяЗапись[Ключ] = СтроковыеФункцииКлиентСервер.СтрокаВДату(СчетчикБП77[Ключ], ЧастиДаты.Дата);
            КонецЦикла;
            Для каждого Ключ Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючиУсловийСчетчика, ",", Ложь, Истина) Цикл
                НоваяЗапись[Ключ] = ?(СчетчикБП77[Ключ] = "1", Истина, Ложь);
            КонецЦикла;
            Для каждого Ключ Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючиЧиселСчетчика, ",", Ложь, Истина) Цикл
                НоваяЗапись[Ключ] = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СчетчикБП77[Ключ]);
            КонецЦикла;

            НаборЗаписейСчетчиков.Записать(Истина);
            РезультатФункции.КоличествоЗаписанныхСчетчиков = РезультатФункции.КоличествоЗаписанныхСчетчиков + 1;
        КонецЦикла;

        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();

        ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
            "Ошибка при записи счетчиков в регистр ""ГП_СчетчикиБП77"".",
            УровеньЖурналаРегистрации.Ошибка, , ,
            ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

        РезультатФункции.КоличествоЗаписанныхСчетчиков = 0;
        РезультатФункции.СообщениеОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
        РезультатФункции.Успех = Ложь;
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// -- Гарант+ Килипенко 15.07.2024 [F00225713] Перенос из БП 7.7 в БП3 справочника Счетчики --
