Процедура ЗагрузитьДанныеВИБ(ПараметрыВыгрузки, АдресХранилища) Экспорт
	СписокОшибок = Новый СписокЗначений;

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("json");
	ДвоичныеДанныеФайла = ПараметрыВыгрузки.ДвоичныеДанныеФайла;
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);

	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.ОткрытьФайл(ИмяВременногоФайла);

    РезультатВыполнения = Новый Структура("Успех, ТекстСообщения, Данные", Ложь);
	Попытка
		// ФайлОбмена.Прочитать();
        РезультатВыполнения.Данные = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		РезультатВыполнения.ТекстСообщения = НСтр("ru = 'Загрузка из файлов данного типа не поддерживается.'");
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
		Возврат;
	КонецПопытки;

	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
КонецПроцедуры
