// Гарант+ Килипенко 16.12.2024 [F00232332] Создание РН.ОплатаУслуг ++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ГП_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
    ГП_СоздатьЭлементРасшифровкаПлатежаНоменклатураНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    ГП_УстановитьВидимостьДополнительныхЭлементов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
// Гарант+ Килипенко 16.12.2024 [F00232332] Создание РН.ОплатаУслуг --

// Гарант+ Килипенко 16.12.2024 [F00232332] Создание РН.ОплатаУслуг ++
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ГП_СоздатьЭлементРасшифровкаПлатежаНоменклатураНаСервере()
    РезультатФункции = Новый Структура("Группа, Номенклатура, НоменклатурнаяГруппа");

    ИмяТаблицыРасшифровки = "РасшифровкаПлатежа";

    // Создание группы колонок
    ИмяСоздаваемогоЭлемента = СтрШаблон("ГП_%1ГруппаНоменклатура", ИмяТаблицыРасшифровки);
    ПараметрыЭлемента = Новый Структура("Заголовок, Группировка, ОтображатьЗаголовок");
    ПараметрыЭлемента.Заголовок = "Номенклатура / Номенклатурная группа";
    ПараметрыЭлемента.Группировка = ГруппировкаКолонок.Вертикальная;
    ПараметрыЭлемента.ОтображатьЗаголовок = Истина;
    РезультатФункции.Группа = ГП_РаботаСФормамиКлиентСервер.СоздатьГруппуКолонок(ИмяСоздаваемогоЭлемента, ПараметрыЭлемента, ЭтотОбъект,
            ИмяТаблицыРасшифровки, "РасшифровкаПлатежаСуммаПлатежа");

    // Создание элемента Номенклатура
    НаименованиеСоздаваемогоРеквизита = "ГП_Номенклатура";
    ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
    СозданныйРеквизит = Новый РеквизитФормы(
            НаименованиеСоздаваемогоРеквизита, ТипРеквизита,
            ИмяТаблицыРасшифровки, "Номенклатура");
    ЭтотОбъект.ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СозданныйРеквизит));

    ИмяСоздаваемогоЭлемента = СтрШаблон("ГП_%1Номенклатура", ИмяТаблицыРасшифровки);
    ПараметрыЭлемента = Новый Структура("ПутьКДанным, ОтображатьВПодвале");
    ПараметрыЭлемента.ПутьКДанным = СтрШаблон("%1.%2", ИмяТаблицыРасшифровки, СозданныйРеквизит.Имя);
    ПараметрыЭлемента.ОтображатьВПодвале = Ложь;

    РезультатФункции.Номенклатура = ГП_РаботаСФормамиКлиентСервер.СоздатьПолеФормы(ИмяСоздаваемогоЭлемента, ПараметрыЭлемента, ЭтотОбъект,
            РезультатФункции.Группа.Имя, Неопределено);

    // Создание элемента НоменклатурнаяГруппа
    НаименованиеСоздаваемогоРеквизита = "ГП_НоменклатурнаяГруппа";
    ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы");
    СозданныйРеквизит = Новый РеквизитФормы(
            НаименованиеСоздаваемогоРеквизита, ТипРеквизита,
            ИмяТаблицыРасшифровки, "Номенклатурная группа");
    ЭтотОбъект.ИзменитьРеквизиты(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СозданныйРеквизит));

    ИмяСоздаваемогоЭлемента = СтрШаблон("ГП_%1НоменклатурнаяГруппа", ИмяТаблицыРасшифровки);
    ПараметрыЭлемента.ПутьКДанным = СтрШаблон("%1.%2", ИмяТаблицыРасшифровки, СозданныйРеквизит.Имя);

    РезультатФункции.Номенклатура = ГП_РаботаСФормамиКлиентСервер.СоздатьПолеФормы(ИмяСоздаваемогоЭлемента, ПараметрыЭлемента, ЭтотОбъект,
            РезультатФункции.Группа.Имя, Неопределено);

    Возврат РезультатФункции;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ГП_УстановитьВидимостьДополнительныхЭлементов(Форма)
    Если Форма.ВидОперации = ПредопределенноеЗначение(
            "Перечисление.ВидыОперацийОплатаПлатежнойКартой.ОплатаПокупателя")
            ИЛИ Форма.ВидОперации = ПредопределенноеЗначение(
            "Перечисление.ВидыОперацийОплатаПлатежнойКартой.ВозвратПокупателю") Тогда

        Форма.Элементы.ГП_РасшифровкаПлатежаГруппаНоменклатура.Видимость = Истина;
    Иначе
        Форма.Элементы.ГП_РасшифровкаПлатежаГруппаНоменклатура.Видимость = Ложь;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
// Гарант+ Килипенко 16.12.2024 [F00232332] Создание РН.ОплатаУслуг --
