#Область ПереопределениеСтандартныхФункций

&ИзменениеИКонтроль ("ОбработкаПроверкиЗаполнения")
Процедура ГП_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Проверка корректности и уникальности идентификатора лицевого счета.
	Если Не ПустаяСтрока(Идентификатор) Тогда

        #Вставка // Гарант+ Килипенко 24.12.2024 [] Отмена контроля правильности заполнения Идентификатора ЛС ++

        ГП_ЭтоСоставнойКодБП77 = Ложь;
        Если СтрПодобнаПоРегулярномуВыражению(ЭтотОбъект.Идентификатор, "^[0-9]+[\-_][0-9]+$") Тогда
            ГП_ЭтоСоставнойКодБП77 = Истина;
        КонецЕсли;

        Если ГП_ЭтоСоставнойКодБП77 = Ложь И (НЕ ПроверитьКорректностьИдентификатораЛС(Идентификатор)) Тогда

        #КонецВставки // Гарант+ Килипенко 24.12.2024 [] Отмена контроля правильности заполнения Идентификатора ЛС --
        #Удаление // Гарант+ Килипенко 24.12.2024 [] Отмена контроля правильности заполнения Идентификатора ЛС
		Если Не ПроверитьКорректностьИдентификатораЛС(Идентификатор) Тогда
        #КонецУдаления
			УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьПользователю("Некорректно заполнено значение идентификатора!"
															   + " Формат идентификатора определяется в настройках программы ЖКХ.", ЭтотОбъект, "Идентификатор",, Отказ);
		КонецЕсли;

		Если Не Справочники.КВП_ЛицевыеСчета.ПроверитьУникальностьИдентификатора(Идентификатор, Ссылка) Тогда
			УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьПользователю("Идентификатор лицевого счета не уникален!", ЭтотОбъект, "Идентификатор",, Отказ);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти // ПереопределениеСтандартныхФункций
