
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Логин = Параметры.Логин;
	Пароль = Параметры.Пароль;
	Путь = Параметры.Путь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ЗапускПодключения",1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПодключения()
	
	ПутьКБазе = Путь;
	Пользователь = Логин;
	МонопольныйРежимOLE = ""; // " /m";
	ЗапускБезЗаставки = 1;
	База = Новый COMОбъект("V77.Application");
	СтрокаПодключения = "/D""" + СокрЛП(ПутьКБазе) + """ /N""" + СокрЛП(Пользователь) + """ /P"""+СокрЛП(Пароль) + """";
	РезультатПодключения = База.Initialize(База.RMTrade, СтрокаПодключения, ?(ЗапускБезЗаставки = 1, "NO_SPLASH_SHOW", ""));

	Если НЕ РезультатПодключения Тогда
	    ПоказатьПредупреждение(,"Не удалось произвести подключение к информационной базе");
	Иначе
		Закрыть(База);
	КонецЕсли;
	
КонецПроцедуры