// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьПризнакНегативноеВоздействие(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнено обновление значений признака ""ЭтоНегативноеВоздействие"" для всех записей регистра");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    // Заполнение / обновление значений признака Негативное воздействие
    РезультатЗаполнения = ЗаполнитьПризнакНегативноеВоздействиеНаСервере();

    // Вывод сообщения о результате
    ГП_ОбщегоНазначенияКлиент.СообщитьПользователюРезультатЗаполненияПоля(РезультатЗаполнения, "Негативного воздействия");
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьПризнакПлатаЗаХолодноеВодоснабжениеОИ(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнено обновление значений признака ""ЭтоПлатаЗаХолодноеВодоснабжениеОИ"" для всех записей регистра");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    // Заполнение / обновление значений признака плата за ХВ ОИ
    РезультатЗаполнения = ЗаполнитьПризнакПлатаЗаХолодноеВодоснабжениеОИНаСервере();

    // Вывод сообщения о результате
    ГП_ОбщегоНазначенияКлиент.СообщитьПользователюРезультатЗаполненияПоля(РезультатЗаполнения, "Платы за ХВ ОИ");
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьЗначенияНомеровДоговоров(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнено обновление значений поля ""Номер договора"" для всех записей регистра");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    // Заполнение / обновление значений поля ДоговорНомер
    РезультатЗаполнения = ЗаполнитьНомераДоговоровНаСервере();

    // Вывод сообщения о результате
    ГП_ОбщегоНазначенияКлиент.СообщитьПользователюРезультатЗаполненияПоля(РезультатЗаполнения, "Номеров договоров");
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --

// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область СлужебныеПроцедурыИФункции

// Заполняет значения признака `ЭтоНегативноеВоздействиеЦСВ` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
&НаСервереБезКонтекста
Функция ЗаполнитьПризнакНегативноеВоздействиеНаСервере()
    Возврат РегистрыСведений.ГП_ЗданияБП77.ЗаполнитьПризнакНегативноеВоздействие();
КонецФункции

// Заполняет значения признака `ЭтоПлатаЗаХолодноеВодоснабжениеОИ` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
&НаСервереБезКонтекста
Функция ЗаполнитьПризнакПлатаЗаХолодноеВодоснабжениеОИНаСервере()
    Возврат РегистрыСведений.ГП_ЗданияБП77.ЗаполнитьПризнакПлатаЗаХолодноеВодоснабжениеОИ();
КонецФункции

// Заполняет значения поля `ДоговорНомер` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
&НаСервереБезКонтекста
Функция ЗаполнитьНомераДоговоровНаСервере()
    Возврат РегистрыСведений.ГП_ЗданияБП77.ЗаполнитьНомераДоговоров();
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --
