// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область ОбработчикиКомандФормы

// Выполняет заполнение / обновление значений признака Негативное воздействие
&НаКлиенте
Асинх Процедура ЗаполнитьПризнакНегативноеВоздействие(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнено обновление значений признака ""ЭтоНегативноеВоздействие"" для всех записей регистра");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    // Заполнение / обновление значений признака Негативное воздействие
    РезультатЗаполнения = ЗаполнитьПризнакНегативноеВоздействиеНаСервере();

    // Вывод сообщения о результате
    ГП_ОбщегоНазначенияКлиент.СообщитьПользователюРезультатЗаполненияПоля(РезультатЗаполнения, "Негативного воздействия");
КонецПроцедуры

// ВЫполняет заполнение / обновление значений признака плата за ХВ ОИ
&НаКлиенте
Асинх Процедура ЗаполнитьПризнакПлатаЗаХолодноеВодоснабжениеОИ(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнено обновление значений признака ""ЭтоПлатаЗаХолодноеВодоснабжениеОИ"" для всех записей регистра");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    // Заполнение / обновление значений признака плата за ХВ ОИ
    РезультатЗаполнения = ЗаполнитьПризнакПлатаЗаХолодноеВодоснабжениеОИНаСервере();

    // Вывод сообщения о результате
    ГП_ОбщегоНазначенияКлиент.СообщитьПользователюРезультатЗаполненияПоля(РезультатЗаполнения, "Платы за ХВ ОИ");
КонецПроцедуры

// Выполняет заполнение / обновление значений поля ДоговорНомер
&НаКлиенте
Асинх Процедура ЗаполнитьЗначенияНомеровДоговоров(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнено обновление значений поля ""Номер договора"" для всех записей регистра");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    // Заполнение / обновление значений поля ДоговорНомер
    РезультатЗаполнения = ЗаполнитьНомераДоговоровНаСервере();

    // Вывод сообщения о результате
    ГП_ОбщегоНазначенияКлиент.СообщитьПользователюРезультатЗаполненияПоля(РезультатЗаполнения, "Номеров договоров");
КонецПроцедуры

// Выполняет заполнение / обновление значений полей Адреса
&НаКлиенте
Асинх Процедура ЗаполнитьАдресаЗданий(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Значения полей: [Улица, Дом] в регистре ГП_ЗданияБП77 будут обновлены для всех записей.");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    // Заполнение / обновление значений полей Адреса
    РезультатЗаполнения = ЗаполнитьАдресаЗданийНаСервере();

    // Вывод сообщения о результате
    ГП_ОбщегоНазначенияКлиент.СообщитьПользователюРезультатЗаполненияПоля(РезультатЗаполнения, "Адресов зданий");
КонецПроцедуры

// Выполняет сопоставление записей в регистре ГП_ЗданияБП77 со Зданиями из ИБ.
//  Для каждого найденного сопоставления устанавливается значение поля регистра ЛицевойСчет
&НаКлиенте
Асинх Процедура СопоставитьЗдания(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Значения поля Здание в регистре ГП_ЗданияБП77 будут обновлены для всех записей.");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    РезультатСопоставления = СопоставитьЗданияНаСервере();

    // Вывод сообщения о результате
    ТекстСообщенияРезультатОперации = "";
    Если РезультатСопоставления.Успех = Ложь Тогда
        ТекстСообщенияРезультатОперации = СтрШаблон("Сопоставление зданий не выполнено.
                |Сообщение о причине: %1", РезультатСопоставления.ТекстСообщения);
    Иначе
        ТекстСообщенияРезультатОперации = СтрШаблон("Сопоставление выполнено успешно.
                |Обновлено ""%1"" записей регистра", РезультатСопоставления.ОбновленныеСвязи.Количество());
    КонецЕсли;
    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРезультатОперации);
КонецПроцедуры

// Выполняет создание зданий для несвязанных записей регистра. Перед выполнением выполняется установка связей для зданий.
&НаКлиенте
Асинх Процедура СоздатьЗданияДляНесвязанныхЗаписей(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнена операция создания зданий
            |для несвязанных записей регистра.
            |Перед создание будет выполнена установка связей для зданий.");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    // Создание зданий
    РезультатСоздания = СоздатьЗданияДляНесвязанныхЗаписейНаСервере();

    // Вывод сообщения о результате
    ТекстСообщенияРезультатОперации = "";
    Если РезультатСоздания.Успех = Ложь Тогда
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание зданий не выполнено.
                |Сообщение о причине: %1", РезультатСоздания.ТекстСообщения);
    Иначе
        ТекстСообщенияРезультатОперации = СтрШаблон("Создание зданий выполнено успешно.
                |Создано ""%1"" зданий в ИБ", РезультатСоздания.СозданныеЗдания.Количество());
    КонецЕсли;
    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРезультатОперации);
КонецПроцедуры

// Выполняет обновление созданных автоматически помещений по данным номеров договоров из регистра данных БП77
&НаКлиенте
Асинх Процедура ОбновитьНаименованияПомещений(Команда)
    // Предупреждение пользователю о необратимости операции
    РезультатДиалога = Ждать ГП_ОбщегоНазначенияКлиент.СпроситьПользователяОГотовностиВыполнятьОперациюАсинх(
            "Будет выполнена операция обновления наименований
            |для автоматически созданных помещений по данным номеров документов из регистра.");
    Если РезультатДиалога = Ложь Тогда
        Возврат;
    КонецЕсли;

    // Обновление наименований помещений
    РезультатОбновления = ОбновитьНаименованияПомещенийНаСервере();

    // Вывод сообщения о результате
    ТекстСообщенияРезультатОперации = "";
    Если РезультатОбновления.Успех = Ложь Тогда
        ТекстСообщенияРезультатОперации = СтрШаблон("Обновление помещений не выполнено.
                |Сообщение о причине: %1", РезультатОбновления.ТекстСообщения);
    Иначе
        ТекстСообщенияРезультатОперации = СтрШаблон("Обновление помещений выполнено успешно.
                |Обновлено ""%1"" помещений в ИБ", РезультатОбновления.ОбновленныеПомещения.Количество());
    КонецЕсли;
    ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРезультатОперации);
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --

// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область СлужебныеПроцедурыИФункции

// Выполняет установку связей Зданий (объектов абонентов) БП77 и зданий в ИБ
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * ОбновленныеСчетчики - Массив из СправочникСсылка.КВП_Счетчики
//      * ТекстСообщения - Строка
&НаСервереБезКонтекста
Функция СопоставитьЗданияНаСервере()
    Возврат ГП_МиграцияЗданий.УстановитьСоответствияЗданийПоЛицевымСчетам(Истина);
КонецФункции

// Заполняет значения признака `ЭтоНегативноеВоздействиеЦСВ` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
&НаСервереБезКонтекста
Функция ЗаполнитьПризнакНегативноеВоздействиеНаСервере()
    Возврат РегистрыСведений.ГП_ЗданияБП77.ЗаполнитьПризнакНегативноеВоздействие();
КонецФункции

// Заполняет значения признака `ЭтоПлатаЗаХолодноеВодоснабжениеОИ` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
&НаСервереБезКонтекста
Функция ЗаполнитьПризнакПлатаЗаХолодноеВодоснабжениеОИНаСервере()
    Возврат РегистрыСведений.ГП_ЗданияБП77.ЗаполнитьПризнакПлатаЗаХолодноеВодоснабжениеОИ();
КонецФункции

// Заполняет значения поля `ДоговорНомер` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
&НаСервереБезКонтекста
Функция ЗаполнитьНомераДоговоровНаСервере()
    Возврат РегистрыСведений.ГП_ЗданияБП77.ЗаполнитьНомераДоговоров();
КонецФункции

// Заполняет значения поля Адреса здания для всех записей регистра.
//  Заполнение выполняется по данным наименования здания
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
&НаСервереБезКонтекста
Функция ЗаполнитьАдресаЗданийНаСервере()
    Возврат РегистрыСведений.ГП_ЗданияБП77.ЗаполнитьАдресаЗданий();
КонецФункции

// Создает новые объекты зданий и помещений по данным из БП77 (из регистра ГП_ЗданияБП77).
//  Создаются здания только для тех записей где нет связи со Зданием (не заполнено поле Здание).
//  Перед созданием выполняется процедура установки связей для записей регистра
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * СозданныеЗдания - Массив из СправочникСсылка.КВП_Здания
//      * ТекстСообщения - Строка
&НаСервереБезКонтекста
Функция СоздатьЗданияДляНесвязанныхЗаписейНаСервере()
    Возврат ГП_МиграцияЗданий.СоздатьЗданияПоДаннымЗаписейБП77();
КонецФункции

// Выполняет обновление созданных автоматически помещений по данным номеров договоров из регистра данных БП77
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * ОбновленныеПомещения - Массив из СправочникСсылка.УПЖКХ_Помещения
//      * ТекстСообщения - Строка, Неопределено
&НаСервереБезКонтекста
Функция ОбновитьНаименованияПомещенийНаСервере()
    Возврат ГП_МиграцияЗданий.ОбновитьНаименованиеАвтоматическиСозданныхПомещений();
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --
