// Гарант+ Килипенко 30.01.2025 [F00234009] Игнорировать начисления по услуге ГВС при распределении оплаты ++
#Область ПереопределениеСтандартногоФункционала

&ИзменениеИКонтроль("СформироватьЗапросТаблицыНачислений")
Процедура ГП_СформироватьЗапросТаблицыНачислений(ЭтоРаспределениеОднойСтроки, Объект)

    мЗапросТаблицыНачислений = Новый Запрос;
    мЗапросТаблицыНачислений.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

    // Авансы на добровольное страхование не распределяются. Поэтому надо исключить соответствующую услугу.
    Если НастройкиУчетаДобровольногоСтрахования.ВестиУчетНачисленийПоДобровольномуСтрахованию Тогда
        УсловиеНаУслугу = " И НЕ Услуга = &ДобровольноеСтрахование";
        мЗапросТаблицыНачислений.УстановитьПараметр("ДобровольноеСтрахование", НастройкиУчетаДобровольногоСтрахования.УслугаДобровольногоСтрахования);
    Иначе
        УсловиеНаУслугу = "";
    КонецЕсли;
    #Вставка // Гарант+ Килипенко 30.01.2025 [F00234009] Игнорировать начисления по услуге ГВС при распределении оплаты ++

    // Список услуг для игнорирования в распределении авансов
    УслугиДляИгнорирования = Новый Массив();
    Попытка
        УслугиДляИгнорирования.Добавить(ГП_РаботаСУслугами.ПолучитьУслугуГорячееВодоснабжение()); // ГВС
        УслугиДляИгнорирования.Добавить(ГП_РаботаСУслугами.ПолучитьУслугуНегативногоВоздействияНаЦСВ()); // Негативное воздействие
    Исключение
        ОбщегоНазначения.СообщитьПользователю("ВНИМАНИЕ! Услуги для игнорирования при распределении авансов не найдены");
    КонецПопытки;

    // Услуга ГВС не должна учитываться при распределении оплаты
    Если УслугиДляИгнорирования.Количество() > 0 Тогда
        Для каждого УслугаИгнорирования Из УслугиДляИгнорирования Цикл
            НаименованиеПараметраУслуги = "ГП_Услуга_"
                + СтрЗаменитьПоРегулярномуВыражению(УслугаИгнорирования.Наименование, "(?i)[^a-zа-я0-9]+", "");

            УсловиеНаУслугу = СтрШаблон("%1 И Услуга <> &%2", УсловиеНаУслугу, НаименованиеПараметраУслуги);
            мЗапросТаблицыНачислений.УстановитьПараметр(НаименованиеПараметраУслуги, УслугаИгнорирования.Ссылка);

            ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
                "ВНИМАНИЕ! Услуга ""%1"" не будет учитываться при распределении аванса", УслугаИгнорирования.Наименование));
        КонецЦикла;
    КонецЕсли;

    #КонецВставки // Гарант+ Килипенко 30.01.2025 [F00234009] Игнорировать начисления по услуге ГВС при распределении оплаты --

    мЗапросТаблицыНачислений.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	УПЖКХ_НачисленияОбороты.Услуга,
    |	УПЖКХ_НачисленияОбороты.ЛицевойСчет,
    |	УПЖКХ_НачисленияОбороты.СуммаНачисленияОборот КАК СуммаПоУслуге
    |ПОМЕСТИТЬ врТаблицаНачислений
    |ИЗ
    |	РегистрНакопления.УПЖКХ_Начисления.Обороты(
    |			&ДатаНачала,
    |			&ДатаОкончания,
    |			,
    |			Организация = &Организация
    |					И (РазделУчета = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_РазделыУчета.НачислениеУслуг)
    |					И НЕ ВидНачисления = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_ВидыНачислений.Оплата)
    |					И НЕ ВидНачисления = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_ВидыНачислений.ЗачетДолговИПереплат)
    |					И НЕ ВидНачисления = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_ВидыНачислений.ПерерасчетНачисления)
    |				ИЛИ РазделУчета = ЗНАЧЕНИЕ(Перечисление.УПЖКХ_РазделыУчета.НачислениеПоПУ))
    |				И ЛицевойСчет В (&СписокЛС)" + УсловиеНаУслугу + ") КАК УПЖКХ_НачисленияОбороты";

    КоличествоМесяцев = мНастройкиУчетнойПолитикиТСЖ.КоличествоПериодовНачисления;
    КонецПериода = КонецМесяца(Дата);

    ДатаКон = КонецМесяца(ДобавитьМесяц(КонецПериода, - 1));
    ДатаНач = НачалоМесяца(ДобавитьМесяц(ДатаКон, - КоличествоМесяцев + 1));

    мЗапросТаблицыНачислений.УстановитьПараметр("Организация",   Организация);
    мЗапросТаблицыНачислений.УстановитьПараметр("ДатаНачала",    ДатаНач);
    мЗапросТаблицыНачислений.УстановитьПараметр("ДатаОкончания", ДатаКон);

    Если ЭтоРаспределениеОднойСтроки Тогда
        // Если это распределение только одной строки оплаты, то данные по начислениям
        // для распределения авансов получим только по одному объекту.
        мЗапросТаблицыНачислений.УстановитьПараметр("СписокЛС", Объект);
    Иначе
        // Если же распределение всего документа, то данные получаем сразу по всем строкам оплаты.
        мЗапросТаблицыНачислений.УстановитьПараметр("СписокЛС", ЛицевыеСчета.ВыгрузитьКолонку("Объект"));
    КонецЕсли;

    мЗапросТаблицыНачислений.Выполнить();

КонецПроцедуры

#КонецОбласти // ПереопределениеСтандартногоФункционала
// Гарант+ Килипенко 30.01.2025 [F00234009] Игнорировать начисления по услуге ГВС при распределении оплаты --
